[{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83279c9b04f3f624d7a1"],"topics":[],"reviews":[],"meta":{"ratingCount":51272,"studentCount":260405,"avgRatingScore":4.6633162,"contentVideoLength":131746},"basicInfo":{"udemyCourseId":438522,"slug":"complete-blender-creator-learn-3d-modelling-for-beginners","title":"Complete Blender Creator: Learn 3D Modelling for Beginners","subtitle":"Use Blender to Create Beautiful 3D models for Video Games, 3D Printing & More. Beginners Level Course","image":"https://img-c.udemycdn.com/course/240x135/438522_500f_6.jpg","price":3670170,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["Use Blender and understand it's interface","Understand the principles of modelling","Create 3D models with simple colors","Learn the basics of animation","Create your own materials","UV map and unwrap your models"],"requirements":["Mac or PC capable of Running Blender Version 2.8 or above"],"description":"<p><strong>This course is continually updated in response to student suggestions - it has been completely updated to Blender 2.8 or later.</strong></p><p>Blender is a fantastic platform which enables you to make AAA-quality models which can be exported to any game engine, 3D printer, or other software. Here are some of the reasons <strong>why you want to learn Blender with this online tutorial...</strong></p><ul><li><p>Create assets for video games.</p></li><li><p>Make unique 3D printed gifts.</p></li><li><p>Design your dream house, car, etc</p></li><li><p>Express yourself through 3D artwork.</p></li></ul><p>Learn how to create 3D Models and Assets for games using Blender, the free-to-use 3D production suite. <strong>We start super simple</strong> so you'll be ok with little or no experience. With our online tutorials, you'll be amazed what you can achieve.</p><p>The GameDevtv team has created some of the world's most popular online game development training courses. This Blender course has been enjoyed by hundreds of thousands of students and is consistently ranked the #1 Blender course on Udemy in terms of rating and popularity.&nbsp; </p><p>The course is <strong>project-based</strong>, so you will applying your new skills immediately to real 3D models. All the project files will be included, as well as additional references and resources - you'll never get stuck. There are talking-head videos, powerful diagrams, quality screencasts and more.</p><p>For each of the models that you build you will follow this process...&nbsp; </p><ul><li><p><strong>Be challenged</strong> to build the entire model yourself.</p></li><li><p><strong>Be shown</strong> step-by-step how to build it.</p></li><li><p><strong>Apply your knowledge </strong>regularly.</p></li></ul><p>Have a more specific focus? Check out our other Blender courses which focus on characters and environments. Want to bring your models to life in a video game engine? Check out our Complete Unity Developer 3D course. Just look for our green leaf logo - a sign of passion &amp; quality.</p><p>You will get full <strong>lifetime access</strong> for a single one-off fee. The creators are qualified and experienced with modelling and coding, so are able to explain complex concepts clearly, as well as entertain along the way. By the end of the course, you'll be very confident in the basics of 3D modelling and rendering, and hungry to learn more.</p><p><strong>If you're a complete beginner, we'll teach you all the modelling fundamentals you'll need.</strong> If you're an artist, we'll teach you to bring your assets to life. If you're a coder, we'll teach you modelling and design principles.</p><p>Get plugged into our communities of amazing developers on Facebook (around 20k), in our own Community curated by our supportive and knowledgeable Teaching Assistants (17k views/day), and our student Discord chat group (10k live at any one time).</p><p><strong>Dive in now, you won't be disappointed! </strong></p><p><br></p>","suitableLearners":["Competent and confident with using a computer.","Artists who want to learn to bring their assets alive.","Game Developers who wish to expand their Skill Set.","Complete beginners who are willing to work hard."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-08-13T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-08-16T00:00:00.000Z"},"promotions":{"discountPrice":573500,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83279c9b04f3f624d7a1"],"topics":[],"reviews":[],"meta":{"ratingCount":27405,"studentCount":137084,"avgRatingScore":4.662253,"contentVideoLength":124879},"basicInfo":{"udemyCourseId":627730,"slug":"adobe-after-effects-complete-course-from-novice-to-expert","title":"Adobe After Effects: Complete Course from Novice to Expert","subtitle":"Adobe After Effects CC Create stunning Motion Graphics, VFX Visual Effects & VFX Compositing with 50+ practice projects.","image":"https://img-c.udemycdn.com/course/240x135/627730_83d0_31.jpg","price":1949670,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["How to use all of After Effects CC - in a dynamic, hands on approach.","Boost your creativity by completing 50+ Practice Activities and projects from simple to complex.","Create Motion Graphics to enhance your videos using a step by step, easy-to-use method.","Practice compositing techniques to achieve stunning video effects.","How to use specialized visual effects such Motion Tracking, Camera Tracking, Chromakeying, Rotoscoping, Stabilizing and many more…","Master Visual Time Effects on Videos and Motion Graphics.","Work in 3D space with Cameras, Lights and Shadows and practice your new skills with 3D Motion Graphics Projects.","How to Import and animate Illustrator Vector Graphics.","Create advanced Text Animation in 2D & 3D – cool stuff only in After Effects.","And much more for you to become an expert in Motion Graphics, Visual Effects and Compositing","Work with the latest Responsive Design Techniques"],"requirements":["No Prior Knowledge of After Effects, Visual Effects or Motion Graphics Required","A working copy of preferably After Effects CC 2021  or CC 2020","All project files are available in After Effects CC 2020, CC 2019 and CC 2018","Backward compatibility up to  After Effects CC 2017 for all projects"],"description":"<p><em>The Most Comprehensive, Bestselling&nbsp;&nbsp;and Highest Rated&nbsp;After Effects Complete Course&nbsp;with over 460+ Lectures and 35+ hrs of easy to follow video tutorials.</em></p><p><em>New Sections added periodically to give you the complete Adobe After Effects CC&nbsp;Course. The Ultimate Learning Experience with Hands On&nbsp;Practice Activities and Their Tutorials to cement and expand your learning.&nbsp;</em></p><p><em>After Effects CC: The Complete After Effects CC Course&nbsp;from Beginner to Advanced.</em><br></p><ul><li><p><strong><em>Tsui Lau: </em></strong><em>\"Great course covering so many areas and going into lots of detail. Louay was very descriptive and went through easy to follow, step-by-step stages which was very helpful as a complete AE beginner. Would recommend!\"</em></p><p><br></p></li><li><p><strong>Drek Fite<em>:</em></strong> \"<em>Louay is an excellent teacher. There is so much in this course, and there is no way that you can remember everything. However, I think it is the best overview of AE available. I've already come back to review certain portions of the course when working on various projects, and that is very helpful. Making good use of the Notes feature too for such a large course is helpful. Louay was extremely fast at responding to questions and viewing my work that I posted on YT. I would highly recommend this course.</em>\"</p><p><br></p></li></ul><p><strong><em>Restructured, Repackaged to give you an Ultimate Learning&nbsp;Experience. </em></strong></p><p>Motion Graphics and Visual Effects are&nbsp;becoming increasingly valuable and important in any video created. Learning how to create these animations using Adobe After Effects has become essential. Talents to create these kind of animations and effects are more and more in demand. It is also an easy way to earn money as a freelancer or resell your packaged animations on hundreds of sites on the web. </p><p><br></p><p><strong>Learn and Master&nbsp;Motion Graphics&nbsp;and Visual Effects in After Effects in this Comprehensive Course: <br></strong></p><ul><li><p>Understand the concepts behind Animation Techniques and Motion Design</p></li><li><p>Learn how to Design, Animate, and Sequence complete Motion Graphics Projects</p></li><li><p>Work with all the transformations basic and beyond</p></li><li><p>Learn easy, yet powerful, techniques to create the most complex animations</p></li><li><p>Create Stunning Visual Effects&nbsp;using&nbsp;Build in Effects (no expensive third party plugins)</p></li><li><p>Apply specialized effects such as Rotoscoping, Chromakeying, Camera Tracking and many more...</p></li></ul><p><br></p><p><strong>Mastering&nbsp;After Effects</strong></p><p>Learning the fundamentals and beyond of Motion Graphics and Visual Effects using Adobe After Effects is a very powerful tool at your fingertips. </p><ul><li><p>Motion Design: How to design attractive and realistic motion. </p></li><li><p>Visual Effects: How to create stunning visual effects be it on graphics or videos.</p></li><li><p>Compositing: How to create realistic attractive scenes while combining motion graphics, visual effects and videos</p></li></ul><p>You will go through creating useful and practical animations and learn how to use simple and complex animation techniques. This is not the type of ‘Tips and Tricks’ here and there course. This Course is a<strong> serious learning experience </strong>where you get to actually<strong> create serious animations </strong>and genuinely learn how to use After Effects and become a top notch animator and a visual effects artist.</p><p><br></p><ul><li><p><strong><em>Warren Bingham: </em></strong><em>When I learn anything online, the first thing I have to like is the instructor's voice. You're going to be listening to this person for a long time so you want to feel comfortable with the way they talk. Louay is awesome. The entire time I spent learning (and it was little bits mostly every day) it was like you were in a proper class with one of your friends showing you how to do things. He's got a great sense of humour and doesn't go so fast it's all a blur. I'm in no ways an expert on After Effects now, but I have a really good grounding to keep going. Highly Recommended!!! Thanks Louay. And if you're ever in Brisbane, Australia. Ping me a message and I'll take you out to dinner :) </em></p></li></ul><p><br></p><p><strong>Contents and Overview</strong></p><p>You will start with a fast track to get familiar with After Effects and Create a Crash Animation. You will then learn all about the essential transformations using practical animations and useful examples. You will build Projects and Videos from scratch and practically learn more about numerous features and functions of After Effects.</p><p>You will go through&nbsp;projects where you will learn how to create animation sequences and package a whole video.</p><p>Essential manipulation of the many methods in After Effects are covered with emphasis on practical use and not just an overview of methods.</p><p>Most importantly throughout the course the spirit of compositing, putting together Visual Effects and Motion Graphics is thoroughly covered. This experience is invaluable for you to master Visual Effects in After Effects.</p><p><br></p><p><strong>Here some of the techniques you will Learn:</strong></p><ul><li><p>The latest Responsive Design Techniques.</p></li><li><p>Create your First Motion Graphics Video.</p></li><li><p>How to Design and Animate a full motion graphic project.</p></li><li><p>How to create complex motion paths in After Effects.</p></li><li><p>How to import pretty complex motion paths from vector files.</p></li><li><p>How to use Spatial and Temporal Interpolation.</p></li><li><p>How to create Reveal Techniques using Track Mattes and Masks.</p></li><li><p>You'll master Important Animation techniques to help you create better animation faster.</p></li><li><p>Essential 3D&nbsp;Animation Techniques.</p></li><li><p>Advanced 3D with Cameras, Lights and Shadows.</p></li><li><p>3D Camera Orbit Null.</p></li><li><p>Complex, Compound and Bezier Shapes.</p></li><li><p>How to use the latest shape properties (2021)</p></li><li><p>Per Character Text Animation and how to use text presets</p></li><li><p>How to create the latest modern titles and lower thirds</p></li><li><p>How to use the Puppet Tools in CC 2018 and CC 2019 and CC 2021</p></li><li><p>How to Use Expressions - from simple linking to complex interpolations</p></li><li><p>How to create Animated Infographics</p></li><li><p>How to create Data Visualisation Charts</p></li><li><p>Animation Presets -&nbsp;Using, Editing, Creating and Saving Presets</p></li><li><p>How to Composite with Masks and Effects</p></li><li><p>Motion Graphics Time Games</p></li><li><p>Videos Time Games</p></li><li><p>Motion Tracking</p></li><li><p>Camera Tracking</p></li><li><p>Green/Blue Screen Chroma keying</p></li><li><p>Rotoscoping - Removing backgrounds</p></li><li><p>Importing and Animating Vector Graphics from Adobe Illustrator</p></li><li><p>Best Exports for YouTube, Vimeo and Facebook</p></li><li><p>Motion Graphics Visual Effects </p></li><li><p>Color Correction &amp; Color Grading</p></li><li><p>How to use the all&nbsp;New Scripts to Animate Mask points</p></li><li><p>Using&nbsp;the Essential&nbsp;Graphics Templates</p></li><li><p>Lots of compositing exercises</p></li><li><p>.... and so much more interesting and useful updates you will discover within the course</p></li></ul><p><br></p><p>Most Importantly this course offers you&nbsp;the chance to understand, practice and develop your skills in Visual Effects and&nbsp;Motion Graphics and lots of compositing.</p><p><br></p><ul><li><p><strong><em>Inger Wold</em>: </strong>\"<em>I have learned so much. I have already sold and made several videos. But this is still just the beginning, and the course made me able to find even more cool stuff. Still learning\"</em></p><p><br></p></li></ul><ul><li><p><strong><em>Abdulrazek Fawzy Abdulrazek: </em></strong>\"It's the Best Course In After Effects I have ever seen. <strong>Accurate + Fast + Smooth + Knowledgeable = Expert Instructor</strong>. Louay Makes you enjoy every bit he shows. Really if you want to Knock the real world of AE, come to Louay.\"</p><p><br></p></li></ul><ul><li><p><strong>Elizabeth Yorick:&nbsp; </strong>\"This is EXACTLY what I have been wanting!! A course with an instructor that actually explains everything!! He is also very prompt in reviewing your work, leaving comments and answering questions!! I would give this 10 stars if I could!!! Thanks Louay!!\"</p><p><br></p></li></ul><ul><li><p><strong><em>Prerana Golechha:</em></strong> \"Super Amazing Course. I recommend it to everyone who wishes to get a good hold on the subject. Thank you sir, for explaining the concepts well and for being so patient in answering all our queries.\"</p></li></ul><p><strong>Your Happiness Guarantee</strong></p><p>If you aren't happy with your purchase, we have a 30-day 100% money back guarantee. There's&nbsp; no reason to hesitate!</p><p><strong>Enroll now, and we'll see you inside the course!</strong></p><p>Louay</p>","suitableLearners":["Beginners in After Effects who want to start Learning Compositing ,Visual Effects, and Motion Graphics","Intermediate After Effects Users who want to polish their skills and learn more techniques to create better videos","YouTube Publisher looking to add Motion Graphics, Titles, Lower Thirds and VFX to their Videos","Video Editors looking to implement Visual Effects and Motion Graphics in their videos","Motion graphics artists and graphic designers"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-04-11T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-04-14T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83279c9b04f3f624d7a1"],"topics":[],"reviews":[],"meta":{"ratingCount":10532,"studentCount":84339,"avgRatingScore":4.6323166,"contentVideoLength":238626},"basicInfo":{"udemyCourseId":683198,"slug":"creating-3d-environments-in-blender","title":"Creating 3D environments in Blender","subtitle":"This course helps you creating wonderful environment scenes, organizing your workflow, and find the right inspiration.","image":"https://img-c.udemycdn.com/course/240x135/683198_ef78_7.jpg","price":2293770,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["Creating stunning unique environments","Organize your workflow to make large environment scenes","More than 250 unique 2K / 4K textures","Lots of medieval reference photos","E-book: Old Masters Unveiled ( 250 pages)","All scene assets, including buildings, rocks, grass, trees and more","6 Characters to fill up your scene","Full course documentation for the Blender basics chapter","Baking your models and importing in Unity 3D"],"requirements":["Blender version 2.81 or above","Computer ( min 16GB ram)"],"description":"<p><strong>Creating 3D environments in Blender</strong></p><p>After four years, the <em>creating 3D environments</em> course, is now finally here for Blender 2.81. Thousands of students participated in the first version of this course and there were a lot of requests for a follow-up course. Prepare for a new chapter in the world of 3D environments!</p><p><strong>The profession continues</strong></p><p>For centuries, making environments has been something that many artists do to impress other people. Since the advent of computer graphics there is a new wave of designers studying this lovely profession. This course reveals some fundamental lessons from the old painting masters. Use the course to get the max out Blender and learn to create high quality 3D environments.</p><p><strong>Starting from scratch</strong></p><p>The complexity of many scenes is often holding people back from creating environmental scenes in 3D. Most designers drop-out halfway and are then facing their unfinished work because it takes a lot of time and work to create scenes with architecture and nature. I faced this many times, but because I was so inspired by medieval architecture, I took the time to learn how to create 3D environments in a way in which I could express myself. During this process I struggled hard and made many unnecessary choices that slowed down my progression. The power of this course is that it shows you exactly what you need to design 3D environments and which details you might want to avoid or postpone in order to make the most out of your own progression.</p><p><strong>The road to perfection</strong></p><p>We all want to create beautiful scenes, but making these scenes can be a big challenge. This course is not only a technical education, it also covers topics like focus, inspiration and organization. I believe that a well-organized focused designer, with the right inspiration, will be able to make every 3D dream come to life. This course is well documented and guides you through the process of creating 3D scenes in Blender 2.81.</p><p><strong>From ruin to castle</strong></p><p>This course will guide you through the new Blender 2.81 interface. Together we make our first steps in Blender. Slowly we start building objects and after one chapter you will be able to make a small dice scene. This warming-up is needed to get used to the workflow and make you comfortable with Blender and the things that will come. Shortly after that, we will jump into the <em>node</em> editor. We will start mixing textures, just like the old painting masters, to get decent looking results. We will apply the material on a ruin and build the first environment scene. Then we will start building a farmhouse in a medieval style. We will use the workbench for modeling, <em>Eevee</em> for the texture work and <em>Cycles</em> to render the scenes to get the max out of it. After finishing the farmhouse, we merge the building with a nature environment. We will create the trees with the <em>sapling</em> add-on, so you will not need any external plugins. There is a full chapter about creating nature assets and in the final castle scene we will merge everything together to make a wonderful environmental scene. All content and textures come from <em>Texture/HDRI Haven</em> and are included in the course.</p><p><strong>About me</strong></p><p>My name is Rob Tuytel and I have been a environment designer for the past 13 years. I have a huge passion for the Dutch 17th century and mainly focus on medieval architecture. I run the platform <em>Texture Haven</em> together with Greg Zahl who also runs <em>HDRI Haven</em>. I recently completed my latest project <em>Batavia 1627</em>, a Realtime VR project for a Dutch museum. I love to study old environment paintings and use these as an inspiration for my work. You might know me from the <em>Tears of Steel</em> open Blender movie or from my previous environment course for Blender 2.79</p>","suitableLearners":["This course is meant for artists who like to grow in their workflow","Beginners","Environment artists","Game level  artists"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2020-10-26T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2020-10-29T00:00:00.000Z"},"promotions":{"discountPrice":344100,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83279c9b04f3f624d7a1"],"topics":[],"reviews":[],"meta":{"ratingCount":6656,"studentCount":36517,"avgRatingScore":4.678285,"contentVideoLength":23281},"basicInfo":{"udemyCourseId":1329786,"slug":"after-effects-motion-graphics-data-visualization","title":"After Effects - Motion Graphics & Data Visualization","subtitle":"Using Adobe After Effects create beautiful VFX Visual Effects, data visualization & VFX Compositing.","image":"https://img-c.udemycdn.com/course/240x135/1329786_8aa9_7.jpg","price":1949670,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["You'll learn to take Excel spread sheets and animate this in After Effects.","You’ll learn how to make animated pie charts, line charts & bar graphs.","You’ll learn how to create percentage counters.","You’ll learn how to animate icons making beautiful infographics.","You’ll learn how to create 'voice over' infographics.","You’ll learn all the animation techniques needed to bring your data to life.","You will have the finished files so you never fall behind.","Downloadable exercise files & cheat sheet.","Forum support from me and the rest of the BYOL crew.","Techniques used by professional motion graphic designers.","A wealth of other resources and websites to help your new career path."],"requirements":["You will need a copy of Adobe After Effects, Illustrator & Photoshop CC 2017 or above. 90% of the course will be done in After Effects but a few things are better done in Illustrator & Photoshop. A free trial can be downloaded from Adobe.","No previous motion graphic skills are needed.","No previous After Effects, Illustrator or Photoshop skills are needed."],"description":"<p><strong>Hi there, my name is  Dan. I’m a Adobe Certified Instructor and I LOVE animating infographics &amp; bringing potentially boring data to life using After Effects through Data Visualization.</strong></p><p>This course is for beginners. You don’t need any previous knowledge in VFX Compositing or any motion graphics experience. We’ll start with the super basics, taking simple icons breathing life into to them with After Effects.</p><p>We’ll work through a real life projects, connecting Excel into After Effects to transform your boring spreadsheet data into approachable visual information. We’ll experiment with lighting &amp; cameras. We’ll do some fun things with masking, looking at how important sound is in your presentation, all the way through to exporting for Youtube, Powerpoint and all sorts of social media including animated GIFS.  </p><p>There are projects for you to complete, so you can practice your VFX visual effects skills and use these for your portfolio. There is a cheat sheet and I’ve got exercise files so you can play along. I will also save my files as I go through each video so that you can compare yours to mine - handy if something goes wrong.</p><p>Know that I will be around to help - if you get lost you can drop a post on the video 'Questions and Answers' below each video and I'll be sure to get back to you.</p><p>What are you waiting for? Lets get making!</p>","suitableLearners":["This course is for people completely new to After Effects. No previous animation or motion graphic design experienced is necessary.","This is a relaxed, well paced introduction that will enable you to produce impressive video for your business or organization. Only basic computing skills are necessary - If you can send emails and surf the internet then you will cope well with our course."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-11-15T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-11-18T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83279c9b04f3f624d7a1"],"topics":[],"reviews":[],"meta":{"ratingCount":6543,"studentCount":22393,"avgRatingScore":4.6643496,"contentVideoLength":14483},"basicInfo":{"udemyCourseId":958668,"slug":"designing-for-3d-printing-with-fusion-360","title":"Designing for 3D Printing with Fusion 360","subtitle":"Learn to design for 3D printing with my easy to follow video lessons using Fusion 360","image":"https://img-b.udemycdn.com/course/240x135/958668_ecfb.jpg","price":1949670,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["Learn the skills to design your own models for 3D printing using  Autodesk Fusion 360, a very powerful and free software for 3D design."],"requirements":["The course is geared for beginners.  No prior knowledge in 3D design necessary"],"description":"<p>The real magic in 3D printing happens when you are able to create your own designs.  We will learn how to use Autodesk Fusion 360 to design ten practical and functional products that can be 3D printed.  Each lesson will build on the prior to introduce design concepts and best practices when when designing for desktop 3D printers.  Fusion 360 is free for students and hobbyists and is a very powerful designing tool.  By the end of the course you will have the skills and confidence to begin creating your own designs and start turning your ideas into physical objects.</p>","suitableLearners":["Designers, tinkerers, hobbyists, artists and anyone looking to learn how to design their own models for 3D printing"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-07-19T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-07-22T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83279c9b04f3f624d7a1"],"topics":[],"reviews":[],"meta":{"ratingCount":6475,"studentCount":23391,"avgRatingScore":4.5200415,"contentVideoLength":15539},"basicInfo":{"udemyCourseId":551930,"slug":"solidworks-become-a-certified-associate-today-cswa","title":"SOLIDWORKS: Become a Certified Associate Today (CSWA)","subtitle":"SolidWorks Training: Learn to Master SolidWorks to the Associate Certification Level Even if You are a Complete Beginner","image":"https://img-c.udemycdn.com/course/240x135/551930_3c01_2.jpg","price":1949670,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["Confidently list your SOLIDWORKS skills in your resume","Use SOLIDWORKS to design/draft your next innovation","Take, with confidence, the SOLIDWORKS Associate Certification test - CSWA","Self-learn advanced functions in SOLIDWORKS","Use SOLIDWORKS to make basic models"],"requirements":["You will need SOLIDWORKS 2013 or newer to open the models we provide throughout the course.","No prior knowledge. You just need the desire to learn and create awesome stuff."],"description":"<p>This is a streamlined course to take you&nbsp;from knowing nothing about SOLIDWORKS to give you all the knowledge and skills needed to become a certified SOLIDWORKS associate. This course should enable you to, with confidence, use SOLIDWORKS to design your next innovation. After this course, you can proudly list your SOLIDWORKS skills in your resume.</p><p>THIS COURSE IS NOT A SHORTCUT TO GET THE CERTIFICATE. We are following a learn-by-doing approach for you to truly master all the skills needed for the certification test.</p><p>*You can perfectly follow this course if you have SOLIDWORKS&nbsp;versions 2013, 2014, and 2015. However, this course is delivered using SOLIDWORKS 2015. &nbsp;Using SOLIDWORKS 2016 or newer? Check out our other courses because we have one specially made for you! We also have a Spanish course if you are more conformable with that. </p><p>==================</p><p><strong>About this course:</strong></p><p>With this course, you will get:</p><ul><li><p>Full, free lifetime access to 77&nbsp;lectures (increasing over time).</p></li><li><p>All future extra lectures and upgrades will always be free.</p></li><li><p>Unconditional Udemy 30 days <strong>money-back guarantee </strong>- We are sure you would love the course though :)</p></li><li><p>Regular free bonus additions to increase your knowledge. - lots of fun topics!</p></li></ul><p>Today, you can start your journey to becoming a SOLIDWORKS professional with ZERO prior experience!</p><p>I stress that you need no prior experience and there is nothing to buy or pay for!!! You will only need SOLIDWORKS itself.<br></p><p><strong><br></strong></p><p><strong>Why our course?!</strong><br></p><ul><li><p>Learn from the best, your instructor is the author of the book Learn SOLIDWORKS&nbsp;2020. </p></li><li><p>Have all your questions answered by experts in the course forum.</p></li><li><p>Get access to an exclusive students SOLIDWORKS&nbsp;community.</p></li><li><p>We are following the learning by doing approach which is proven the best for learning software like SOLIDWORKS.</p></li><li><p>We have <strong>enlarged the interface</strong> icons in our screencasts to make our videos more eye-friendly. We even enlarged the mouse cursor!!</p></li><li><p>We use annotations in all our lectures for easier follow-up.</p></li><li><p>We made our videos short and concentrated on one or a few aspects to make them easier for reference. We also designed each lecture to be a stand-alone lecture.</p></li></ul><p><br></p><p><strong>You will learn:</strong></p><ul><li><p>How to navigate through the SOLIDWORKS interface.</p></li><li><p>How to sketch with different sketch commands.</p></li><li><p>How to define sketches using relations or distances.</p></li><li><p>How to use more than 10 different features to create 3D models. (extruded boss and cut, fillet, chamfers, revolved boss and cut, swept boss and cut, lofted boss and cut)</p></li><li><p>How to create additional reference planes.</p></li><li><p>How to modify given parts to match design needs.</p></li><li><p>How to explore different materials for your models.</p></li><li><p>How to find your model's mass, volume, and center of gravity.</p></li><li><p>How to assemble different parts into an assembly file.</p></li><li><p>How to generate drawings from parts and models.</p></li><li><p>How to interpret different drawing annotations.</p></li></ul><p>Click the 'take this course' button, top right, now... Every hour you delay is costing you great creations and skills :)<br></p><p>Tayseer Almattar</p>","suitableLearners":["Individuals intending to take SOLIDWORKS Associate Certificate - CSWA","Individuals intending to learn the basics of SOLIDWORKS","Individuals wanting to get started with 3D modeling","Individuals wanting to get a better job via SOLIDWORKS skills","Individuals wanting to list SOLIDWORKS skills in their resume","Designers, Engineers, Makers, and Hobbyist"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-11-29T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-12-02T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83279c9b04f3f624d7a1"],"topics":[],"reviews":[],"meta":{"ratingCount":6423,"studentCount":31270,"avgRatingScore":4.6885233,"contentVideoLength":166384},"basicInfo":{"udemyCourseId":2302354,"slug":"the-blender-28-encyclopedia","title":"The Blender 2.8 Encyclopedia","subtitle":"Complete beginner-to-advanced guide for Blender 2.8 and 2.9","image":"https://img-c.udemycdn.com/course/240x135/2302354_4ddd_8.jpg","price":2293770,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["This is a comprehensive course for the free 3D modeling and animation package, Blender.","With this reference, you can confidently dive into Blender","You can watch this course from start to finish, or skip around.","Learn all the tools to create anything in 3D, and put it all into practice with step by step projects like modeling, shading, and rendering a 3D living room from start to finish."],"requirements":["Blender 2.8 or Blender 2.9","A curiosity for creation!","Blender is an Open Source and completely free 3D package. Information on how to download and install Blender is contained at the start of this course"],"description":"<p>Welcome to <strong>The Blender Encyclopedia</strong>, the most comprehensive training course available for Blender, a <strong>completely free and open source</strong> 3D production suite.</p><p><br>Our aim with the course was to make an expanded version of the Blender Manual, that you can follow along or reference at any time in your 3D journey.</p><p><strong><br>Further than the tools alone</strong>, we've made sure this course contains not just the <strong>how</strong>, but the <strong>why</strong>. Throughout the course, we've crafted example demos, as well as step by step projects, that will take what you've learned and form it into a practical example.</p><p><br>You can get all the <strong>Blender files </strong>used in the lectures, complete with models, textures and other resources. This includes starting files so you can join in! You can use these resource files in your own projects as well. Just open them up to see their license details, if any.</p><p><br>We have created this course specifically for Udemy, and you will have unlimited support from us in the Q&amp;A section of each lecture. See you in the course, and happy blending!</p><p><br></p><p><strong>An Overview of the Contents of this course:<br></strong></p><ol><li><p><strong>A full overview of Blenders interface. </strong></p><p><br></p></li><li><p><strong>Navigation and editing tools</strong></p><p><br></p></li><li><p><strong>Mesh Modeling</strong></p><p><br></p></li><li><p><strong>Drivers (known as wire properties or driven keys)</strong></p><p><br></p></li><li><p><strong>Constraints</strong></p><p><br></p></li><li><p><strong>Modifiers</strong></p><p><br></p></li><li><p><strong>Skeleton Armatures and Rigging</strong></p><p><br></p></li><li><p><strong>Animation tools</strong></p><p><br></p></li><li><p><strong>Shaders and Materials</strong></p><p><br></p></li><li><p><strong>UV Mapping</strong></p><p><br></p></li><li><p><strong>Cameras</strong></p><p><br></p></li><li><p><strong>Cycles and Eevee renderers</strong></p></li></ol>","suitableLearners":["Anyone interested in learning computer graphics, or switching from another 3D software to Blender","This course can be your expanded version of the Blender manual."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-04-12T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-04-15T00:00:00.000Z"},"promotions":{"discountPrice":344100,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83279c9b04f3f624d7a1"],"topics":[],"reviews":[],"meta":{"ratingCount":5873,"studentCount":28314,"avgRatingScore":4.5813017,"contentVideoLength":95831},"basicInfo":{"udemyCourseId":1556128,"slug":"maya-for-beginners-complete-guide-to-3d-animation-in-maya","title":"Maya for Beginners: Complete Guide to 3D Animation in Maya","subtitle":"Learn everything you need for 3D animation in Autodesk Maya: Modeling, Texturing, Lighting, Rigging, Animation, Dynamics","image":"https://img-b.udemycdn.com/course/240x135/1556128_9d8f_4.jpg","price":1949670,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["You will become comfortable using Autodesk Maya to model, texture, rig, animate, dynamics, light, and render","Build and design your own 3D objects","Animate your 3D objects with keyframes","Modeling, shading, texturing, lighting beautiful designs","Rendering your projects for high quality playback","Rigging a 3D character for animation","Simulating dynamic effects like water, cloth, and smoke","You will know how to put together an entire 3D animated scene!"],"requirements":["You should have Autodesk Maya to follow along with the course","Autodesk provides a free 1-year educational version and 30-day free trial of Maya from their website","3-button mouse"],"description":"<p>You can do your own 3D animations in Autodesk Maya!</p><p>Learn everything you need to know to get started - taught by a Hollywood professional!</p><p>As the industry standard 3D animation software, learning Autodesk Maya is a great skill to help you land a job in the film, music and gaming industry. In this course, you'll learn how to create your entire animation from scratch. </p><p><strong>What will you learn?</strong></p><ul><li><p>Getting started with Maya and understanding the interface</p></li><li><p>Modeling your own objects and scenes</p></li><li><p>Shading your objects</p></li><li><p>Creating proper UVs</p></li><li><p>Texturing your objects </p></li><li><p>Lighting your scene and creating shadows</p></li><li><p>Rendering your project</p></li><li><p>Rigging characters to prepare for animations</p></li><li><p>Animating with keyframes</p></li><li><p>Motion graphics animation (MASH) toolkit</p></li><li><p>Simulating dynamic effects like cloth and smoke</p></li><li><p>Putting together an entire scene</p></li></ul><p><strong>Learn by doing real world projects!</strong></p><p>Throughout this entire course, you'll be working on a <em>Dia de Los Muertos </em>inspired scene with a complete animated skeleton. By the end of the course, you'll truly be inspired by your own skills, and confident in using Autodesk Maya.</p><p><strong>What do you get when you enroll?</strong></p><ul><li><p>25+ hours of easy-to-follow tutorials</p></li><li><p>Bonus animation demonstrations</p></li><li><p>Downloadable project files for every step of the course</p></li><li><p>Premium support to help you as you take the course</p></li></ul><p><strong>Why learn from us?</strong></p><p>Lucas Ridley is a professional 3D animator who has worked on Hollywood films such as Steven Spielberg's Ready Player One. His students love him, and we're sure you're going to enjoy this class.</p><p>Lucas breaks down the most complicated steps of animating in Autodesk Maya, so that you can easily start animating on your own! </p><p>Phil Ebiner is the founder of Video School Online, and has taught over one million students around the world with our top-rated courses. We only partner with the best instructors, so you'll know that you're getting a great course with this one!</p><p><strong>Our 30-day 100% money-back guarantee!</strong></p><p> We want you to be happy. If there's any reason you aren't enjoying the course, and getting what you expected, we'll refund your money.</p><p><strong>We can't wait to see you in the course!</strong></p><p>Cheers,<br></p><p>Phil + Lucas</p>","suitableLearners":["We designed this course for complete beginners who want to get started with Autodesk Maya.","We designed this course for anyone that wants to learn 3D animation, and the tools used by professional animators in the film industry.","We designed this course for beginner Autodesk Maya users who want to take their skills to a more advanced next level."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-11-01T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-11-04T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83279c9b04f3f624d7a1"],"topics":[],"reviews":[],"meta":{"ratingCount":4746,"studentCount":29564,"avgRatingScore":4.6119113,"contentVideoLength":40178},"basicInfo":{"udemyCourseId":1630508,"slug":"manga-art-school-how-to-draw-anime-and-manga-course","title":"Manga Art School: How to Draw Anime and Manga Course","subtitle":"Learn how to draw anime and how to draw manga, easily and professionally in this Manga Art Course","image":"https://img-c.udemycdn.com/course/240x135/1630508_94eb_5.jpg","price":1949670,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["How to Draw Manga Characters","How to Draw Anime Characters","How to Draw to a Professional Level","How to Draw out of your Head","How to Draw with Pencils and Paper or Digital Tools","How to Draw in 3D and with Skill","How to Draw Anime Eyes"],"requirements":["You should have a desire to draw authentic Manga and Anime style Characters","You should have a desire to reach a professional level of Manga and Anime Character drawing"],"description":"<p><strong>What is Manga Art School?</strong>\n</p>\n\n<p>Manga Art School is a 2-6 week learn-anywhere video course where you learn to become adept at drawing professional and authentic Japanese Manga and Anime character stylization. I’ve hand-crafted the Manga Art School: Anime and Manga Style Character Drawing course to be the only course you need, to learn all the core fundamentals and advanced stylization and proportional knowledge needed to draw and sketch Manga and Anime style characters well. If you’re an absolute beginner or you’re already at an intermediate level, the course will advance your current ability to not only a professional level, but help you achieve an authentic and appealing manga or anime style in your character work. You won't end up with Anime or Manga characters that don't look \"quite\" like true manga style - no, this course will show you how to achieve a real Japanese Anime and Manga stylization of your work.. The course is a comprehensive 6 module guided video course, where the only limit to your progression is your determination and engagement in learning the concepts and engaging in the rewarding assignments.</p>\n\n<p>Whether you want to draw stylized characters for Manga, Anime, or Manga genres such as Shoujo, Shounin, Bishoujo, your own Doujinshi, or Kodomo manga style characters, this is <em>the</em> course you need to get you there.</p>\n\n<p>I’ll teach you to draw in a true manga style without<em> fear</em>. I’ll teach you to draw an authentic manga style <em>well</em>.</p>\n\n<p><strong>Finally, Learn Manga and Anime Style Drawing Well</strong></p>\n\n<p>Whether you’re a complete beginner, or intermediate at drawing Manga styles, you’ll learn things you never knew you never knew. Immense time and research, as well as years of drawing experience have gone into creating a course that distills the core information you need to know, in order to draw convincing and authentic manga or anime style characters. I’m so convinced of this, I’ll give you a no-questions asked refund if you’re not satisfied.</p>\n\n<p><strong>Clear, Easy to Understand Lessons</strong></p>\n\n<p>Crystal clear in fact. Learning Manga and Anime stylization effectively means having information presented in a logical and coherent way. The Manga Art School Course is modular by design, easy to grasp, and allows you to learn in a well paced, structured way. Engage in the course chronologically, then revise each module at your leisure. Grasp concepts faster than you ever have before – there’s no fluff here. (and really, this no fluff promise is in <em>all </em>of my courses!)</p>\n\n<p><strong>Assignments that are Rewarding</strong></p>\n\n<p>Bridging the gap between theory and practice, each module’s assignments have been designed to both reinforce theory, and feel rewarding. I’ve taken the core of the theory, and purpose built each assignment to help you rapidly progress, and you’ll see the difference in your own work almost immediately. Art is about doing, so let’s get started.\n</p>\n\n<p><strong>What's Your Style?</strong></p>\n\n<p>Anime and Manga is not simply one single style, but has many, many variants. This course teaches you the foundational stylistic rules that are common among all styles, allowing you not only to draw authentic manga and anime characters, but create your own style that is still true to the original Japanese principles. I'm not teaching you a 'method' or a 'way' to draw the styles, I'm teaching you to be a fundamentally good Manga and Anime style character artist.</p>","suitableLearners":["Anyone who wants to learn to draw authentic and appealing Manga and Anime style Characters","Individuals who love Anime, Manga, Manga Drawing, Shoujo, Shounin, Bishoujo, Doujinshi and Kodomo Manga","All Otaku are welcome!"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-10-13T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-10-16T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83279c9b04f3f624d7a1"],"topics":[],"reviews":[],"meta":{"ratingCount":3792,"studentCount":22554,"avgRatingScore":4.2870927,"contentVideoLength":72889},"basicInfo":{"udemyCourseId":269778,"slug":"3ds-max-v-ray-3ds-max-pro-in-6-hrs","title":"3ds Max + V-Ray: 3ds Max PRO in 6 hrs","subtitle":"3ds Max intro course:  3Ds Max and V-Ray for creating 3D architectural imagery, from beginner to advanced","image":"https://img-b.udemycdn.com/course/240x135/269778_a286_16.jpg","price":1949670,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["Learn 3ds Max + V-Ray from scratch by creating your first arch viz project in the first 6 hrs of the course","Take your rendering knowledge from basic to pro by following along with multiple projects using a pro workflow","Become comfortable creating with the two industry standard software packages, 3ds Max and V-Ray","Learn to use Photoshop for texture creation and post-processing your renderings","Learn Vray materials, lighting and cameras.","Provide the foundation for starting a career in 3d visualization.","Complete your first photoreal, professional rendering using 3ds Max and Vray.","Improve your lighting, composition, and post-processing skills","Start creating professional looking 3d visualization by following along with the course projects.","After learning the basics with the first projects, jump into more advanced projects with the latest versions of the software","New content added regularly","Adjust your knowledge for the most up to date versions of the software"],"requirements":["64 bit Windows operating system","Computer and Internet","Ability to download / install trial software","Basic computer knowledge","Knowledge of CAD, 3d software, photo editing, art / illustration -- helpful but not necessary.","Previous experience in a design field is helpful, but also not necessary."],"description":"<p>&nbsp; \t<strong>*Course Updated 09/11/2020 </strong>- A complete revamp of the course to bring it up to speed with the newest software. Includes an entire new project from start to finish with various professional model / texture downloads for your use in learning.</p><p>*Much more content coming soon (advanced techniques for arch viz, interior renderings with V-Ray, animation, etc)</p><p><strong>*I'll be your technical support </strong>-<strong> </strong>I answer questions every day in the discussion area, and I always respond to your private messages.&nbsp; In these advanced computer programs, you will inevitably run into technical problems.&nbsp; I am always here to answer all your questions and help you troubleshoot.&nbsp; You can't find another course anywhere that gives you this much training, from a practicing professional, who is also at your beckon call to help, for such a reasonable price.&nbsp; </p><p><strong>*Recent Student Feedback</strong></p><p>&nbsp; \t&nbsp; &nbsp; &nbsp; \"The Missing Link&nbsp; </p><p>&nbsp; \t&nbsp; &nbsp; &nbsp; Having done numerous on-line 3D courses I am always looking for new ways of doing things to speed up production and modeling. The course although basic is very well structured with very few ambiguities. What Adam outlines in the Intro clip is what you should achieve relatively easily by the end of the course. . The only downside is that he hasn't done more advanced Visualisation courses yet. When they do come on stream I will no doubt enroll as his skill and experience within the industry comes through in his presentation.\"&nbsp; NOTE: I do, in fact, have some more advanced classes now.&nbsp; </p><p>&nbsp; \t&nbsp; &nbsp; \"This course is perfect for the beginners in 3ds max and V-ray. The information is clear and easy to understand. The course was a blast...\"&nbsp; </p><p><strong>About This Course:<br></strong></p><p>When I&nbsp;first made this course, it was to fill a void that I noticed in the arch viz industry. There are not a lot of tutorials out there that help you to learn arch viz from the beginning in a professional way, using the PRO software and a PRO workflow. So, I created this course, and I never could have imagined how popular it has become! It has also evolved a lot since that first time I published. Here are some key things to know:</p><p>ORIGINAL COURSE</p><ul><li><p>teaches 3ds Max and V-Ray from the very beginning</p></li><li><p>follows a project from nothing, all the way to the end</p></li><li><p>demonstrates the exact workflow that I use daily as a practicing professional (thus the <strong>PRO</strong> part)</p></li><li><p>uses my UI setup, shortcuts, etc (all downloadable for your use)</p></li><li><p>shows you everything you need to know to create a basic project</p></li><li><p>uses 3ds Max 2011, so as long as you have any version after that, you should be able to follow (updates have been made where necessary to account for changes all the way up to most current versions)</p></li><li><p>contains <strong>6 HRS </strong>of video from start to finish</p></li></ul><p>ADDITIONAL CONTENT</p><ul><li><p>brings you up to speed with the latest versions of the software and fills in the gaps where they exist</p></li><li><p>more advanced techniques (i.e. HDRI lighting, etc)</p></li><li><p>more advanced and complex projects&nbsp;</p></li><li><p>currently two additional projects to&nbsp;follow along with, including an advanced interior and exterior.</p></li><li><p>much higher production quality than original videos</p></li><li><p>awesome new content being added regularly to make you aware of new techniques, software updates, etc.</p></li><li><p>new projects coming soon</p></li></ul><p><strong>About 3ds Max and V-Ray:</strong></p><p>&nbsp; \t&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Knowing how to use these two programs together is a valuable skill. Seriously, I taught myself how to use these programs many years ago, and now I get paid quite well for my expertise.&nbsp; 3d is not just my hobby, it is also how I support my family.&nbsp; You can learn, and start a career in 3d too.&nbsp; Everything you need to get started is in this course.&nbsp; I will take you through 3ds Max and V-Ray from the very beginning, and by the end you will be well on your way to creating your own images and filling up your portfolio with polished work.&nbsp; Keep in mind, you <strong>do not </strong>typically need formal training to get a job in 3D.&nbsp; What it takes is an awesome portfolio, so let's get started on yours.&nbsp; </p><p>&nbsp; \t<strong>Some Questions To Ask Yourself:</strong>&nbsp; </p><ul><li><p><strong>Are you currently in a job you do not enjoy?</strong><em>Jobs in 3d are seriously fun and rewarding!</em></p></li><li><p><strong>&nbsp; &nbsp; Are you an architecture student who feels overwhelmed sometimes trying to learn complicated software just to present your design properly?</strong> <em>This course can get you up and running QUICK!&nbsp; Plus, you'll learn it the right way, from a pro.</em>&nbsp; \t&nbsp; \t</p></li><li><p><strong>&nbsp; &nbsp; Are you a SketchUp user who is no longer satisfied with the modeling / rendering capabilities of SketchUp, and are ready to take your 3d skills to the next level?</strong> <em>SketchUp is great at what it does, but it falls short when it comes to making flashy, photoreal images.&nbsp; Also, bring your sketchUp with you, then learn to import it into 3ds Max and render with V-Ray, the best render engine out there.</em>&nbsp; \t&nbsp; \t</p></li><li><p><strong>&nbsp; &nbsp; Are you a practicing architect that needs a better way to portray your designs to clients? </strong><em>You've come to the right place.&nbsp; I am an expert at just that.</em>&nbsp; \t&nbsp; \t</p></li><li><p><strong>Maybe you're a gamer who wants to create your own game assets?&nbsp; </strong><em>Even you should learn 3ds Max.&nbsp; It is the industry standard for video games, and I personally have used it for asset creation for my unity 3d games.&nbsp; </em>&nbsp; \t&nbsp; \t</p></li></ul><p>&nbsp; \t<strong>Course Structure (Original 6 hrs of instruction)</strong></p><ul><li><p>For absolute beginners, I will show you how to get the software as a free trial and start finding your way around.&nbsp; I will also go over how to customize your UI for a professional workflow, because why learn the slow way to do things, right?&nbsp; I'll also share with you my custom UI files.&nbsp; Of course, you can skip all of this if you are more seasoned.</p></li><li><p>Next we will start with the basics of modeling.&nbsp; I will show you different techniques, and we will begin to work on our project.&nbsp; Again, files will be provided if you want / need them.</p></li><li><p>With modeling down, we will go into V-Ray and start playing with lighting, materials, cameras, render settings, etc.</p></li><li><p>Finally, we will learn how to enhance our images with Photoshop.&nbsp; I give some great post-processing tips in this course.</p></li><li><p>By the end you will be able to create architectural renderings on your own with a completely professional setup and workflow.&nbsp; Then it is your turn to start practicing your skills, creating beautiful work, building a portfolio and landing a job.</p></li><li><p><strong>AFTER THE INITIAL PROJECT</strong> - once you have completed your first project and learned the basics, I will then move into more advanced techniques (also, there is fully professional interior V-Ray project coming soon that students will be able to learn along with -- this is for more advanced users, or people who are ready to move on from the initial 6 hrs of instruction)</p></li></ul><p>&nbsp; \t<strong>How Will This Course Benefit You?</strong>&nbsp; </p><p>&nbsp; \t&nbsp; &nbsp; If you are a beginner, this class will be a great overview of how to get up and running.&nbsp; It will cut out all the stuff you do not need and show you exactly the workflow necessary to work like a pro.&nbsp; </p><p>&nbsp; \t&nbsp; &nbsp; If you are a veteran user, take this course to polish your V-Ray skills, and also to streamline your workflow.&nbsp; I show so many tips and tricks that I use everyday to pump out arch viz projects fast and on budget.&nbsp; There is no need to sacrifice quality and creativity if you can fly through the project quickly and on budget.&nbsp; I'll show you how.&nbsp; </p><p>COMING SOON: If you feel like you have mastered the basics, I have now added more advanced / obscure techniques that can really help your images to stand out, and much more will be coming soon, including a professional V-Ray interior shot that is completely photoreal.</p><p>&nbsp; \t<strong>Ready To Sign Up?</strong>&nbsp; </p><p>&nbsp; \t&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; What are you waiting for?&nbsp; If you're still not sure, check out the preview videos.&nbsp; Also, check out my profile to the left and see some of my portfolio.&nbsp; Cool, right?&nbsp; Wan't to make some of your own images?&nbsp; Let's get started.&nbsp; 6 hrs is all you need to get started, then take the skills I share and practice, practice, practice.&nbsp; </p><p>&nbsp; \t&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Remember, I will provide the files and download links that you need for everything.&nbsp; My models are included.&nbsp; Come with nothing, leave with a finished project and a great knowledge base.&nbsp; </p><p>&nbsp; \t<strong>Start Your Love Affair With 3d Today!</strong>&nbsp; </p><p>&nbsp; \t&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; PURCHASE THE COURSE.&nbsp; </p><p>&nbsp; \t&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; *If the price isn't right, keep an eye out for Udemy promotions and coupon codes around the web, but I think a 6 hr training for $64 is a pretty good deal.&nbsp; Sure beats a semester at community college :)&nbsp; </p><p>&nbsp; \t&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; *30 day money back guarantee, no questions asked!&nbsp; (If you hate it, get a refund)&nbsp; </p><p>&nbsp; \t&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; -Adam Zollinger&nbsp; </p><p>&nbsp; \t&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Professional (self-taught and ready to teach you) 3d Artist&nbsp; </p>","suitableLearners":["Design professionals who want to learn 3D","Architecture students","SketchUp users looking to advance their skill set","Anyone with a vague interest in 3d","Draftsman who are interested in learning rendering","Architects","Current 3ds Max users who want to learn how to work with Vray","Gamers who want to learn to model their own game assets (especially architectural ones) in 3ds Max."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-01-23T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-01-26T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83279c9b04f3f624d7a1"],"topics":[],"reviews":[],"meta":{"ratingCount":3634,"studentCount":15568,"avgRatingScore":4.653077,"contentVideoLength":65318},"basicInfo":{"udemyCourseId":1227634,"slug":"complete-houdini-fx-19-bootcamp","title":"Complete Houdini FX 19 Bootcamp","subtitle":"Beginners guide to Houdini FX 19 : The most powerful 3D application in the world. No prior knowledge required.","image":"https://img-c.udemycdn.com/course/240x135/1227634_053c_19.jpg","price":1949670,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["You will learn how to create professional Explosions.","You will have solid knowledge on how to use Houdini.","You will learn how to create realistic oceans.","You will learn how to create Destruction.","You will learn how to Create full CG chocolate commercial using Houdini.","You will learn how to make sand and snow effects in Houdini.","You will learn how to use flip fluid solver inside Houdini.","You will learn how to make rain effect.","And much more....","You will fall in love with this software :)."],"requirements":["You must have passion to learn visual effects and Game effects.","You must have passion to learn Houdini.","You should know how to use the computer."],"description":"<p><em>Updates:</em></p><p>New section: Big scale explosion in Houdini 19</p><p>Barrel Explosion in Houdini 19: lectures number (68,69,70,71)</p><p>Introduction to explosions in Houdini 19</p><p>New lectures: 57,58,59</p><p>New lectures: 21,22,23,53,54,55,56</p><p>New section: Flip fluids</p><p>New section (Introduction to Pyro in Houdini 19)</p><p><em>Introduction section's outdated lectures are updated with new lectures and now is applicable in Houdini 19.</em></p><p><strong>-----------------------------------------------------------------------------------------------------------</strong></p><p><strong>This is the best selling Visual Effects Course.</strong></p><ul><li><p><strong>You will not find like this course anywhere.</strong></p></li><li><p><strong>No presentations, No time wasting, It's all about doing and creating.</strong></p></li><li><p><strong>This Course is Projects based Course, so you will learn Houdini by creating effects!.</strong></p></li><li><p><strong>This course is continually updated.</strong></p></li></ul><p><strong>Why you want to learn <em>Houdini FX?</em></strong></p><p><strong>Houdini FX </strong>is a visual effects and 3D animation software like Maya or Blender, but what makes Houdini different and unique is the procedural system and has very powerful dynamic system that other softwares don't have. You will be surprised about that.</p><p><strong>Houdini</strong> is the number 1 3D application that used in vfx,&nbsp;3D animation studios and Game studios, Houdini&nbsp;can create high quality effects like water, explosions, fire and sand....</p><p><strong>Houdini</strong> now is used by Big Game studios, they save 100X of the time by creating tools that are used in their Game Engine or in unreal engine or unity.</p><p>Knowing Houdini gives you very big&nbsp;advantage in the Game industry and in&nbsp;VFX companies.<br></p><p>If you are <strong>Game developer</strong> you must know at least a little bit how Houdini works, this gives you very big advantage in Game studios. In my course I will just teach you how to use Houdini, not teaching you how to use it for games. After you watch my course then you will be able to learn how to use it for games and in game engines like unreal engine or unity. i,e: I&nbsp;will not teach you how to use it for games, I just will teach you Houdini.</p><p>This course is very special, I will teach you how to use Houdini software to create interesting effects.<br>I will make it fun to learn and I will simplify every thing for you.</p><p><strong>Take the course now and&nbsp;I promise you won't disappointed!</strong><br></p><p><br></p><p>Q&amp;A</p><ol><li><p><strong>Is Houdini free software?</strong> Yes its free for non commercial use,and it called Houdini apprentice.</p></li><li><p><strong>Is there any limitation in&nbsp;Houdini apprentice?</strong> No, you Have all the tools that the paid version has ,and you can render your shots too, but the&nbsp; images output restricted to 1280x720 when rendering.</p></li><li><p><strong>I am game developer,do I&nbsp;need to learn Houdini?</strong> Yes, you must at least know a the basics of Houdini.</p></li><li><p><strong>How Houdini is used in Game studios?</strong> Say for example you have a game and you want to fill it with more than 1000 buildings,imagine how long this will take you right? But in Houdini you can create 1 building and then export it as Digital asset(Plugin) to Unreal Engine or Unity,and in Unreal Engine you can scatter the building in your game and give random variation to each building,like the size,the color,windows size,Height,width and so on.... Imagine how much time you saved! instead of creating 1000 buildings,you created just 1 building in Houdini, Not just buildings,this works for(sieges,tables,chairs,streets......)</p></li></ol><p><br></p>","suitableLearners":["Anyone wants to learn how to create visual effects from scratch.","Game developers who want to power up their games using Houdini.","Any one who have passion to learn Houdini."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-03-18T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-03-21T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83279c9b04f3f624d7a1"],"topics":[],"reviews":[],"meta":{"ratingCount":3436,"studentCount":15390,"avgRatingScore":4.3384795,"contentVideoLength":19510},"basicInfo":{"udemyCourseId":222122,"slug":"master-sketchup-a-definitive-guide-from-infinite-skills","title":"Master SketchUp  - A Definitive Guide From Infinite Skills","subtitle":"A easy to follow SketchUp course that teaches using practical examples.","image":"https://img-c.udemycdn.com/course/240x135/222122_ad46_6.jpg","price":1146770,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["Learn how to use SketchUp to create 3D models."],"requirements":["PC or Mac"],"description":"<p style=\"\">  \t This SketchUp 2013 training course from Infinite Skills teaches you how to model a home from scratch using this popular 3D modeling program. This tutorial is designed for the absolute beginner, meaning no prior experience with SketchUP or 3D modeling is required.  </p>  <p style=\"\">  \t <br style=\"\">  \t You will start by learning the basics of the drawing tools, and then quickly jump into learning to create different roof types. This course will show you how to organize the model, including creating the second floor and additional openings, using the outliner, and viewing layer states of the model. This video tutorial will show you how to create the different parts of a home, including the ceiling, staircase, doors and windows, fireplace, and kitchen. You will learn how to add furniture using the 3D warehouse and model the furniture from a photograph. You will then move to creating the exterior of the home, from setting the building in place to adding solar panels. Finally, Dan will show you various exporting options and how to create a rendering and animation.<br style=\"\">  \t <br style=\"\">  \t By the completion of this computer based training course, you will be comfortable using many of the basic and complex tools in SketchUp. Working files are included, allowing you to follow along with the author throughout the lessons.  </p>","suitableLearners":["Beginners to Intermediate Users"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2017-01-06T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2017-01-09T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83279c9b04f3f624d7a1"],"topics":[],"reviews":[],"meta":{"ratingCount":3058,"studentCount":10719,"avgRatingScore":4.719276,"contentVideoLength":27939},"basicInfo":{"udemyCourseId":1832808,"slug":"cinema-4d-masterclass-the-ultimate-guide-for-beginners","title":"Cinema 4D Masterclass: The Ultimate Guide for Beginners","subtitle":"Take your design skills to the next level, into the 3rd Dimension with this Cinema 4D Course","image":"https://img-c.udemycdn.com/course/240x135/1832808_2d0c_4.jpg","price":1490870,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["Be able to create eye-catching 3D designs and animations.","Foundations of Cinema 4D","3D Modelling and Animation","Countless tips and tricks","Best industry practices"],"requirements":["No prior knowledge of Cinema 4D is required to attend this training."],"description":"<p>Cinema 4D is without a doubt one of the most intuitive 3D applications out there. Nevertheless, trying to tackle this complex software by yourself can still be a daunting task.</p><p>This training course has been prepared to take you from knowing nothing, or just a little about Cinema 4D and teach you all the fundamental skills so you can start working on your own.&nbsp;</p><p>Ozgur, who is one of the very few <strong>Maxon Certified Cinema 4D Instructors</strong> in the world is going to show you how to create a&nbsp;<strong>3D project from scratch,&nbsp;</strong>and go through the entire process of a&nbsp;<strong>3D workflow</strong>, including&nbsp;<strong>modelling, lighting, texturing, animating and rendering.&nbsp;</strong></p><p>Along the way, you will learn countless&nbsp;<strong>tips and tricks</strong>&nbsp;as well as the&nbsp;<strong>industry standard techniques</strong>.&nbsp;</p><p>If you are a graphic designer, looking to<strong>&nbsp;add that extra dimension to your work</strong>, or perhaps a 2D motion designer looking to<strong>&nbsp;take your animation skills to the next level</strong>, then this course is for you. It is no secret that you can&nbsp;<strong>earn more</strong>&nbsp;as a designer if you add 3D to your skillset. This course is designed to teach you just you need to know in order to advertise yourself as a&nbsp;<strong>3D designer</strong>.&nbsp;</p><p>Packed with <strong>8 hours</strong>&nbsp;of intuitive and easy-to-follow tutorials, this training is all you need to kickstart your 3D journey. Together with each tutorial, there will be an&nbsp;<strong>exercise file&nbsp;</strong>that you can download and follow along.&nbsp;</p><p>If you are ready to step up your design game and move into the world of 3D, let's get started!</p>","suitableLearners":["Anyone with an interest in motion design, 3D animation, modelling and rendering.","Graphic Designers","Animators","Motion Graphics Artists"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-09-01T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-09-04T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83279c9b04f3f624d7a1"],"topics":[],"reviews":[],"meta":{"ratingCount":2866,"studentCount":12950,"avgRatingScore":4.782236,"contentVideoLength":117540},"basicInfo":{"udemyCourseId":1158660,"slug":"learn-zbrush-ultimate-course-4-beginnersintermediate","title":"Learn Zbrush-Ultimate course 4 beginners/intermediate","subtitle":"Zbrush Made Easy! Ultimate Zbrush 3d sculpting course for beginners/intermediate.","image":"https://img-c.udemycdn.com/course/240x135/1158660_b2f4_13.jpg","price":1949670,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["learn Zbrush, by an instructor that's not only a seasoned professional but also a studio owner, sitting on the other side of the hiring table!","Zbrush User Interface","Gizmo and Deformers","Different Brushes, like Standard, Smooth, Clay Buildup, Dam Standard,Trim Dynamic....","Alphas, Masking, Show/Hide","Dynamesh and Zremesher","Sculptris Pro","Zspheres","Booleans","Materials and Polypaint","UV MAPS","Polygroups, Panel Loops...","Rendering","Dynamics"],"requirements":["Basic computer knowledge, have Zbrush software installed on their computer, know English language"],"description":"<p><strong>!!Rated 10/10 on Coursemarks!! TOP 1% of 94,680 courses! </strong></p><p><strong>ONLY&nbsp;COURSE&nbsp;WITH&nbsp;Student Facebook Group for QnA/Guidance with over a 1400 members!!</strong></p><p><strong>Learn how to create amazing 3d sculpts, using industry's top digital software- Zbrush!</strong></p><p><strong>Guiding you on this journey is an award winning digital sculptor, Art Academy professor and a studio head with over 15 years of industry experience! </strong></p><p><strong>Every section comes with written learning material summarizing the most important points of the section!</strong></p><p><strong>Every section comes with a Quiz that will test your knowledge so you can make sure you learned all you need!&nbsp; </strong></p><p><strong>Download written learning materials and Zbrush tools so you can learn even when of-line!</strong></p><p><strong>Updating with new videos as Zbrush updates!</strong></p><p>Do you want to learn digital sculpting in Zbrush, by an instructor that's not only a seasoned professional but also a studio owner, sitting on the other side of the hiring table?! Learn the best possible approach and workflow to get from start to finished design, use essential tools that enable you to create any design in Zbrush. Get tips and tricks of the trade, inside thoughts of a studio project lead that will give you an edge when getting jobs in the industry! </p><p>A shout out to my friend Martin Punchev Vertexbee, how did the 2d design for the Turtle you see in the course title image!</p>","suitableLearners":["Beginner to mid level Zbrush users, artist who are looking to get into 3d sculpting, from designers, 2d artists, traditional sculptors, etc. Professionals who are looking to integrate digital sculpting into their workflow."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-12-27T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-12-30T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83279c9b04f3f624d7a1"],"topics":[],"reviews":[],"meta":{"ratingCount":2792,"studentCount":12306,"avgRatingScore":4.5974345,"contentVideoLength":31964},"basicInfo":{"udemyCourseId":1183846,"slug":"fusion-360-for-hobbyists-and-woodworkers","title":"Fusion 360 For Hobbyists and Woodworkers","subtitle":"Learn by doing!  Follow along as Mike teaches you to 3D model five projects from start to finish using Fusion 360.","image":"https://img-b.udemycdn.com/course/240x135/1183846_5cf2_4.jpg","price":2752570,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["Learn to model your woodworking projects in a 3D environment. ","Virtually prototype your ideas. ","Create plans and technical drawings from your designs. ","Create digital design files for 3D printing and CNC machining. "],"requirements":["You should be able to use a PC at a beginner level. "],"description":"<p>This course is designed to teach Fusion 360 in the way that I learn best - with start to finish project tutorials. As a self-taught 3D modeler, I found it difficult and frustrating to understand a <em>tool</em> or <em>process</em> without having any context for when it might be used.</p>\n\n<p>In \"Fusion 360 For Hobbyists and Woodworkers\" we model five different projects using only the tools necessary for <em>that</em> model. Each project gets progressively more difficult as you build on your newly acquired skills.</p>\n\n\n\n\n\n<p><strong>Why Learn CAD as a Hobbyist or Woodworker?</strong></p>\n\n\n\n\n\n<ul><li>Use CAD to save time, money and materials.</li><li>Work from your own plans.</li><li>\"Virtually prototype\" your ideas before building them.</li><li>Design projects for CNC and 3D printing.</li></ul>\n\n\n\n\n\n<p><strong>Why FUSION 360?<br></strong></p>\n\n\n\n\n\n<ul><li>Parametric modeling.</li><li>Design history timeline.</li><li>Joints and contact sets.</li><li>CAD and CAM in one.</li><li>It's FREE!</li></ul>\n\n\n\n\n\n<p><strong>What TOPICS Are Covered in This Course?</strong></p>\n\n\n\n\n\n<ul><li>95% in the \"Model\" workspace.</li><li>3D model woodworking and 3D printing/CNC projects.</li><li>Create plans and technical drawings.</li><li>Apply materials and appearances to your design.</li><li>Add functionality to your ideas.</li></ul>","suitableLearners":["Woodworkers and hobbyists to want to 3D model their projects before building them in the shop. ","People who want to design projects for 3D printing and CNC machines. "],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2020-04-07T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2020-04-10T00:00:00.000Z"},"promotions":{"discountPrice":389980,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83279c9b04f3f624d7a1"],"topics":[],"reviews":[],"meta":{"ratingCount":2607,"studentCount":12846,"avgRatingScore":4.528436,"contentVideoLength":121887},"basicInfo":{"udemyCourseId":2427460,"slug":"blender-28-the-complete-guide-from-beginner-to-pro","title":"Blender 2.8 The complete guide from beginner to pro","subtitle":"over the new version of Blender in this complete training from beginner to advanced","image":"https://img-b.udemycdn.com/course/240x135/2427460_e61d.jpg","price":1949670,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["Discover the software to integrate it into your workflow","Apprehend the interface and keyboard shortcuts for better efficiency","Modeling, rendering , lighting simple scenes","Animation , rigging, simulation, sculpting , texturing"],"requirements":["Good computer skills. The basics in 3d will be a plus but are not mandatory"],"description":"<p>This is a complete training dedicated to learning the Blender 2.8 software. Blender 2.8 and a free 3D software and opensource.</p><p>This complete training will allow beginners to discover the software entierely. Blender 2.7 users will find an opportunity to make the transition to the new version.</p><p>This training is divided into 15 chapters that will allow you to progressively and consistently learn. Most of the chapters are punctuated with exercises to review the features covered and implement them. The source files are included in the training and allow you to understand the progress of a project.</p><p>During the training we will produce in parallel a complete project to create a robot from modeling to animation, this project will allow you to apply the Blender functions learned in the course.</p><p>From discover ring the software, to polygonal modeling, object mode, edit mode, different rendering engines, scene lighting, realistic material creation, texturing, digital sculpture, animation, simulations, compositing, all these notions will be addressed in this training and will allow you to progress in the software.</p>","suitableLearners":["Anyone interested by Blender and open source. From the freelance graphic designer to the company wants to integrate open source."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2020-06-02T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2020-06-05T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83279c9b04f3f624d7a1"],"topics":[],"reviews":[],"meta":{"ratingCount":1998,"studentCount":17354,"avgRatingScore":4.4537315,"contentVideoLength":94793},"basicInfo":{"udemyCourseId":922654,"slug":"learn-3d-animation-the-ultimate-blender-guide","title":"Learn 3D Animation - The Ultimate Blender Guide","subtitle":"A-Z Guide to Learning 3D Animation and Modeling With Blender to Set You on Your Way to Creating Awesome 3D Artwork","image":"https://img-c.udemycdn.com/course/240x135/922654_100d.jpg","price":1949670,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["At the end of my course, students will know the basics and the more advanced skills to masterfully navigate and create their own works of 3D art","At the end of my course, students will feel confident navigating around Blender and the different tools to use and what they do","At the end of my course, students will be able to create their own characters and animation scenes and know all the different steps that it takes to go from nothing to a fully finished animation project"],"requirements":["All you need to do before is down Blender which is free and then bring your mouse and keyboard and join me on this adventure!","You can download GIMP which is a free photo editing software or use Photoshop or another software that you might have"],"description":"<p>Learn the A-Z's that you need to be able to create amazing 3D art and animations with the popular 3D art program, \"Blender.\"\n\n  </p><p>Beginner to the world of 3D? No problem! In this course we go from A-Z, from the basics to the more advanced of 3D creation. This course is <em>project based</em> so we will be using the skills we learn along the way to create some awesome artwork and animations. On top of that, we're going to have fun and end each video in a positive way that will leave us ready for whatever Blender or life throws at us!</p>\n\n<p><strong class=\"redactor-inline-converted\">Learn The Art of 3D From The Very Basics to The More Advanced</strong>\n\n  </p>\n\n\n\n\n\n<p>- We Start With the Fundamentals of 3D and Animation, Work Our Way Through the Ins and Outs of Blender Creating Projects Along the Way As We Learn &amp; We Finish With Making A Full Blown Animation!</p><p>-Become Confident With Navigating and Creating Within Blender and All the Different Tools Used Along the Way!</p>\n\n\n\n\n\n<p>- Step by Step Guide to Creating Your Very First Cartoon Character\n\n  </p>\n\n\n\n\n\n<p>- Animate Your Character For A Finished Product\n\n  </p>\n\n\n\n\n\n<p>-End With The Confidence and Know How to Be Able to Create Your Own Projects and Animations From Just An Idea to Finished Product</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">The Power to Create in the Palm of Your Hands\n\n \n\n </strong>\n\n  </p>\n\n\n\n\n\n<p>-Use the skills you learn to then create your own artwork and animations</p><p>-Learn and follow along with the workflow of a complete animation from A-Z</p><p>-Finish the course with your very own animations and work of art that you can be proud of</p><p>-Lifetime access!</p><p>Learning the basics and more advanced aspects of 3D creation gives you a useful and powerful skill. Blender is a free and powerful program.\n\n  </p>\n\n\n\n\n\n<p>3D arts is becoming more and more popular with demands in production studios and freelance work. With the fundamentals in your toolbox, you will be armed with the skills and knowledge to create some amazing artwork\n\n  </p>\n\n\n\n\n\n<p>Content And Overview\n\n  </p>\n\n\n\n\n\n<p>This course contains over 100 lectures and is designed for anyone who wants to learn the art of 3D graphics, regardless of if you have any experience or not.\n\n  </p>\n\n\n\n\n\n<p>In this course, you will learn the skills of 3D art which will enable you to create your very own 3D artwork. \n\n  </p>\n\n\n\n\n\n<p>You will learn by working through projects that will help you to master the art of 3D and come out of it with some awesome work of your own!</p>","suitableLearners":["This Blender 3D arts course is for anyone who has a desire to learn the arts of 3D who might not know anything or just a little bit about the subject but would like to dive in more and come out competent with creating 3D artwork and animations","This course is not for someone who already knows all the ins and outs of Blender"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2018-05-28T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2018-05-31T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83279c9b04f3f624d7a1"],"topics":[],"reviews":[],"meta":{"ratingCount":1713,"studentCount":8679,"avgRatingScore":4.607636,"contentVideoLength":67591},"basicInfo":{"udemyCourseId":1961224,"slug":"learn-3d-animation-the-ultimate-new-blender-28-course-a-z","title":"Learn 3D Animation - The Ultimate NEW BLENDER 2.8 Course A-Z","subtitle":"A-Z Guide to Learning 3D Animation in the NEW Blender 2.8!","image":"https://img-c.udemycdn.com/course/240x135/1961224_8876.jpg","price":3211370,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["Students will learn the all NEW Blender 2.8 and it's new interface. They Will learn the very basics all the way to the more advanced of creating animations in 3D using Blender 2.8","At the end of the course students will have the skills, knowledge and knowhow to create their very own animations from start to finish","Students will walk away with all the skills needed to create their very own animations and works of art from start to finished product!"],"requirements":["Download Blender 2.8 which is FREE and then just bring yourself and your excitement and willingness to learn!"],"description":"<p>Have you ever wanted to learn 3D and create some awesome animations? Blender 2.8 is out! And with it's release, a lot has changed! This NEW course will guide you through the A-Z's of creating some awesome animations using the new Blender 2.8 with BRAND NEW projects and animations!</p><p>Are you brand new to 3D and have never touched it before? Are you coming over from Blender 2.7 and need to learn the new Blender 2.8? Well this course is for you! We will go from the A-Z's of Blender and by the end create your first full blown animation!</p><p><strong>Learn The Art of 3D With The NEW Blender 2.8 From The Very Basics to The More Advanced!</strong>    </p><p>-Changes means NEW ways of doing things! We kick it off by learning the very basics of Blender 2.8 and the changes that have occurred!</p><p>-As we go along we learn more intermediate skills and become confident with using Blender 2.8 to create some awesome projects!</p><p>-At the end we go step by step for creating your first full blown animation from creating your character, texturing, rigging, animating and adding sound!</p><p>- Create projects, animations and models you can be proud of as you hone your skills!  </p><p>-Finish the course with the confidence, skills and knowledge to be able to create what you want from an idea in your head to finished 3D project!</p><p><strong>The Power to Create in the Palm of Your Hands      </strong>    </p><p>-As we progress along the course we will be met with projects and assignments to create some things we can be proud of!</p><p>-Learn and follow along with the workflow of a complete animation from A-Z</p><p>-Finish the course with skills that you can take with you and completed animations you can show everyone!</p><p>-Lifetime access!</p><p>Learning the basics and more advanced aspects of 3D creation gives you a useful and powerful skill. Blender 2.8 is a free and powerful program.    </p><p>3D arts is becoming more and more popular with demands in production studios and freelance work. With the fundamentals in your toolbox, you will be armed with the skills and knowledge to create some amazing artwork    </p><p>Content And Overview    </p><p>This course contains over 110 lectures and is designed for anyone who wants to learn the art of 3D graphics, regardless of if you have any experience or not.    </p><p>In this course, you will learn the skills of 3D art which will enable you to create your very own 3D artwork.     </p><p>You will learn by working through projects that will help you to master the art of 3D and come out of it with some awesome work of your own!</p>","suitableLearners":["Anyone who has zero knowledge of 3D, anyone from older versions of Blender or anyone who has some knowledge but would like to further their knowledge and go from A-Z","This course is NOT for someone who already knows EVERY in and out of Blender"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2019-05-13T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2019-05-16T00:00:00.000Z"},"promotions":{"discountPrice":458800,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83279c9b04f3f624d7a1"],"topics":[],"reviews":[],"meta":{"ratingCount":1618,"studentCount":8525,"avgRatingScore":4.65497,"contentVideoLength":6340},"basicInfo":{"udemyCourseId":1979694,"slug":"learn-to-storyboard-for-film-or-animation","title":"Learn to Storyboard for Film or Animation","subtitle":"An introduction to drawing storyboards for Film, TV, Animation or Gaming","image":"https://img-c.udemycdn.com/course/240x135/1979694_b127_8.jpg","price":1949670,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["You'll be able to draw storyboard panels for anyscript or story idea","You'll learn the entire process of storyboarding, for animation or for film, from start to finish","You'll know all the main camera angles and shots used in film, animation, tv and gaming","You'll learn directing and editing techniques","You'll learn concrete skills, like how to draw characters, layouts and scenes","You'll learn how to draw basic characters and character model sheets","You'll be able to draw scenes and backgrounds using 1-point and 2-point perspective","You will learn principles of animation and how to draw for animation","Become a Storyboard Artist"],"requirements":["A love of story telling, film, and visual language","You don't have to be able to draw - I'm going to teach you techniques for drawing that you can easily start using today","You can draw your storyboards on paper and follow this course; or you can use a drawing tablet such as a Wacom tablet and pen","Photoshop or a similar digital drawing application is preferable"],"description":"<p><strong>This is a complete overview of Storyboarding for Film, Animation or Gaming. By taking this online storyboard course, you will be taking your first steps towards an exciting career path. </strong></p><p>In this course, I take you step-by-step through the entire process of making storyboards: from how to draw, to what camera angles to use, to breaking down a script and drawing it out. I'm here to help and support you along the way.</p><p>This course covers everything you need to know to about the creative process of Storyboarding for Film or Animation. You will learn concrete skills such as <strong>how to draw characters</strong>, how to <strong>draw in perspective</strong>, what <strong>camera angles and shots</strong> to use for your scripts, and how to make your shots and scenes flow together. </p><p><strong><em>As a Storyboard Artist you get to draw the film, shot for shot</em></strong>. It's by far the most creative job in the whole production process. Whether you are interested in gaming, animation, sketching, comic books or filmmaking, the concepts and techniques in this course will get you started on the road to professional success. You can begin to <strong>build a portfolio</strong> from right within the course, or you can start <strong>storyboarding your own projects</strong> now to a professional standard. I've packed this course with only the most relevant and detailed material. <strong><em>I've distilled everything I've learnt in my 15 years as an animation and film professional into each lesson</em></strong>. </p>","suitableLearners":["Anyone who is interested in animation, how to draw storyboards, comics, thumbnails","If you are interested in film making and script writing","Filmmakers who need to know how to storyboard their own projects","Anyone interested in getting into professional animation storyboarding","Anyone who wants to be able to professional present their script, idea or concept in a visual format","Animators who want to develop storyboarding skills","Illustrators who want to get into animation"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-03-09T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-03-12T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83279c9b04f3f624d7a1"],"topics":[],"reviews":[],"meta":{"ratingCount":1404,"studentCount":8913,"avgRatingScore":4.604852,"contentVideoLength":67400},"basicInfo":{"udemyCourseId":732578,"slug":"learn-maya-a-beginners-guide-to-creating-realistic-scenes","title":"Learn Maya - A Beginners guide to Creating Realistic Scenes","subtitle":"Learn to create realistic models, texture, animate and render in Autodesk Maya from beginner level.","image":"https://img-c.udemycdn.com/course/240x135/732578_e509_5.jpg","price":1032070,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["Model objects in Maya","UV unwrap objects in Maya","Setup shaders for different types of material","Apply textures to shaders","Animate objects using keyfames","Animate objects using paths","Setup lighting in Maya","Render out images"],"requirements":["Students should be computer literate and willing to work hard.","Students must have access to a computer capable of running Autodesk Maya 2016."],"description":"<p><strong>UPDATED TO MAYA 2018!</strong></p><p>Explore the wonderful world of Autodesk Maya with this comprehensive introductory course. Maya is an industry standard 3d application used to create movies, games and graphics. In this course you will learn to create your own stunning imagery. </p><p><strong>Learn the fundamentals of Autodesk Maya</strong></p><ul><li><p>Install Maya</p></li><li><p>Learn the Maya UI</p></li><li><p>Model and texture realistic objects</p></li><li><p>Animate you models</p></li><li><p>Light and render your animations so they look great!</p></li></ul><p><strong>Benefits of Learning Maya for Beginners</strong></p><p>Maya is an industry standard application that is used by many high-end productions. By learning it you make yourself more employable. It has a flexible and wide toolset that can help you create high quality work quicker. This course is specifically designed to ease you into Maya, showing you the most common and powerful tools. It is a project based course that will teach you practical skills that you can use in your own work. This course comes with all the project files you need and work in progress files incase you get stuck.</p><p><strong>Structure of this course</strong></p><p>This course has five sections:</p><p><strong>How to install Maya</strong></p><p><strong>Maya Fundamentals</strong></p><p>In this section you take your first look at Maya and the user interface. You will learn the different editors and the basics of create objects and manipulating them</p><p><strong>Toy Train Project</strong></p><p>In this section you will create a toy train model and animate it along a path. You will learn how to light your train and apply materials to it. You will finish by rendering out your animation and view it.</p><p><strong>Wizard Desktop Project </strong></p><p>In this project you will create a desktop scene that you can customise and make your own! Dive deeper into the modelling tools and create a series of objects to create your scene. You will learn about texturing your objects and look at various different shaders to make different materials. You will also learn some more advanced lighting techniques and learn how to add atmosphere to your scene and render out a final image. This project is flexible enough to let you be creative with your own composition, lighting and look.</p><p><strong>Maya reference </strong></p><p>I have created this section to cover additional tools and settings which are extremely useful. </p>","suitableLearners":["This course is designed for complete beginners who are computer literate. ","Students who have previous knowledge of using Maya but want to fill in the gaps of their knowledge.","Students who have experience of other 3d software such as 3ds Max or Blender for example."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2019-02-12T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2019-02-15T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}}]