[{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fb39c9b04f3f624d682"],"topics":[],"reviews":[],"meta":{"ratingCount":10119,"studentCount":20474,"avgRatingScore":4.553008,"contentVideoLength":4547},"basicInfo":{"udemyCourseId":672290,"slug":"brilliant-customer-service-how-to-impress-your-customers","title":"Brilliant Customer Service: How to Impress your Customers!","subtitle":"Enhance your customer support and truly differentiate yourself from your competition!","image":"https://img-c.udemycdn.com/course/240x135/672290_54e4_5.jpg","price":458570,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["Acquire and immediately implement strategies that will ensure high quality customer service","Enhance their people skills in a way that will truly differentiate them from the competition","Handle any complaints they receive","Deal with difficult or angry customers"],"requirements":["There are no further requirements for this course, only the desire to attain a high quality customer service."],"description":"<p>The course is aimed at providing you with the opportunity to enhance your people skills in a way that will truly differentiate you from the competition. We will explore different models of high quality customer service, strategies to improve your skillsets, and tactics that your customer service representatives (CSRs) can easily acquire and implement immediately. Furthermore, you will learn how to handle any complaints you receive in a totally professional manner. <br> <br> You will be introduced to the benefits of customer relationship management (CRM) and will learn how it can become the vehicle that drives up your standards of service. <br> <br> </p>  <p>The most important elements of the course include:</p>  <ul><li>Face-to-face      contact with your customers</li><li>The      most effective use of telephone, email and CRM in the communication      process</li><li>How      to deal with difficult or angry customers</li><li>Liberating      your front line people so that they can truly enjoy the customer      experience </li></ul>  <p>The course is designed for the following groups of people:</p>  <ul><li>Those      who need to make strategic decisions about how their customer service      levels need to be adjusted</li><li>Those      in the front line of customer service</li><li>Customer      service relationship managers</li><li>Everyone      involved in relationship development and client acquisition</li></ul><p><br></p>    <p>Mr. Hunt’s style is often described as ‘inspirational’. His goal is to always create positive change in people with whom he works. He has significant experience in successfully operating at all organizational levels—from the induction phase, through first line management, and right up to board level. Additionally, he is able to strike the appropriate level of debate on every occasion.</p>  <p>Mr. Hunt is the MD and principal facilitator of UK Seminars. His work is well known in many countries, e. g., in Europe, in the USA, in the Middle East, and in India. His delegate evaluations are excellent, averaging 9.0 on a 10 point scale.</p>","suitableLearners":["People who need to make strategic decisions about how their customer service levels need to be adjusted","Customer service relationship managers","People in the front line of customer service","Everyone involved in relationship development and client acquisition"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2015-11-25T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2015-11-28T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fb39c9b04f3f624d682"],"topics":[],"reviews":[],"meta":{"ratingCount":9381,"studentCount":21592,"avgRatingScore":4.4284387,"contentVideoLength":6486},"basicInfo":{"udemyCourseId":430604,"slug":"12-strategies-for-dealing-with-difficult-people","title":"12 Strategies for Dealing With Difficult People","subtitle":"Learn how to confidently implement different strategies for dealing with difficult people.","image":"https://img-c.udemycdn.com/course/240x135/430604_c82f_3.jpg","price":1032070,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["Utilize communication tactics to prevent the difficult situation before it starts.","Impliment a host of communication stratigies to take control of a difficult situation.","Better articulate the reasoning behind the specific communication skills used in difficult situations.","Build communications skills","Increase confidence"],"requirements":["You should not need any outside materials or programs to take this course."],"description":"<p>I'm right there with you my friend. <strong> Difficult People Suck!</strong></p><p><br></p><p>Let me ask a few questions.</p><ul><li><p>Are you frustrated with difficult people?</p></li></ul><ul><li><p>Do you find difficult people to be challenging?&nbsp; </p></li></ul><ul><li><p>Who are some difficult people in your life?&nbsp; Your boss?&nbsp; Coworkers and customers?&nbsp; Your spouse/partner? Your kids?</p></li></ul><ul><li><p>Do you feel trapped?</p></li></ul><ul><li><p>Are you losing sleep? (This is a big healthy lifestyle red flag!)</p></li></ul><ul><li><p>Do you pause for a moment to take a deep breath before you go into work, or a meeting, just to prepare yourself for the onslaught you know you are going to deal with?</p></li></ul><ul><li><p>Have you ever looked at your paycheck to see if you have enough sick time built up so you just don't have to go into work today?&nbsp; How did you feel when you realized you didn't have enough time built up and you had to go it?&nbsp; Even sicker?&nbsp; &nbsp;I get it.</p></li></ul><p><br></p><p>Again, I'm right there with you my friend.&nbsp; </p><p>I have lost entire weekends due to the overwhelming stress caused by that one difficult customer I'm scheduled to meet on Monday morning.&nbsp; &nbsp;So much stress I couldn't leave it behind, even for a few hours, to really enjoy time with my family.&nbsp; Does this sentence sound familiar?&nbsp; “Your here but you are not really here.”&nbsp; I get it.</p><p><br></p><p><strong>Difficult people SUCK!</strong></p><p><br></p><p>I have screamed at the top of my lungs, in my car, while back fisting the passenger seat headrest to the point I’ve ripped the skin off my knuckles. </p><p>I even purchased a new mattress and pillow thinking that it might actually help me sleep through the night.&nbsp; It didn’t work.&nbsp; I still didn’t sleep well and the stress just kept building.</p><p>I’ve purchased Melatonin (sleep aid) even when it wasn’t on a Buy One Get One sale.&nbsp; I can also find the bottle of Tylenol PM in complete darkness at 02:00 AM.&nbsp; </p><p>I've walked away from jobs, that I've loved, due to a boss being so unreasonably difficult I just couldn't put my job in front of my health any longer.&nbsp; I don’t know if you’ve ever experienced this, but there must be some sort of science that explains why the air instantly seems fresher the moment you choose to walk (or run) away from a toxic situation.</p><p><br></p><p><strong>Difficult people are just unhealthy. </strong> </p><p><br></p><p>I’ve skipped meals because I was too stressed to eat which usually resulted in me hitting a drive-through just because “I just need something.”&nbsp; &nbsp;40+ pounds later…”Well, this isn’t working for me.”&nbsp; I get it.</p><p>Difficult people have caused me to be physically sick.&nbsp; I've felt physical back pain because I was so stressed out and tense knowing that I was going to be dealing with difficult co-workers tomorrow.</p><p><br></p><p>Let me ask a couple more questions:</p><ul><li><p>What would it feel like to sleep peacefully throughout the night?</p></li></ul><ul><li><p>Wouldn't it be great to have a few key strategies that make dealing with difficult people a lot easier?&nbsp; </p></li></ul><ul><li><p>What would it feel like to have control of the situation?</p></li></ul><ul><li><p>What would it feel like to be able to leave work behind and enjoy your evening, your weekend, or even your vacation?</p></li></ul><ul><li><p>What would it feel like to actually “Look forward to work tomorrow”?</p></li></ul><ul><li><p>What would it feel like to have the power to “Fire” that one difficult customer that takes up so much of your time, your thoughts, and your work?</p></li></ul><ul><li><p><strong>What if dealing with difficult people actually becomes a fun game you become really good at playing?</strong></p></li></ul><p><br></p><p>Once I began to master these strategies, the air became fresher, my sleep improved, and I became healthier and happier.&nbsp; </p><p><br></p><p>By the end of this course, you will have 12 different strategies that will help you better deal with difficult people.</p><p><strong>By mastering the strategies and tactics of this course you will be able to:</strong></p><ol><li><p>Improve your safety</p></li><li><p>Increase your overall level of professionalism</p></li><li><p>Reduce your stress level</p></li><li><p>Improve your morale</p></li><li><p>Decrease the number of complaints you may receive</p></li><li><p>Lower your personal liability&nbsp; </p></li></ol><p><br></p><p>All of this adds up to a healthier and happier personal and professional life.&nbsp; This could mean greater productivity for you, employees, and fellow co-workers which would likely increase profitability.&nbsp; For example, what would your office be like if everyone just “got along” with one another?&nbsp; </p><p>This course is primarily a series of video lectures that outline the strategies.&nbsp; The lectures contain personal stories and real-life examples of how I've used these strategies and tactics in my career in law enforcement, customer service, sales, and life in general.</p><p>This course was designed specifically for individuals and employees, who work in a professional environment that is often unpleasant due to difficult co-workers, supervisors, customers and/or clients. </p><p><strong>It’s about taking control of the situation instead of being controlled by the situation.</strong></p><p>Students from all around the world (over 90 different countries - This just blows me away!) are studying the 12 Strategies and learning how to deal with difficult people.</p><p>I’m honored and humbled by those who have reached to me to share their personal success stories using these strategies.&nbsp; It’s heartwarming to know this course is really making a difference for so many people from around the world. Thank You</p><p>Please enjoy this course!</p><p><br></p>","suitableLearners":["Have you ever said, “No, that’s not what I meant.” Or “You heard me wrong.”?  Then this course might be for you.","This course is also best suited for professionals who work with difficult customers, sly coworkers, and angry bosses.","This course has also been designed for business professionals (sales & customer service), medical personel, law enforcement, military, ","This course has also been designed for business professionals (sales & customer service), medical personel, law enforcement, military, and anybody that may deal with difficult and challenging people.","This course is for those people who want or need to move into a conversation.  This is about engaging and taking control of your communations.  This is the elite way. ","If you desire a more passive laid back communications style, this course may not be for you.","12 Strategies for dealing with difficult people was designed for individuals and teams who experience difficult situations where professional communications is essential."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2018-10-26T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2018-10-29T00:00:00.000Z"},"promotions":{"discountPrice":367040,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fb39c9b04f3f624d682"],"topics":[],"reviews":[],"meta":{"ratingCount":8605,"studentCount":19388,"avgRatingScore":4.4156103,"contentVideoLength":9344},"basicInfo":{"udemyCourseId":1353936,"slug":"collaboration-and-emotional-intelligence","title":"Collaboration and Emotional Intelligence","subtitle":"Determine how to build more collaborative relationships using your emotional intelligence.","image":"https://img-c.udemycdn.com/course/240x135/1353936_b561_2.jpg","price":1949670,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["Determine why a collaborative approach is beneficial in teamwork","Recognize why collaboration is underpinned with good emotional intelligence","Evaluate ways to work with the principles and characteristics of collaboration - what works best, when and where","Explain the various modes that can be used in collaboration","Assess your own collaborative style and how this helps or hinders you in collaborative working","Identify strategies and ideas about how to collaborate more effectively","Manage work with multi-disciplinary teams at all levels within an organisation","Explore how to use mindfulness techniques to run collaborative meetings more effectively","Recognize how to use emotional intelligence to collaborate with others and build emotional bonds"],"requirements":["You should have an interest and understanding of emotional intelligence but no prior knowledge and experience is needed to benefit from the course.","A keenness to identify and understand how to work collaboratively with others towards shared goals.","An interest in how interactions with other people work and how to build them more effectively.","You should have a willingness to complete the practical activities to grow and develop your emotional intelligence skills"],"description":"<p>Collaboration frequently occurs in the workplace where people come together to cooperate and&nbsp;work on a strategic project in order that they can accomplish a common goal. &nbsp;It is simply teamwork taken to a higher level and&nbsp;has become a more productive way of doing things.</p><p>Most often collaboration happens within fairly small teams&nbsp; -&nbsp;functional teams, time-limited project teams or&nbsp;cross-functional management teams.<br></p><p>In <strong>effective collaboration</strong>, all people involved use their <strong>emotional intelligence</strong> well to <strong>balance emotional needs with their thinking</strong>,&nbsp;build <strong>authentic relationships </strong>and&nbsp;make <strong>good quality decisions</strong> on behalf of the organisation. Whether working with others&nbsp;one-to-one, in small groups or large teams, there is <strong>exemplary&nbsp;communication</strong> with<strong>&nbsp;empathy</strong> that&nbsp;<strong>engages hearts and minds. &nbsp;</strong>This occurs at all levels of the organisation.</p><p>This course is about&nbsp;<strong>collaborating with others&nbsp;</strong>in ways that will help you to&nbsp;<strong>communicate more efficiently</strong>&nbsp;as you&nbsp;work to understand and work with differences that lead to effective collaboration. &nbsp;In addition, the skills, processes and tools taught in this course can bring value to other aspects of your life.</p><p>People often talk about positive and negative emotions.&nbsp; This is not that helpful as emotions cannot really be labelled in that way.&nbsp; The course also covers <strong>the myths around positive and negative emotions </strong>and why this terminology is not appropriate when working to understand emotions and emotional intelligence in the workplace.&nbsp; </p><p>The course covers all aspects of collaborative working focusing on <strong>win-win collaboration</strong> where everyone benefits. The <strong>characteristics</strong>, <strong>principles</strong> and <strong>modes </strong>of collaboration are examined to give you a much broader insight into getting the best from collaboration. &nbsp;</p><p>The course, also, covers <strong>trust</strong>&nbsp;and how you can build trust as you work together with others.<br></p><p><strong>Behavioural styles&nbsp;</strong>are reviewed looking at the strengths and liabilities of each. You get the opportunity to complete a questionnaire that will give you an insight to the behavioural style that you prefer to use with the chance to explore how your style can help&nbsp;and how it can hinder collaboration.&nbsp; Completing this practical activity will enable you to how to use your behavioural preferences and style to better effect when collaborating within a project.</p><p>This course is a standalone course for anyone interested in understanding collaboration at work and how to get more from collaborative relationships. &nbsp;It compliments other courses that explore&nbsp;<strong>emotional intelligence</strong>&nbsp;in more depth.</p><p>By completing this course, you will be able to</p><ul><li><p>Determine why a collaborative approach is beneficial in teamwork</p></li><li><p>Recognize why collaboration is underpinned with good emotional intelligence</p></li><li><p>Evaluate ways to work with the principles and characteristics of collaboration - what works best, when and where</p></li><li><p>Explain the various modes that can be used in collaboration</p></li><li><p>Assess your own collaborative style and how this helps or hinders you in collaborative working</p></li><li><p>Identify strategies and ideas about how to collaborate more effectively</p></li><li><p>Manage work with multi-disciplinary teams at all levels within an organisation</p></li><li><p>Explore how to use mindfulness techniques to run collaborative meetings more effectively</p></li><li><p>Recognize how to use emotional intelligence to collaborate with others and build emotional bonds </p></li></ul><p>You'll receive all the information that you need and will be&nbsp;<strong>coached</strong>&nbsp;using<strong>&nbsp;loads of practical hints</strong>&nbsp;that you can use straight away.\n</p><p>The course is made up of a series of lectures and contains&nbsp;comprehensive course notes. There are a series of interactive exercises that involve some activity with other people and some reflection.</p><p><em>PLEASE&nbsp;NOTE&nbsp;-&nbsp;This course is&nbsp;</em><strong><em>NOT</em></strong><em>&nbsp;for you if you are not prepared to work through the practical activities that make up a fundamental part of the course.&nbsp;&nbsp;Collaboration cannot be developed just&nbsp;by&nbsp;watching the video lectures. &nbsp;It requires you to do some reflective thinking, to&nbsp;get some feedback and to discuss your development with others. &nbsp;I'm afraid that you won't get the best from the course unless you are prepared to do this.</em></p><p>There are&nbsp;<strong>SEVEN&nbsp;</strong>practical activities included within the course that are designed to help you understand collaboration and how you can improve the way in which you work with other people towards shared goals&nbsp; All of them require you to engage with your collaborative&nbsp;team and do some work outside of the course.</p><p>The course is being continually refined and updated to ensure it remains current and relevant.&nbsp; Feedback is always welcome.&nbsp; </p><p><br></p><p>The course contains a series of Lightbulb Moments resource cards, which have been created to provide you with handy reminders of key points around topics covered within the course.</p><p>All PDFs are Section 508 / ADA Accessibility compliant. </p><p>All videos are high definition recorded in 1080p.</p><p>All videos have grammatically correct English captions.</p><p><strong><em>Latest update - March 2022</em></strong></p>","suitableLearners":["This course will support the development of your emotional intelligence. It will be of interest to you if you are looking to develop collaborative relationships, work towards  win-win solutions and ways to interact with others effectively.","This course will help you if you are regularly involved in collaborative teamwork","This course will be of interest to you if you are  interested in developing your collaborative skills"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-04-07T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-04-10T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fb39c9b04f3f624d682"],"topics":[],"reviews":[],"meta":{"ratingCount":8594,"studentCount":23994,"avgRatingScore":4.553666,"contentVideoLength":5532},"basicInfo":{"udemyCourseId":1059196,"slug":"business-skills-email-etiquette-rules-everyone-should-know","title":"Business Skills: Email Etiquette Rules Everyone Should Know","subtitle":"Immediately Improve Your Writing Skills, Boost Your Productivity and Avoid Common Errors","image":"https://img-c.udemycdn.com/course/240x135/1059196_280b.jpg","price":1949670,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["save time and reduce communication frustration ","explain circumstances when sending an email is necessary and / or appropriate","identify situations when sending or retrieving emails is not acceptable","create an email subject line which accurately describes the message's content","consider visual components of an email, in order to enhance comprehension","determine who should (and should not) receive copies of emails - in CC or BCC","know how to manage situations where an email reaches the wrong people","identify and use appropriate tone and level of formality"],"requirements":["You will need to print some material which complements the video lectures, so access to a printer is advisable. ","Ideally, you're working in a field which requires regular email communication with a variety of people.  This course requires you to apply the knowledge to your workplace.","You're either a native English-speaker, or have advanced knowledge of English (e.g. CEF B2+)"],"description":"<p>According to Business Insider, \"<em>the average U.S. employee spends about a quarter of his or her time at work combing through the hundreds of emails each employee sends and receives each day</em> \".  </p>\n\n<p>But despite the sheer volume of emails we send and receive, many business professionals do not use email appropriately.  Inappropriate email etiquette can negatively impact on <strong>perceptions of professionalism</strong>, on <strong>efficiency</strong> and can <strong>increase a company's risk of liability</strong>.</p>\n\n<p>This course helps you <strong>minimise that risk</strong> by coaching you in exceptional email etiquette.  Naturally, that includes a focus on professionalism in the workplace, behaviour, email structure, formatting, spelling, the importance of spelling and grammar, the all-important subject line and much more.</p>\n\n<p>Based on my eleven years' experience training professionals in more effective business communication, this course is your go-to guide to <strong>write right, every time</strong>.</p>\n\n<p>Join me for <strong>video</strong> and <strong>text lectures</strong>, <strong>hands-on activities</strong>, <strong>quizzes</strong> and more.  Download <strong>handy resources</strong>. Get <strong>personalised feedback</strong> via the Q&amp;A board, share your experiences and contribute to a growing <strong>knowledge base</strong> created by professionals just like you from all over the world.</p>\n\n<p>Ready to put your best foot forward?  Fantastic.  Looking forward to seeing you in the course.</p>","suitableLearners":["This course is for all business professionals who want to be more confident and effective when they write to their clients and coworkers."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2017-09-14T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2017-09-17T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fb39c9b04f3f624d682"],"topics":[],"reviews":[],"meta":{"ratingCount":6853,"studentCount":18711,"avgRatingScore":4.366421,"contentVideoLength":7735},"basicInfo":{"udemyCourseId":1389360,"slug":"complete-guide-to-conflict-management-in-the-workplace","title":"Complete Guide to Conflict Management in the Workplace","subtitle":"Conflict management: learn conflict resolution skills & effective listening, communication & problem solving techniques","image":"https://img-b.udemycdn.com/course/240x135/1389360_c7b7_4.jpg","price":1949670,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["Stop feeling distracted, anxious, or frustrated about conflict with your coworkers, boss, or employees","Stop avoiding conflict and allowing tension and resentment to fester, leading to long term consequences","Use differences of opinion and conflicts constructively, leading to growth and creativity","Use proven strategies and powerful communication skills to prevent and manage conflict","Identify warning signs and prevent or minimize conflict before it starts","Know your conflict management style and how to improve your reactions","Create a psychologically safe work environment that encourages open communication and trust","Know when to intervene and how to approach conflict resolution conversations","Implement the 6 Steps to Conflict Resolution","Get to the root cause of conflicts and prevent resentment from lingering and conflicts from re-occurring","Establish conflict resolution guidelines, procedures, and training for your organization"],"requirements":["Ability to print worksheet material"],"description":"<p><strong>+++++++++++++++++++++++++++++++++++++++++++++++</strong></p><p><strong><em>We are top Udemy instructors in the personal development&nbsp;category. Our courses have been taken by over 700,000+ happy students from 200 countries.</em></strong></p><p><strong><em>We have a thriving community in the course and we are actively involved and answer questions within 24h.</em></strong></p><p><strong>+++++++++++++++++++++++++++++++++++++++++++++++</strong></p><p><br></p><p>Do you ever feel distracted, anxious, or frustrated <strong>dealing with conflict</strong> with your coworkers or your boss?\n\n&nbsp; </p><p>Or, are you a manager who has to <strong>address conflict with your employees</strong> or between team members? \n\n&nbsp; </p><p>The truth is that conflict is an inevitable part of work life, and it does not only affect those who are directly involved, it impacts the entire team, department, and organization. How you, and the organization you work for, manage conflict is what ultimately determines the level of <strong>productivity and fulfillment</strong> you will experience at work.<br></p><p>As a manager or business executive, workplace conflict should be a <strong>high priority issue</strong> because it leads to <strong>decreased productivity</strong> and <strong>high employee turnover</strong>.&nbsp;</p><p>In fact, research has shown that <strong>conflict on the job</strong> was cited as the <strong>reason people leave their jobs in 50% of cases</strong>.&nbsp;</p><p>And, studies have revealed that <strong>the average U.S. employee spends 2.8 hours a week dealing with conflict</strong>. Between those two factors, that is a huge loss of revenue and potential growth.&nbsp; &nbsp;</p><p>&nbsp; </p><p><strong>Conflict at work can be caused by a number of factors,</strong> including misunderstandings, miscommunication, perceived threats, personality clashes, a competitive environment, or different values or beliefs.</p><p>But, <strong>the biggest problem </strong>caused by conflicts are not the conflicts themselves, but rather <strong>the way conflicts are handled</strong>—and in many cases not handled at all. Humans are psychologically wired to seek pleasure and avoid pain. So, naturally, we avoid dealing with conflict. The problem is avoiding or mishandling conflicts causes bigger problems with long-term consequences that can be detrimental to our psychological well-being and the success of any team or organization.</p><p><strong>But, not all conflict is inherently bad—in fact it can be both healthy and beneficial.</strong> </p><p>When an effective system for managing differences of opinion is put into place, conflicts can be the source of tremendous growth and creativity. When the corporate environment is one of trust and openness, individuals see disagreements as an opportunity to find common ground and conflicts as a source of creative solutions. When the fear of win-lose situations is eliminated, win-win situations become a common goal.&nbsp; &nbsp; </p><p>Since conflict is a normal part of business life, it is essential to develop the skills to be able to prevent and manage it. The best way to manage conflicts is to:</p><ul><li><p>Stay ahead of conflict by being prepared</p></li><li><p>Have&nbsp;a clear process for handling conflict</p></li><li><p>Provide&nbsp;employees with the tools and skills need&nbsp;to deal with conflict</p></li></ul><p><strong>In this course, you will:&nbsp; &nbsp;</strong></p><ul><li><p>Develop an understanding of common sources of conflict and awareness of what signs to look for, so you can prevent or minimize conflict by catching it early. &nbsp; </p></li><li><p>Find out your natural <strong>conflict management style</strong>—whether you withdraw, back down, compete, compromise, or truly collaborate and how to change your reactions to be more effective. &nbsp; </p></li><li><p>Create a <strong>psychologically safe work environment </strong>in which individuals and teams feel confident expressing themselves, making mistakes, and speaking up because they trust that they will not be reprimanded or ridiculed, and that they will be supported in their quest for improvement. &nbsp; </p></li><li><p>Know <strong>when to intervene </strong>and the best and worst times to approach handling the conflict,, including how to de-escalate a conflict that has become heated or emotional, while not reacting emotionally yourself. &nbsp; </p></li><li><p>Facilitate <strong>conflict resolution conversations</strong>, using powerful communication techniques and knowing important mistakes to avoid.&nbsp; &nbsp;</p></li></ul><p>You’ll also learn the <strong>6 Steps to Conflict Resolution</strong>, including important conflict resolution skills like:</p><ul><li><p>Effective listening and communication techniques</p></li><li><p>Essential problem-solving strategies</p></li><li><p>Strategies for following-up and moving forward in a way that ensures resentment doesn’t linger and conflicts don’t re-occur</p></li></ul><p>We’ll also provide additional insights for handling conflicts depending on who your conflict is with, such as a conflict with your boss or manager, your employees, or within a team.\n\n&nbsp; </p><p>So, are you ready to transform your work environment, experience and relationships? If so enroll now, we look forward to seeing you in the course! </p><p><strong>Guarantee:</strong> We know you will love this course. However, we offer a no-questions-asked 30-day money-back guarantee if the course does not meet your needs for any reason.&nbsp; </p><p><br></p><p><strong>So who are we?&nbsp; &nbsp;</strong></p><p>We are Joeel &amp; Natalie Rivera, serial entrepreneurs, authors,&nbsp; speakers, and educators. We have over a decade of experience in the&nbsp; field of psychology and life coaching and our greatest passion is&nbsp; empowering others to live life on their terms, fulfill their potential,&nbsp; and embrace their greater purpose. All of our programs are designed&nbsp; based on our experience in coaching, social services, psychology, and&nbsp; education, as well Joeel’s Masters Degree in Counseling and research on&nbsp; happiness for his dissertation for a PhD in psychology. We have over <em>300,000+</em><strong><em> </em></strong>students from 195 countries.&nbsp; &nbsp;</p><p>&nbsp;\n\n&nbsp;Copyright ©️ Transformation Services, Inc. | All Rights Reserved </p>","suitableLearners":["Anyone who wants to learn how to prevent and resolve conflict through effective communication techniques and proven strategies","Leaders, managers or human resources professionals who want to establish conflict resolution guidelines, procedures, and training for their staff","Leaders and managers who want to create a low-conflict, high creativity work environment for their employees, departments, and teams"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-04-06T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-04-09T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fb39c9b04f3f624d682"],"topics":[],"reviews":[],"meta":{"ratingCount":6685,"studentCount":46467,"avgRatingScore":4.6328244,"contentVideoLength":19638},"basicInfo":{"udemyCourseId":335610,"slug":"writing-with-confidence-writing-beginner-to-writing-pro","title":"Writing With Confidence: Writing Beginner To Writing Pro","subtitle":"Pro copywriter/Cambridge University writing teacher reveals the secrets for writing blogs and business docs that enthral","image":"https://img-c.udemycdn.com/course/240x135/335610_c058_5.jpg","price":1949670,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["Find your voice as a business writer, blogger or writer of other non-fiction","Transform writing from dull to dazzling - within the first 10 mins of the course","Uncover the secret persuasion tactics known only to the world’s top copywriters","Create musical sentences that readers can’t resist","Craft addictively readable text that keeps readers glued to the page","Discover a wealth of free online tools to take your writing to the next level"],"requirements":["A basic grasp of English","Pen and notebook","A willingness to roll up your sleeves and put into practice what you’ve learned!"],"description":"<p><strong>“This is perhaps the best writing course I've ever taken. That includes my time in University.” STEPHEN L HEWITT, UDEMY STUDENT</strong></p><p> </p><ul><li><p>Want to craft <strong>irresistible </strong>content that has your readers glued to the page?</p></li><li><p>Want to attract <strong>thousands of readers</strong> to your blog by writing <strong>addictive, shareable posts</strong> that are guaranteed to go viral?</p></li><li><p>Want to discover the <strong>secret, elite persuasive</strong> writing techniques known only to the world’s top copywriters, speechwriters and academics specialising in literature?</p></li><li><p>Want to <strong>compel your readers to take action</strong> through the power of persuasive reports, proposals, websites and marketing content?</p></li><li><p>Want to know how to <strong>instantly get your ideas out of your head and onto the page</strong> - in a way that makes people sit up and take notice?</p></li><li><p>Want to <strong>motivate others</strong> to buy your product? Change their mindset? Take on board your ideas?</p></li><li><p>Want to uncover the <strong>secrets </strong>of turning snooze-worthy sentences into scintillating prose?</p></li></ul><p>If any of these apply to you, this is the course for you.</p><p> </p><p><strong>BENEFIT FROM THE MOST COMPREHENSIVE WRITING COURSE ON UDEMY</strong></p><p>As its name suggests, <strong>Writing With Confidence: Writing Beginner To Writing Pro</strong> takes you from the writing fundamentals right through to the elite techniques practised by the world’s top copywriters. Top copywriters like your instructor, Dr Clare Lynch, in fact.</p><p>From the very first lectures, you’ll be inspired to beat writer’s block and get something down on the page. You'll also gain instant ideas for taking your first draft from OK to outstanding.</p><p>Next, you’ll discover a secret most writing and editing teachers won’t share with you: that good writing isn’t just about the writing. For the most part, good writing is about the thinking you do before you even sit down at your laptop or open your journal.</p><p>That’s because, when it comes to becoming a powerful writer – the sort of writer who gets the job, closes the sale or wins buy-in for your ideas - it’s not about the technicalities of spelling and grammar. It’s about your ability to connect with your reader on an emotional, intellectual and visceral level.</p><p>That’s why early on in the course, you’ll learn <strong>powerful, little-known techniques </strong>for really getting under the skin of your readers. Techniques that will allow you to write in a way that grabs people’s attention immediately – and keeps them addictively glued to your writing. </p><p>You’ll also learn <strong>expert tips and techniques</strong> for confidently honing your message down to its essentials, to keep your reader focused on what matters most to you. Tips that will save you time as a writer – and get you better results.</p><p>As the course progresses, you’ll learn what words to choose, how to turn turgid, lifeless sentences into attractive musical phrases that compel people to keep reading.</p><p>In the second half of the course, you’ll discover how to apply <strong>recent findings of neuroscience</strong> to make your messages stick. In this part of the course, you’ll learn how to use imagery to paint <strong>unforgettable word-pictures</strong> in your reader’s mind. </p><p>You’ll also discover the <strong>secret narrative structure</strong> underpinning the most persuasive stories. The narrative structure that’s made millions for the makers of Toy Story and persuaded the British to vote for Brexit. The same narrative structure that your instructor, Dr Clare Lynch, deployed in a tear-jerking speech that allowed a CEO to win over the hearts and minds of employees.</p><p>In the final section of the course, you’ll <strong>take your writing to a level only achieved by the world’s top copywriters </strong>and political speech writers. In this part of the course, you’ll learn how to apply the <strong>ancient art of rhetoric</strong> to any piece of writing to create <strong>rhythmic, emotionally resonant writing</strong> that’s totally unforgettable.</p><p>And throughout the course, you’ll have an opportunity to put into practice what you’ve learned. Every lecture in <strong>Writing With Confidence: Writing Beginner To Writing Pro</strong> delivers a short, sharp, instantly practical tip you can apply to your writing TODAY. </p><p> </p><p><strong>HERE ARE JUST SOME OF THE THINGS YOU’LL LEARN FROM WRITING WITH CONFIDENCE: WRITING BEGINNER TO WRITING PRO</strong></p><p> </p><p><strong>SECTION 1: GETTING STARTED</strong></p><p>In this section you’ll learn how to:</p><ul><li><p><strong>Beat writer’s block</strong> by developing the mindset of a professional writer</p></li><li><p><strong>Instantly improve</strong> a piece of your own writing – with the help four free tools</p></li><li><p>Improve your writing with <strong>one-to-one feedback</strong> from Dr Clare Lynch</p><p><br></p></li></ul><p><strong>SECTION 2: KNOWING YOUR READER</strong></p><p>In this section you’ll learn how to:</p><ul><li><p>Ask the 3 <strong>essential </strong>questions you MUST ask before writing anything</p></li><li><p>Produce a detailed portrait of your reader – so they connect with you on a <strong>deep, visceral level</strong></p></li><li><p>Craft reader-centric, benefit-led copy that will <strong>get your readers to take notice</strong></p></li><li><p>Structure your writing to <strong>hook your readers in</strong> – and keep them reading</p></li></ul><p> </p><p><strong>SECTION 3: WRITE LESS, SAY MORE</strong></p><ul><li><p>In this section you’ll learn how to:</p></li><li><p>Decide with <strong>confidence </strong>exactly what to cut - and what to keep </p></li><li><p>Ditch flabby phrases for <strong>sparkling copy</strong> that’s clear, concise and compelling</p></li></ul><p> </p><p><strong>SECTION 4: HOW TO GET YOUR MESSAGE ACROSS TO THE WIDEST POSSIBLE AUDIENCE</strong></p><p>In this section you’ll learn how to:</p><ul><li><p><strong>Identify and fix</strong> off-putting jargon</p></li><li><p><strong>Communicate your expertise</strong> in a way that anyone can understand and relate to</p></li><li><p>Choose the <strong>best words</strong> for the job</p></li></ul><p> </p><p><strong>SECTION 5: HOW TO CRAFT SENTENCES THAT SING</strong></p><p>In this section you’ll learn how to:</p><ul><li><p><strong>Dramatically boost your readability</strong> with shorter, sharper sentences</p></li><li><p>Vary your sentences for <strong>musical effect</strong></p></li></ul><p> </p><p><strong>SECTION 6: INCORPORATING STORIES INTO YOUR BUSINESS AND TECHNICAL WRITING</strong></p><ul><li><p>In this section you’ll learn how to:</p></li><li><p>Apply recent findings from neuroscience to <strong>make your message stick</strong></p></li><li><p>Structure a story for <strong>maximum persuasion</strong></p></li><li><p>Use metaphor to <strong>communicate complex ideas clearly and creatively</strong></p></li></ul><p> </p><p><strong>SECTION 7: RHETORIC: ADVANCED PERSUASION TECHNIQUES</strong></p><p>In this section you’ll learn how to:</p><ul><li><p>Employ the world’s <strong>most advanced techniques</strong> for persuasive writing - techniques no other big-name writing instructor on Udemy shows you</p></li><li><p>Apply <strong>elite writing strategies</strong> known only to the world’s top executives, advertising copywriters, political speech writers and academics</p></li><li><p>Craft more <strong>inspiring, creative </strong>copy that sounds <strong>irresistible </strong>to the ear – techniques that will set you apart from all the jobbing journalists and ten-a-penny content marketers out there</p></li></ul><p> </p><p><strong>REASONS TO TAKE THIS COURSE</strong></p><ul><li><p>Benefit from <strong>one-to-one feedback</strong> on your writing from a <strong>University of Cambridge</strong> writing tutor</p></li><li><p>Learn the skills that allow the top copywriters (like your instructor Dr Clare Lynch) to <strong>earn up to £2000+ </strong>a day</p></li><li><p>Use words to <strong>persuade </strong>your employees, your bosses, your customers or investors</p></li><li><p>Communicate complex ideas in a way that <strong>inspires </strong>your readers</p></li><li><p><strong>Build your confidence</strong> and find your voice as a writer</p></li><li><p>Hook your readers in from the outset – and have them <strong>glued </strong>to your words</p></li><li><p>Save you and your readers’ time by <strong>writing less but saying more</strong></p></li><li><p>Hone your message down to the stuff that will <strong>get you results</strong></p></li><li><p>Structure your work for <strong>maximum persuasive</strong> power</p></li><li><p><strong>Understand </strong>the difference between elegant simplicity and dumbing down</p></li><li><p>Edit your work so you <strong>say what you mean</strong> (and mean what you say)</p></li><li><p>Craft sentences that are <strong>clear, succinct and persuasive</strong></p></li><li><p>Use online tools for assessing and <strong>boosting your writing’s readability</strong></p></li><li><p>Find and tell <strong>addictive </strong>stories that make people see the world your way – and compel them to take action</p></li><li><p>Use the <strong>latest findings</strong> from neuroscience to craft powerful messages that stick</p></li><li><p>Use <strong>advanced rhetorical techniques</strong> to win over your audience</p></li><li><p>See <strong>dozens of practical, real-life examples</strong> to illustrate the theory</p></li><li><p>Access <strong>countless free resources</strong> for powering up your prose</p></li><li><p><strong>Get writing</strong> with a host of challenges to practise what you've learned</p></li><li><p>Have fun while you learn with a course that’s entertaining and humorous, but never lightweight - students say it's <strong>addictively engaging</strong></p></li><li><p>Stay <strong>hooked </strong>with a course that’s clear, concise and never repetitive - this is one writing instructor who practises what she preaches</p></li></ul><p> </p><p><strong>ENROL IN THE BEST WRITING COURSE ON UDEMY</strong></p><p><strong>“This is the best course I’ve ever taken on Udemy! This course delivers what it promised.” - DENISE HUBBARD, UDEMY STUDENT</strong></p><p> </p><p>Enrol in <strong>Writing With Confidence: Writing Beginner To Writing Pro</strong> and discover why, over and over again, students describe it as the best writing course on Udemy - in fact, the best course on Udemy. </p><p>Clear, concise and addictively engaging, <strong>Writing With Confidence: Writing Beginner To Writing Pro</strong> will change the way you write for ever. It's jam-packed with no-nonsense advice on how to win people over with the written word. </p><p><strong>Previous students of the course report that within days of completing it, they've crafted a cover letter that secured them a longed-for job. Or won a regular writing gig at a publication like the Huffington Post. </strong></p><p>In <strong>Writing With Confidence: Writing Beginner To Writing Pro</strong>, you'll learn powerful principles that can be applied to most types of non-fiction writing - including emails, reports, presentations, sales pages, advertising, blogs and more. </p><p><strong>***Writing With Confidence: Writing Beginner To Writing Pro isn’t aimed at writers of fiction, poetry or memoir. But it WILL show you how to add creative flair to all your non-fiction prose.***</strong></p><p> </p><p>“<strong>Best online writing course I've ever taken. Extraordinary!” JAMES CHISHOLM, UDEMY STUDENT</strong></p><p><strong> </strong></p><p><strong>APPLY YOUR SKILLS WITH THE MOST PRACTICAL WRITING COURSE ON UDEMY</strong></p><p>One of the things that sets <strong>Writing With Confidence: Writing Beginner To Writing Pro</strong> apart is its practicality. </p><p>The course includes over <strong>30 activities and exercises that will get you writing </strong>from the very first ten minutes of the course. And with each exercise, you’ll discover your ability to write with a style and flair you didn’t think was possible. </p><p>What’s more, expert copywriter and Cambridge writing tutor Clare Lynch is always on hand to give you one-to-one feedback on your writing. </p><p>No other writing course on Udemy gives you access to <strong>personal mentorship from a University of Cambridge writing teacher</strong>. Or so many opportunities to benefit from the guidance of a proven, trusted expert in the field of writing.</p><p><strong>“I have taken quite a few courses on Udemy, and I have never seen a professor so interested in the progress of her students.” - GIANCARLO M. GUERRA, UDEMY STUDENT</strong></p><p><strong> </strong></p><p><strong>ENJOY THE MOST ENGAGING WRITING COURSE ON UDEMY</strong></p><p>Dr Clare Lynch practises what she preaches. And that means <strong>Writing With Confidence: Writing Beginner To Writing Pro </strong>is as engaging and entertaining as it is clear and concise. </p><p>Unlike some writing courses out there, <strong>Writing With Confidence: Writing Beginner To Writing Pro</strong>, contains zero fluff. Zero padding. Zero repetition. </p><p>Just six hours of clear, practical advice for taking even the driest material from dull to dazzling. </p><p>What’s more, Clare’s students consistently rate her courses as not simply invaluable – but also fun, varied and entertaining to watch. </p><p><strong>“I love this course. Truly engaging and it made an impact in my writing, almost immediately.” - SAMUNDSWARY IYERDOURIA, UDEMY STUDENT</strong></p><p> </p><p><strong>GET ONE-TO-ONE FEEDBACK FROM THE MOST HIGHLY QUALIFIED WRITING INSTRUCTOR ON UDEMY</strong></p><p>University of Cambridge tutor Dr Clare Lynch is an expert writer with decades of experience. Clare hasn’t simply edited the work of other journalists at elite publications, such as The Financial Times. She’s also herself a hugely successful copywriter in her own right. </p><p>In her 20+ year career, Clare has crafted copy from scratch for elite clients in a wide range of fields, including lifestyle, retail, property, tech, pharma, finance and government. </p><p>Over the course of that career, Clare has honed her techniques for getting under any reader’s skin – and crafting messages that instantly resonate with the target audience. Techniques she now shares with over 25,000 students on Udemy.</p><p>Clare’s experience as a writer embraces a huge range of writing formats and styles – including case studies, white papers, feature articles, direct mail campaigns, web content, ad copy, video scripts, CEO speeches and brand messaging. </p><p>And as the author of the popular blog Good Copy, Bad Copy, Clare herself has attracted hundreds of thousands of readers to her own writing. Good Copy, Bad Copy has been named on Copyblogger's list of 15 copywriting and content marketing blogs that will make you more money.</p><p>What’s more, Clare has a PhD in English Literature and teaches at the University of Cambridge. She’s also a qualified and highly experienced corporate trainer. </p><p>So Clare isn’t merely an expert at her craft. She also knows how to communicate her expertise in a way that’s memorable, entertaining and addictively engaging.</p><p>“She is an incredible teacher that has a special unique ability of keeping her students minds engaged and hanging on her every word.” - BRAD MACE, UDEMY STUDENT</p><p> </p><p><strong>PREVIOUS STUDENTS WHO’VE BENEFITED FROM THE COURSE INCLUDE</strong></p><p>Copywriters</p><p>Corporate communicators</p><p>Bloggers</p><p>Memoirists</p><p>Book writers</p><p>Small business owners</p><p>Job seekers</p><p>Technical experts</p><p><strong> </strong></p><p><strong>DON’T TAKE OUR WORD FOR IT – SEE WHAT OTHER STUDENTS OF WRITING WITH CONFIDENCE: WRITING BEGINNER TO WRITING PRO SAY ABOUT THE COURSE</strong></p><p> “Yours is the single most valuable course I've had in the past six years—my BA and MA seminars included” - AKOS CSERNAK, UDEMY STUDENT</p><p>“Best writing course i have taken so far.” - IBRAHIM HALILU ABUBAKAR, UDEMY STUDENT</p><p>“One month later and I have secured a regular blog spot on the Huffington Post! I could not have done this without Clare's wonderful course.” - FRAN DIAMOND, UDEMY STUDENT</p><p>“Best Udemy course I ever bought.” - ANNA CARLA DELLA VALLE, UDEMY STUDENT</p><p> “Trust me, you'll be immediately satisfied with this course” - MARK SIMPSON, UDEMY STUDENT</p><p>“A week later I'd landed my first gig as a writer.” - DAVID PULLAN, UDEMY STUDENT</p><p>“One of the best courses I've ever taken.” - NADER RUSTOM, UDEMY STUDENT</p><p>“To those doubting if you should buy this course, please do, as there is so much valuable information in this course. I can comfortably state that it is one of the best courses that I have bought on Udemy.” - T.O _, UDEMY STUDENT</p><p>“I loved it from beginning to end. It is exceptional value for money.” - DEBORAH SOWERBY, UDEMY STUDENT</p><p>“a game changer.” - GEORGY THOMAS, UDEMY STUDENT</p><p>“One of the best writing courses I have taken to date, love it!” - BEN WALTERS, UDEMY STUDENT</p><p> “I challenge any business writer not to pick up a few gems from this engaging course.” - SACHA VAUGHAN, UDEMY STUDENT</p><p>“I very much liked this course because it was #1 goal-oriented, #2 it used concrete examples, #3 everything was fascinating.” - FREDERIK, UDEMY STUDENT</p><p> “a course you do not want to miss” - MA YUANFENG, UDEMY STUDENT</p><p>“Fantastic course. This is by far the most complete and thorough course on business writing.” - CARSTEN PLEISER, UDEMY STUDENT</p><p>“This course is amazing! I finished it all in one day and went straight to work putting the concepts into my writing.” - URIEL MACGILLIVARY, UDEMY STUDENT</p><p>“Life changing at its simplest.” - SUSAN PARKER, UDEMY STUDENT</p><p>“This course is amazing. I've been using every technique from the course in my academic life.” - MINH HA, UDEMY STUDENT</p><p>“This is the best course I've taken on udemy thus far.” BILL SCHAEFER, UDEMY STUDENT</p><p> \"This course is priceless. You’ll be glad you signed up.\" LIAT MIRIAM GAT, UDEMY STUDENT</p><p><strong>Enrol now - and change the way you write forever!</strong></p>","suitableLearners":["Enrol now to power up all your non-fiction prose - blog posts, reports, proposals, emails, websites, advertising copy and more","Enrol now if you want to write gripping blog posts that glue your readers to the page","Enrol now if you're a manager with your sights set on a leadership position","Enrol now if you're a new graduate seeking to stand out in your career","Enrol now if you want to learn the skills to be a highly paid professional copywriter","Enrol now if you want to make more sales from your website or other marketing material","Enrol now if you're a comms professional seeking to articulate the case for clear writing in your organisation","Do NOT take this course if you're only interested in creative writing such as poetry or fiction. The course focus is primarily on professional writing.","This course takes you from beginner to expert - experienced writers may find the early lectures cover known ground"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-02-04T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-02-07T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fb39c9b04f3f624d682"],"topics":[],"reviews":[],"meta":{"ratingCount":6473,"studentCount":17451,"avgRatingScore":4.3946133,"contentVideoLength":15072},"basicInfo":{"udemyCourseId":1322562,"slug":"how-to-present-your-thoughts-smoothly-clearly-powerfully","title":"How to Present Your Thoughts Smoothly, Clearly & Powerfully","subtitle":"How You Can Feel Calmer, Be Confident and Speak Smoothly, Especially Under Pressure","image":"https://img-c.udemycdn.com/course/240x135/1322562_cf87_3.jpg","price":573270,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["Feel calmer and more relaxed under pressure","Perform well while under pressure","Speak smoothly","Present ideas and thoughts more clearly and succinctly","Capture and hold the attention of those listening"],"requirements":["You should be able to understand spoken and written English in professional environments"],"description":"<p>Do you sometimes struggle to share your thoughts and ideas smoothly and clearly in professional or social situations? Do you feel like your career or social life has been limited because you hold back even when you have something brilliant to say?  </p>\n\n<p>If so, then take a deep breath and release it.  You're about to learn a systematic approach to retraining yourself to feel calmer, be more confident and speak smoother.  You'll feel free to say what you want when you want in a way that people will want to listen to you.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>My name is Michael Williams and for the past several years I've been working with professionals like you helping them literally transform the way they communicate.  We're not just talking about tips and tricks here.  We're talking about people who have struggled with: </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>low speaking confidence</li><li>fast, choppy speech</li><li>stuttering or stammering</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>For more than 25 years I stuttered, well into my adulthood.  So I know what it's like to feel trapped inside your own head, not being able to say what you want when you want.  I know how it feels to feel limited and hold back especially when you have a great idea or valuable input. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I designed this course to help you change your pattern of speaking and thinking so that you can: </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>feel calmer</li><li>be confident </li><li>speak smoother</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>As a full-time Speech and Presentation Coach, I've worked with hundreds of clients one-on-one from around the world, many of whom are multilingual.  And, I've been able to help them take their speech, career, and personal lives to the next level with much of the information I'm going to share in this course.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>WHAT WILL YOU LEARN?</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em>In this course you will learn:</em> </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ol><li>Two of the most powerful skills required for smooth and engaging speech, and how to execute them. </li><li>Two techniques you can use immediately to articulate your words and thoughts with complete clarity.</li><li>5 Steps to retrain your brain to say what you want when you want the way you want.</li><li>What to focus on while you're speaking so that you don't lose your train of thought, freeze up or otherwise embarrass yourself.</li></ol>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em>This course is for you if you. . .</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Have a strong and immediate need to improve your communication skills</li><li>Are willing to put in the time and effort to change your speaking and mindset</li><li>Want people to listen when you speak and take you seriously</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>WHAT RESULTS CAN YOU EXPECT FROM THIS COURSE? </strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>If you consistently practice the skills taught in this course, you can expect. . .</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ol><li>To feel much calmer and relaxed in high-pressure speaking situations, giving you an edge over those who crack under pressure. </li><li>To perform well even when you're nervous or anxious, projecting much sought after leadership qualities.</li><li>To speak with absolute authority, projecting confidence to your audience. </li></ol>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>WHAT MAKES THIS COURSE SPECIAL?</strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>The content in this course is based not only on personal experience, but also on Neuroscience, Habit Formation, and Observational Learning.  More importantly, the skills you will learn have been tested by professionals like yourself, so they actually work in real-life situations, like the ones you face from day-to-day.  <br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Here's an extensive comment from someone taking my Pro90d Self-Study: </strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em>\"Hello, Sir. As I continue to work through this, I am experiencing more and more successes and expecting more of them. I never take huge steps. I take small steps every day but do maintain consistency, which I think is the top key to success. Two days back, I was supposed to read a passage aloud in front of some of my colleagues, which I hated before. But I continued to tell myself consistently \" I love reading aloud and I am an absolute genius at it.\" </em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em>Not only that, I used all the appropriate techniques and strategies e.g extending some words and blending them and I maintained a smooth and relaxed rhythm. And I pulled up a picture of Sir Michael and supposed that he was reading, so I also modeled him. 75% of that reading went relaxed and smooth, which was much better than my past experiences of reading aloud. </em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em>Moreover, I am also constantly improving upon my conversations, and the past week I had many successes on the phone and even on face to face conversations. I am really very happy. Thank you, Sir Michael.\"</em></p>","suitableLearners":["Professionals who want to take their oral communication skills to the next level so that they can foster confidence authority and impact."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-04-15T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-04-18T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fb39c9b04f3f624d682"],"topics":[],"reviews":[],"meta":{"ratingCount":6378,"studentCount":15643,"avgRatingScore":4.56564,"contentVideoLength":4425},"basicInfo":{"udemyCourseId":2296344,"slug":"speak-like-a-pro-public-speaking-for-professionals","title":"Speak Like a Pro: Public Speaking for Professionals","subtitle":"Master presentation skills and impromptu speaking, conquer speech anxiety, and get your point across to any audience","image":"https://img-c.udemycdn.com/course/240x135/2296344_9238_4.jpg","price":4587770,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["Connect with any audience and make them care about your message","Get your point across without rambling","Conquer your speech anxiety","Organize your ideas in easy-to-remember frameworks","Think and speak on your feet","Influence others with powerful stories"],"requirements":["It's great if you have an upcoming presentation or meeting to work on (but it's OK if you don't!).","You'll need a video recording device like a smartphone, laptop, or tablet."],"description":"<p>If you get nervous about giving presentations or leading meetings at work, this course will help you <strong>speak up powerfully when it matters most.</strong> And if your public speaking skills are holding you back in your career, this course will give you the tools you need to speak like a leader.</p><p>No matter what industry you’re in, <strong>you need to speak clearly and confidently to move your team and your career forward.</strong></p><p>In this practical Udemy course, you’ll discover <strong>how to get your message across</strong> and influence others with presentations that make people want to listen. I’ll help you <strong>plan your next presentation step by step</strong>, from analyzing your audience and discovering your bottom line to organizing your thoughts and improving your delivery. You’ll practice speaking off the cuff and learn tools to manage your nerves under pressure.</p><p>I know you’re busy, so we’ll laser-focus on the essentials: no fluff, no filler, just the most transformative and effective exercises I’ve developed over two decades of coaching thousands of clients worldwide to overcome anxiety and deliver powerful presentations. </p><p>You’ll graduate with <strong>a communication toolbox jam-packed with practical, actionable tools you can use immediately</strong> to give more persuasive presentations, lead better sales calls, ace that “hallway ambush” with your boss, share ideas in meetings and 1:1s, and get buy-in from colleagues and business partners.</p><p>Specifically, this course will help you:</p><ul><li><p>Connect with any audience and make them care about your message</p></li><li><p>Get your point across without rambling</p></li><li><p>Master the art of sounding natural and conversational (while secretly being well-prepared)</p></li><li><p>Organize your ideas into easy-to-remember frameworks</p></li><li><p>Think and speak on your feet, even in stressful situations</p></li><li><p>Influence listeners with powerful stories</p></li><li><p>Make your body and voice work for you rather than against you</p></li><li><p>Manage your anxiety when the pressure’s on</p></li></ul><p>And if public speaking makes you nervous, take heart. On one hand, I’m a presentation coach who’s helped thousands of leaders, entrepreneurs, students, and employees, both at startups and large organizations like Salesforce and Google, tell powerful stories and deliver effective presentations.</p><p>But <strong>I’m also an introvert who spent 20 years terrified of public speaking</strong>, despite teaching college courses on the subject and presenting on a daily basis. And I can tell you that <strong>public speaking is truly a skill that anyone can learn.</strong></p><p><strong>STUDENT&nbsp;REVIEWS:</strong></p><p>***** \"Worth the investment! If you're debating which Udemy public speaking class to invest in, stop searching now, and get this one. Jennifer provides immediately applicable, confidence-boosting speaking tips in this easy-to-digest course. In a super short amount of time, she packs in a ton of game-changing information, but without it feeling overwhelming. Just from simply taking the class, I feel more pumped to put these skills into action in my next meeting.\" -&nbsp;Anna S.</p><p>***** \"In my opinion, no matter what your level - beginner or advanced, you will get away with practical tools that you can implement immediately in your next public interaction. My favorite takeaways were 'Punctuate with silence' and recording myself on audio was a game changer tool.\" - Calif G.</p><p>***** \"As the sole proprietor of a design firm, my least favorite part of having a business is selling my design skills to get new clients. Jennifer offers wonderful tools for dealing with presentation anxiety, etc., like, 'pivoting the spotlight away from one's self and toward the audience', '4-square breathing', and how to \"get pumped before your next presentation'. I will definitely be trying all of these next time!\" - Stephanie G.</p><p><strong>So let’s get started!</strong></p><p><strong>Enroll today to master public speaking and transform your presentation skills!</strong></p><p><strong>CPE (Continuing Professional Education)</strong></p><p><strong>Learning Objectives</strong></p><ol><li><p>Identify the 3 Cs of effective public speaking.</p></li><li><p>Recognize why analyzing your audience is so important and when it should occur.</p></li><li><p>Determine the most effective way to prepare for a speech or presentation.</p></li><li><p>Discover strategies to structure your content so you can connect with your audience.</p></li><li><p>Identify best practices for storytelling in your presentations.</p></li><li><p>Identify delivery strategies related to eye contact, body language, pace, and filler words and what they help you achieve.</p></li><li><p>Define the PREP Method and when you would use it.</p></li><li><p>Name concrete techniques for conquering presentation anxiety.</p></li></ol><p>For additional information including refunds and complaints, please see <strong>Udemy Terms of Use</strong>, which is linked from the footer of this page.</p><p>For more information regarding administrative policies, please contact our support using the <strong>Help and Support</strong> link at the bottom of this page.</p>","suitableLearners":["Professionals who have a presentation or important meeting coming up","Leaders who have recently been promoted to new roles that require more public speaking or meeting facilitation","Aspiring leaders whose public speaking skills are holding them back in their career","Anyone who wants to improve their public speaking skills or overcome speech anxiety"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2020-07-27T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2020-07-30T00:00:00.000Z"},"promotions":{"enabled":false}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fb39c9b04f3f624d682"],"topics":[],"reviews":[],"meta":{"ratingCount":6236,"studentCount":20254,"avgRatingScore":4.4400673,"contentVideoLength":4920},"basicInfo":{"udemyCourseId":2323926,"slug":"write-like-a-boss-master-your-business-writing-skills","title":"Write Like a Boss: Master Your Business Writing Skills","subtitle":"How to write better emails and proposals, save valuable time, and develop powerful written communication skills.","image":"https://img-c.udemycdn.com/course/240x135/2323926_c3f1.jpg","price":2293770,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["Save time and reduce uncertainty by using a 3-step writing process.","Analyze what your audience wants, needs, and expects from emails, reports, and proposals.","Write emails that demonstrate your emotional intelligence.","Persuade audiences with different types of evidence and well-organized reports and proposals.","Write emails, reports, and proposals that are clear, concise, and easy to read.","Reflect on your business writing skills, set goals, and plan for continuous improvement."],"requirements":["A computer","A pen/pencil and notepad","A basic understanding of English grammar"],"description":"<p><strong>Are you ready to take your business writing to the next level...the boss level?&nbsp;</strong>Writing like a boss means <strong>writing like a leader</strong>. Companies want leaders with <strong>power skills</strong> like written communication, emotional intelligence, and persuasion -- and these are the skills you'll learn about in this course!</p><p><strong>If you want to...</strong></p><ul><li><p>Craft emails that get responses</p></li><li><p>Persuade different audiences with research-proven strategies</p></li><li><p>Improve the clarity and conciseness of your writing</p></li><li><p>Evaluate your writing habits, strengths, and weaknesses</p></li><li><p>Make your writing shine and your readers smile</p></li></ul><p><strong>...then this course is for you!</strong></p><p>I'm your instructor, Dr. Elizabeth Goins. I have a PhD in communication, years of professional editing experience, and a genuine love for writing since childhood. <strong>Communication has truly transformed my life and that's why I'm so passionate about helping students like you.</strong></p><p>I've been teaching business writing at the university-level for 10 years and have helped <strong>thousands of learners become more confident writers</strong>. I also run a successful coaching and consulting business where I help companies and executives from all over the world. </p><p>My strategies are based on the latest communication research and practical business experience, and I love making writing fun for my learners.</p><p><br></p><p><strong>WHAT YOU'LL&nbsp;GAIN&nbsp;FROM&nbsp;TAKING&nbsp;THIS&nbsp;COURSE</strong></p><p><em>Write Like a Boss:&nbsp;Master Your Business Writing Skills</em> is full of valuable tips, tools, and strategies for writing effective emails, reports, and proposals at work.</p><p>I'll walk you through the fundamentals of written business communication using research-proven strategies, interesting examples, and useful exercises to test your knowledge and improve your skills. </p><p>By the end of this course, you’ll know how to:</p><ul><li><p>Analyze and persuade different audiences successfully</p></li><li><p>Write with more confidence, clarity, and impact at work (and in life)</p></li><li><p>Apply valuable tips for taking your writing to the next level.</p></li></ul><p><br></p><p><strong>STUDENT&nbsp;TESTIMONIALS</strong></p><p>\"Amazing course, clear and precise - thank you Elizabeth.\"</p><p>\"A really great course for such a short time. Compact, to the point and I really feel it has helped me improve in this area. Thank you!\"</p><p>\"This is a good course, more than I expected. Taught me a lot about my writing. I realized I have to think about everything I write in order to engage the reader.\"</p><p>\"This course provided me with a lot of great tips to incorporate into my writing. I tend to be overly wordy in emails so the 'turn phrases into words' game is super helpful for me! Elizabeth also made the course fun and enjoyable to watch.\"</p><p>\"Overall, I found this course very helpful. Now onto setting goals and practicing! #timetowritelikeaboss\"</p><p><br></p><p><strong>HOW&nbsp;THIS&nbsp;COURSE&nbsp;IS&nbsp;STRUCTURED</strong></p><p><br></p><p><strong>Section One:&nbsp;Introduction</strong></p><ul><li><p>Embrace writing as a <strong>power skill</strong></p></li><li><p>Learn about the 4 different <strong>writing personalities</strong></p></li><li><p><strong>Discover</strong> your own writing personality, and how it's helping or holding you back</p></li><li><p>Tap into different personalities to <strong>write successfully</strong></p></li></ul><p><br></p><p><strong>Section Two:&nbsp;The 3Ps Writing Process</strong></p><ul><li><p><strong>Save time</strong> and <strong>reduce uncertainty</strong> around writing</p></li><li><p><strong>Analyze</strong> your context, purpose, and audience <em>before</em> writing</p></li><li><p>Get over <strong>writer's block</strong> and start writing</p></li><li><p><strong>Organize </strong>your messages strategically</p></li><li><p><strong>Polish</strong> your writing to make it <strong>shine</strong></p></li></ul><p><br></p><p><strong>Section Three:&nbsp;Writing Emails That Get Responses</strong></p><ul><li><p>Learn <strong>when</strong> you should (and shouldn't)&nbsp;use email to communicate</p></li><li><p>Show <strong>emotional intelligence</strong> in your writing like a leader</p></li><li><p><strong>Adapt</strong> to your audience's communication preferences</p></li><li><p>Help your reader respond and gain <strong>credibility</strong></p></li></ul><p><br></p><p><strong>Section Four:&nbsp;Writing Reports &amp;&nbsp;Proposals That Persuade </strong></p><ul><li><p>Use different types of <strong>evidence</strong> to persuade readers</p></li><li><p>Earn <strong>buy-in</strong> and promote <strong>action</strong> from your audience</p></li><li><p><strong>Show and tell</strong> your audience why they should care about your ideas</p></li><li><p>Apply a research-proven framework for <strong>organizing</strong> your persuasive messages</p></li></ul><p><br></p><p><strong>Section Five:&nbsp;Tactical Strategies for Next-Level Writing</strong></p><ul><li><p>Write <strong>clearer</strong> and more <strong>concise</strong> sentences and paragraphs</p></li><li><p>Save your audience <strong>time</strong> and <strong>energy</strong> </p></li><li><p>Make your audience <strong>want</strong> to read your messages</p></li><li><p>Write <strong>professional-looking</strong>, visually appealing emails, reports, and proposals</p></li><li><p>Diagnose your writing <strong>strengths</strong> and <strong>opportunities for growth</strong></p></li></ul><p><br></p><p><strong>Section Six:&nbsp;Now What?&nbsp;3 Keys to Progress </strong></p><ul><li><p>Turn the <strong>knowledge</strong> you've gained from this course into <strong>action</strong></p></li><li><p>Use practice, feedback, and goals to continue <strong>growing as a boss writer</strong></p></li><li><p>Create a <strong>specific plan</strong> for keeping the momentum going</p><p><br></p></li></ul><p><strong>ARE&nbsp;YOU&nbsp;READY&nbsp;TO&nbsp;WRITE&nbsp;LIKE&nbsp;A&nbsp;BOSS? Join me and I'll show you how!</strong></p><p><br></p><p><strong>CPE (Continuing Professional Education)</strong></p><p><strong>Learning Objectives</strong></p><ol><li><p>Describe a simple 3-step writing process to save time and reduce anxiety.</p></li><li><p>Identify ways to analyze what your audience wants, needs, and expects from emails.</p></li><li><p>Name the techniques to persuade different audiences with written reports and proposals.</p></li><li><p>Explain how to write emails that demonstrate your emotional intelligence and cultural awareness.</p></li><li><p>Name the techniques to persuade audiences with different types of evidence and well-organized reports and proposals.</p></li><li><p>Explain how to write emails, reports, and proposals that are clear, concise, and easy to read.</p></li><li><p>Describe how to reflect on your business writing skills, set goals, and plan for continuous improvement.</p></li></ol><p>For additional information including refunds and complaints, please see <strong>Udemy Terms of Use</strong>, which is linked from the footer of this page.</p><p>For more information regarding administrative policies, please contact our support using the <strong>Help and Support</strong> link at the bottom of this page.</p>","suitableLearners":["Business leaders who want to write with confidence, clarity, and impact at work (and in life)","Managers who want to improve their communications with coworkers, customers, and clients","Individual contributors and creatives who want to help their teams and organizations by writing effective messages","This course *is not* targeted for students who want to take a deep-dive into strategies for writing marketing copy, PR, grants,  technical writing, or other *specific* genres of business writing"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-09-12T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-09-15T00:00:00.000Z"},"promotions":{"discountPrice":458800,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fb39c9b04f3f624d682"],"topics":[],"reviews":[],"meta":{"ratingCount":6123,"studentCount":18530,"avgRatingScore":4.537188,"contentVideoLength":11232},"basicInfo":{"udemyCourseId":2343574,"slug":"assertive-communication-skills-masterclass","title":"Assertive Communication Skills Masterclass","subtitle":"Assertive Communication Skills for Business & Social Life. Speak Confidently. Set Boundaries. Difficult conversations.","image":"https://img-c.udemycdn.com/course/240x135/2343574_ba19.jpg","price":2064370,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["Move from being a passive communicator to a confident, assertive communicator.","Say “no” and establish boundaries without feeling guilty.","Make clear requests to your team members, friends and family.","Disagree assertively and know how to react when somebody disagrees with you.","Speak confidently and become visible in group situations.","Be an engaging conversation partner in one-on-one conversations.","Overcome your fears and limiting beliefs about being assertive.","Honestly and confidently express what you think, feel and want without holding back.","Learn body language to support your assertive verbal message.","Deal with difficult situations with ease."],"requirements":["Access to a computer to watch the videos","Printer to print out the coaching worksheets","A can-do attitude for personal and professional development"],"description":"<p><strong>You CAN tell people what you truly think and feel, and you can set boundaries when you need to. You just need to learn how to communicate assertively to do it effectively. </strong></p><p>Assertive communication is a critical skill for emerging leaders, new managers, and people who are more introverted in social situations. </p><p>When you know how to communicate assertively, you can <strong>say “no” without feeling guilty</strong>, set boundaries to <strong>protect your time, priorities and goals</strong>, articulate requests clearly and confidently, and <strong>deal with awkward situations with ease</strong>.</p><p>Imagine being able to lift the frustration, stress and anxiety you normally feel when you have to stand up for yourself. Imagine life without people walking over you because they respect the boundaries you have set. Imagine people looking at you as a strong, confident person.</p><p><strong>All of this is possible and learning how to communicate assertively will help you achieve it.</strong></p><p>I’m Kara Ronin and I’m a Best-Selling Udemy Instructor, leadership coach and trainer. I specialise in helping people develop their leadership presence, communication, reputation and relationships.</p><p>I’ve helped many of my in-person clients transform their communication and become more assertive, and I’m dedicated to helping you do the same in this video course. </p><p><em>\"When someone is able to describe situations you can relate to and the way it makes you feel and think it really relates to real life situations. This course does just that, I lost count of the number of times I thought to myself \"oh yeah, that makes sense now\" - Julian, student of this course.</em></p><p>Assertive communication is not about being bossy. It’s about <strong>taking control of your communication and your life.</strong> It allows you to communicate clearly and honestly to people around you. This in turn helps you to come across as more authentic.</p><p><strong>In this course, you will:</strong></p><ul><li><p>become more reflective of your communication style and break bad communication habits</p></li><li><p>overcome your fears about being assertive and speaking up honestly</p></li><li><p>know how to get heard in chaotic group situations </p></li><li><p>be able to connect and engage in one-on-one conversations</p></li><li><p>know what body language to use to support your assertive message</p></li><li><p>learn how to set boundaries and say “no” without feeling guilty</p></li><li><p>express your feelings, opinions and wants honestly and clearly</p></li><li><p>make clear requests with your friends, family and work colleagues</p></li><li><p>better manage conflict and difficult conversations</p></li><li><p>become more confident in your decision-making</p></li><li><p>make your job and life less stressful because you know how to protect your time, priorities and goals</p><p><br></p></li></ul><p>You will not be alone on your journey to becoming more assertive. This 3-hour course not only includes <strong>44 high-quality videos</strong> where I walk you through practical strategies that I use with my coaching clients. It also includes <strong>six coaching worksheets, a case study, quizzes, and conversation transcripts</strong> to help you move your assertive communication skills forward. </p><p>Assertive communication is a skill that will absolutely help you in your life. Learning how to communicate assertively has helped me immensely in my personal and business life, I know it can help you too. </p><p>When you know how to communicate assertively, you will finally be able to <strong>start living your life exactly the way you want.</strong> You’ll no longer allow other people to direct your life or force you into decisions because you don’t know how to say “no”. </p><p>This course will <strong>empower you to live your life on your terms.</strong> I’d be honoured if you join me on this journey.</p><p><br></p><p><strong>WHAT STUDENTS OF THIS COURSE HAVE SAID:</strong></p><ul><li><p><em>\"It is </em><strong><em>exactly what I was looking for</em></strong><em>. It is one of the most essential life skills that is required and needs to be revisited often.\" - Sahil</em></p></li><li><p><em>\"Very clear and </em><strong><em>I loved that everything has examples.</em></strong><em>\" Osvaldo</em></p></li><li><p><em>\"Very good course to take and a good review on </em><strong><em>how to be assertive and not aggressive in communication</em></strong><em>. Thank you for putting together this class.\" - Cheryl</em></p></li><li><p><em>\"This </em><strong><em>help me reflect myself</em></strong><em> clearly and encourage me to be assertive.\" - A.W </em></p></li></ul><p><br></p>","suitableLearners":["New managers who need to be more assertive with their team.","Emerging leaders who want to communicate more clearly and confidently.","Introverted people who need to set boundaries and say “no”.","Passive communicators who want to speak more directly and honestly.","People who don’t want to be invisible in social situations.","People who are fearful of speaking up assertively and need to overcome their fears.","People going into a new job or team and want to establish assertive boundaries.","People who have difficulty protecting their time, priorities and goals.","People who need to set stronger boundaries."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-02-22T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-02-25T00:00:00.000Z"},"promotions":{"discountPrice":298220,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fb39c9b04f3f624d682"],"topics":[],"reviews":[],"meta":{"ratingCount":5130,"studentCount":29784,"avgRatingScore":4.6112747,"contentVideoLength":21352},"basicInfo":{"udemyCourseId":1137208,"slug":"the-foundations-of-fiction-writing-mastery","title":"The Foundations of Fiction (Writing Mastery)","subtitle":"Become a creative writing master and write killer novels, memoirs, or short stories","image":"https://img-c.udemycdn.com/course/240x135/1137208_d6de_2.jpg","price":1949670,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["Master the 6 universal foundations that make up ALL great fiction","Create complex, realistic characters who will jump right off the page","Write vibrant, riveting dialogue that will breathe life into your scenes","Construct vivid, memorable settings that will shape the world of your story","Compose intricate, scintillating prose that will pull readers in from the first word","Structure masterful, gripping plots that will hook readers and keep them turning pages"],"requirements":["A notebook and pen/pencil or a computer/tablet","A timer for writing exercises","A desire to write fiction!"],"description":"<p><br></p><p><strong><em>Do you want to write fiction that is sophisticated, compelling, and dynamic?</em></strong></p><p><strong><em>Do you want to find more inspiration in your creative writing?</em></strong></p><p><strong><em>Do you want to master the tools that every great fiction writer knows and uses to craft their novels and short&nbsp;stories?&nbsp;</em></strong></p><p><br></p><p>We're here to help!</p><p><strong><br></strong></p><p><strong>From international bestselling author and Udemy’s “Breakout Instructor of 2016” comes an ENGAGING, INSPIRING, and COMPREHENSIVE new fiction writing course for beginners and advanced writers alike!</strong></p><p>Whether you want to write <strong>novels, short stories, memoirs, flash fiction</strong> or even <strong>screenplays</strong> and <strong>stage plays</strong>, this course&nbsp;will help you <strong>master the 6 Universal Foundations </strong>that make up <em>all </em>great fiction.&nbsp;</p><p>These six tools (<strong>Character, Dialogue, Point of View, Narrative Style, Setting,</strong> and<strong> Plot</strong>) are what every accomplished fiction writer knows and uses to craft their stories. \n\n&nbsp; </p><p><br></p><p><strong>By the end of this course, you will be able to:</strong>\n\n&nbsp; </p><ul><li><p>Create <strong>complex, realistic&nbsp; &nbsp; &nbsp; characters</strong> who will jump right off the page</p></li><li><p>Write <strong>vibrant, riveting&nbsp; &nbsp; &nbsp; dialogue</strong> that will breathe life into your&nbsp; &nbsp; &nbsp; scenes</p></li><li><p>Construct <strong>vivid, memorable</strong>&nbsp; &nbsp; &nbsp; <strong>settings </strong>that&nbsp; &nbsp; &nbsp; will shape the world of your story</p></li><li><p>Compose <strong>intricate, scintillating prose</strong> that will pull readers in from the first word</p></li><li><p>Structure<strong> masterful, gripping plots</strong> that will hook readers and keep them turning pages</p></li></ul><p><br></p><p>Regardless of whether you’re a <strong>beginner or a seasoned writer</strong> looking to improve your craft, this fun, interactive course (jam packed with over 6 hours of video and more than 25 fun writing exercises) will give you the <strong>skills, confidence, and inspiration</strong> you need to become a <strong>FICTION WRITING MASTER!</strong></p><p>With <strong>two learning tracks</strong> (Foundation and Advanced), this course offers a unique<strong> flexible curriculum</strong>, allowing you to learn at your own pace and skill level.</p><p> If you’re just starting out, try our <strong>Foundation Track </strong>to master the basics first before moving onto the more advanced elements. Or, if you’re a more seasoned writer (or someone who enjoys an extra challenge!), try our <strong>Advanced Track</strong> to dive deeper into each of the six areas of fiction writing mastery. \n\n&nbsp; </p><p>Regardless of which track you choose, we <strong>guarantee </strong>that after taking this course, you will:\n\n&nbsp; </p><ul><li><p>Be more inspired to write</p></li><li><p>Feel more confident about your writing</p></li><li><p>Notice a vast improvement in your writing abilities</p></li></ul><p><strong><br></strong></p><p><strong>So who are we?</strong></p><p>Jessica Brody is a bestselling and award-winning author of more than 20 novels for kids, teens, and adults, published by several major publishers like <strong>Simon &amp; Schuster</strong>, <strong>Random House</strong>, <strong>Macmillan</strong>, and <strong>Disney Press.</strong> Her books have been translated and published in more than 23 countries and two are currently in development as major motion pictures. One of Jessica's recent novels, <em>The Chaos of Standing Still </em>received a coveted <strong>starred review </strong>from <em>Publisher’s Weekly, </em>who called it “absorbing from first page to last.” And now Jessica is sharing her <strong>proven storytelling methods</strong> and <strong>fiction writing secrets</strong> in this course.&nbsp; \n\n&nbsp; </p><p>Joanne Rendell is the author of three novels published by Penguin Books. Joanne also holds a PhD in English Literature and teaches regular writing classes for kids and teens in New York City. \n\n&nbsp; </p><p>Jessica and Joanne have also sold a sci-fi trilogy to&nbsp; <strong>Simon and Schuster</strong>. The first book, <em>Sky Without Stars </em>(a retelling of Victor Hugo’s <em>Les Misérables </em>set on another planet)&nbsp;released in March, 2019 and the sequel, <em>Between Burning Worlds </em>releases in March, 2020. <br> \n\n&nbsp; </p><p>Together, Jessica and Joanne have created an extensive course to help writers (beginner to advanced) build a storytelling foundation and nurture their love of writing.</p><p><br></p><p><strong>This course is jam packed full of:</strong> \n\n&nbsp; </p><ul><li><p><strong>Examples&nbsp; &nbsp; &nbsp; from popular books and movies </strong>that&nbsp; &nbsp; &nbsp; will help you fully grasp the elements of great storytelling</p></li><li><p>Loads of <strong>fun, inspiring writing prompts </strong>designed to spark your imagination,&nbsp; &nbsp; &nbsp; get your creative juices flowing, and implement the topics covered in each&nbsp; &nbsp; &nbsp; lecture</p></li><li><p>Tons of practical <strong>writing tips and advice</strong> to take&nbsp; &nbsp; &nbsp; you on an unforgettable creative journey toward becoming an exceptional&nbsp; &nbsp; &nbsp; fiction writer</p></li></ul><p><br></p><p>Jessica’s 10+ years of professional experience writing commercial fiction, combined with Joanne’s in-depth knowledge of classic literature and the writing craft, make for an engaging and enlightening class that is guaranteed to leave you feeling empowered and, most important, <em>inspired</em> to write.\n\n&nbsp; </p><p><strong>Enroll now and get started on your journey to becoming a Creative Writing Master!</strong></p><p><br></p><p><strong>PRAISE FOR OTHER WRITING MASTERY COURSES:</strong></p><p><em>\"Jessica Brody breaks down these concepts with clarity and amazing insight.\"&nbsp; -&nbsp;</em><strong><em>MIKE, UDEMY STUDENT</em></strong></p><p><em>\"Very informative and well worth the time and cost. Jessica has shown me some new ways to approach my storytelling and how to make sure I am telling the best tale I can.\"&nbsp;-&nbsp;</em><strong><em>NOEL,&nbsp;UDEMY STUDENT</em></strong>\n</p><p><em>\"Clear, concise, &amp; well-narrated with an abundance of enthusiasm.\" -&nbsp;</em><strong><em>CHRISTOPHER, UDEMY STUDENT</em></strong>\n</p><p><em>\"This course is worth far more than the price of admission!\" -&nbsp;</em><strong><em>TALMAGE, UDEMY STUDENT</em></strong>\n</p><p><em>\"Jessica Brody nails all the elements in this course. The exercises are brilliant and very helpful. Thank you for such a great course!\" -&nbsp;</em><strong><em>KIMBERLEY, UDEMY STUDENT</em></strong>\n</p><p><em>\"Jessica Brody has a gift for distilling lots of hard-earned information into concise and tasty bites.</em>&nbsp;-&nbsp;<strong><em>KATHERINE, UDEMY STUDENT</em></strong></p><p><em>\"If you write (or plan to write), get this course\"&nbsp;-&nbsp;</em><strong><em>SCOTT, UDEMY STUDENT</em></strong></p><p><em>\"Superb.\" &nbsp;</em><strong><em>-&nbsp;KIMBERLELY, UDEMY STUDENT</em></strong>\n</p><p><em>\"I have learned so much information that has helped me in the writing process.\"&nbsp;-&nbsp;</em><strong><em>CHRISTY, UDEMY STUDENT</em></strong></p><p><em>\"Good&nbsp;pacing, great tools, wonderful ideas... loving this course!\"&nbsp;-&nbsp;</em><strong><em>REGINA, UDEMY STUDENT</em></strong></p><p><em>\"Love the videos. Very easy to understand and lots of great tips!</em>\"&nbsp;-&nbsp;<strong><em>LISA, UDEMY STUDENT</em></strong></p><p><br></p><p><br></p>","suitableLearners":["Anyone interested in writing fiction","Anyone who wants to improve their fiction writing","Anyone looking for writing inspiration","Writers who need help finishing a story"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-03-08T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-03-11T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fb39c9b04f3f624d682"],"topics":[],"reviews":[],"meta":{"ratingCount":4969,"studentCount":16560,"avgRatingScore":4.4640718,"contentVideoLength":4424},"basicInfo":{"udemyCourseId":470846,"slug":"report-writing-made-simple","title":"Report Writing Made Simple","subtitle":"Writing a report step by step. Planning to proofing - for a polished, professional, persuasive business report.","image":"https://img-b.udemycdn.com/course/240x135/470846_7c0e_2.jpg","price":1032070,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["Save time when planning a report by knowing the essential questions to ask","Increase the impact of a report by understanding its purpose","Structure complex information and ideas confidently and  quickly (under five minutes)","Decide what sections to include in the report - and what should go where","Delight readers by making the report easy to navigate and digest","Create a visually attractive report that's kind to the eye","Avoid the common pitfalls that damage your credibility as a report writer","Know exactly what to include in your executive summary (and what not to include)"],"requirements":["Access to word processing software","Pen and paper","It's helpful to have a specific report writing project in mind - but isn't essential"],"description":"<p>Lacking confidence about your business report writing skills because you've never had any formal training in writing reports?</p><p>Panicking because you're supposed to be writing a business report and you've no idea where to start?</p><p>Sick of wasting hours worrying about how to knock all that research into a logical shape?</p><p>Or maybe you write business reports regularly but you're just not getting the results or feedback you'd like from your reports?</p><p>If any of these sound like you, stop worrying now! Because this course will take you through the process of business report writing - step by step and with downloadable cheat sheets.</p><p>What's more, your guide is a Cambridge graduate and teacher with years of experience helping people write business reports that have impact.</p><p><strong>Report writing: take the pain out of planning and the sweat out of structuring!</strong></p><p>For most people, the hardest part of report writing is getting started. In this course, you're going to learn how to shave hours, days or even weeks off the report writing process through intelligent planning. You'll learn what questions to ask so you're not reinventing the wheel when you sit down to write your report. </p><p>But best of all, you'll discover a miraculous technique that will completely revolutionise how you go about structuring your reports. I developed this technique while working with a client who had been tearing his hair out at that early shaping stage. With my help, in under five minutes he went from having no clue about how to order his report to imposing a clear, coherent, logical structure on his ideas.</p><p>I've since gone on to share this technique with other report writers and trust me they're always blown away by its power and simplicity. I can't wait to share this technique with you - and you'll be glad I did!</p><p><strong>Report writing with impact to win readers over</strong></p><p>But this course won't just save you time as a writer. It will also help you save your readers time - and they will love you for it!</p><p>The American novelist Elmore Leonard famously advised writers to leave out the parts that readers skip. And I'm going to be showing you how to leave out the parts of a report all, yes ALL, readers skip. The pointless parts every report writer thinks are helping readers, but are really hindering them.</p><p>And I'll be busting some myths about that all important executive summary. It's the only part of your report you can guarantee everyone will read, so you'll want to make sure it's as powerfully persuasive as it can be. I'll show you how.</p><p><strong>Stand out from the crowd with a report that looks as good as it reads</strong></p><p>Finally, I'll be showing you how to take your almost-finished report up a notch with simple design and layout tips from a seasoned design professional. You'll even discover one little design trick that's been scientifically - yes, scientifically - proven to boost your credibility and persuasiveness with readers.</p><p>So what are you waiting for? Let's get that report written today!</p>","suitableLearners":["Anyone who's never written a business report before and doesn't know where to start","Anyone who lacks confidence in their report writing skills - either because they've never been formally trained in report writing or because they're not getting the results they want from their reports","This course is not for students writing college reports. The emphasis is on writing reports in a business or bureaucratic context."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-11-12T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-11-15T00:00:00.000Z"},"promotions":{"discountPrice":412920,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fb39c9b04f3f624d682"],"topics":[],"reviews":[],"meta":{"ratingCount":4958,"studentCount":28332,"avgRatingScore":4.577129,"contentVideoLength":8632},"basicInfo":{"udemyCourseId":484114,"slug":"punctuation-mastery","title":"Punctuation Mastery","subtitle":"A Non-Technical Guide To Using Punctuation With Style","image":"https://img-c.udemycdn.com/course/240x135/484114_6ad5_3.jpg","price":1949670,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["Learn how to apply punctuation stylishly","Write with more confidence and flair","Spruce up your reports, essays, resumes, books, blogs and articles"],"requirements":["Pen and paper, or computer for taking notes and doing exercises"],"description":"<p>From the creator of one of Udemy's most popular courses, <strong>Writing With Flair: How To Become An Exceptional Writer</strong>, comes <strong>Punctuation Mastery, </strong>a non-technical guide to using commas, dashes and other types of punctuation more stylishly.</p><p><em>\"Every once in a while, you find that one person who understands you, and teaches you exactly what you wanted to know...\"&nbsp;</em><strong><em>-- JAYANTH S, UDEMY STUDENT</em></strong></p><p><em>\"Didn't realize punctuation could be so cool...\"&nbsp;</em><strong><em>-- RYAN, UDEMY STUDENT</em></strong></p><p><em>\"Exactly what I needed to clear up all confusions I had about punctuation&nbsp;without reading through boring grammar lessons...\"&nbsp;</em><strong><em>-- NIKKI BRUSOE, UDEMY STUDENT</em></strong></p><p><strong>PLEASE&nbsp;NOTE:&nbsp;This program is not for you if you're seeking a strict guide to formal punctuation rules, which can be obtained from any number of books and grammar experts. It offers the author's personal, often unorthodox, take on punctuation based on decades of experience in the news business. The program adopts mostly a non-technical, intuitive approach to the subject with the aim, above all, of fostering clear and elegant writing that is easy (and pleasurable) for readers to navigate.&nbsp; </strong></p><p>Are you among the growing army of people seeking to make a mark on the world by writing an outstanding book or creating a magnificent blog read by thousands?</p><p>If so, you will find it easier to make an impact once you discover how to use punctuation more stylishly.</p><p>Conversely, if you don't yet know how to use <strong>commas</strong>, <strong>colons</strong>, <strong>semi-colons</strong>, <strong>hyphens</strong>, <strong>apostrophes</strong> and <strong>dashes</strong> with a certain kind of flair, you may never be able to weave magic with your words.</p><p>While studying all aspects of grammar in a formal setting is highly recommended, a strictly technical approach to punctuation can often leave students bored and uninspired.&nbsp; &nbsp;</p><p>That's why, here, you will find a more intuitive and flexible approach: one that focuses exclusively on the purpose of communicating powerfully and beautifully, rather than on just blindly following rules.&nbsp; </p><p>The goal is to help make your writing more effective, while steering clear of the dense jungle of jargon that can destroy your enthusiasm.&nbsp; &nbsp;</p><p><em>\"One of the best courses I have ever taken...\" </em><strong><em>--&nbsp;RICHARD&nbsp;HAKE, UDEMY&nbsp;STUDENT</em></strong></p><p><em>\"Good for any writer looking to work&nbsp;on their clarity and form...\" </em><strong><em>--&nbsp;BRENDAN&nbsp;TERRY, UDEMY&nbsp;STUDENT</em></strong></p><p><em>\"Will agonize less when editing...\" </em><strong><em>-- JOAN SALANITRI, UDEMY STUDENT</em></strong></p><p><em>\"Puts you behind the steering wheel...\" </em><strong><em>-- CHRIS HEMMES, UDEMY STUDENT</em></strong></p><p><em>\"Take this course if you want to write like a pro...\"</em><strong><em> -- AARON LEBLANC, UDEMY STUDENT</em></strong></p><p><em>\"Thought I knew how to effectively use punctuation...\" </em><strong><em>-- IGOR MILOSAVLJEVIC, UDEMY STUDENT</em></strong></p><p><em>\"Covers just about everything...\" </em><strong><em>-- KNOWLEDGE GATHERING, UDEMY STUDENT</em></strong></p><p><em>\"Will now write with more confidence...\" </em><strong><em>-- DEVON HALL, UDEMY STUDENT</em></strong></p><p><em>\"Clarified a lot of questions...\" </em><strong><em>-- ARIEL JACOBY, UDEMY STUDENT</em></strong></p><p><em>\"One of those people whose products I don't even think about buying. I just buy them...\" </em><strong><em>-- IVAN JURAS, UDEMY STUDENT</em></strong></p><p><strong>So, if you spend ages wondering whether a comma should go here or there, and then doubt yourself straight afterwards because of all the complex rules around comma placement... Or, if you frequently end up with a random mess of semi-colons littering the page and distracting from your message... Or, if you don't yet know how to use a dash or colon to create dramatic tension in your writing....</strong></p><p>Then this course, developed by someone who has written edited for top news organisations, including The Wall Street Journal, should help put you on a firmer footing.</p><p><em>To reiterate, this course is </em><strong><em>NOT</em></strong><em> for those interested in a \"purist\" approach to punctuation based on traditional grammar rules. There is certainly a place for such an approach, and you can, if you want, find it elsewhere. The program is for nonfiction writers seeking a more intuitive and commonsense guide to punctuation, as well as for those interested in learning about some of its more hidden aspects.</em></p><p>Some of the best professional writers don't treat punctuation as a set of rigid rules to obediently follow. They see it, rather, as a <strong>tool</strong> for making their communication more engaging and captivating.&nbsp; </p><p>Your school and college tutors may have discussed punctuation in a largely jargon-laden way that may have left you bored or mystified. You may even dread going back to the subject.</p><p>This course steers clear of all that. By the end, you may wonder why nobody told you punctuation could be so interesting. </p><p>You'll discover, for instance, that a <strong>comma </strong>doesn't just help create useful pauses in a sentence, but that it can be a mighty weapon letting you express your ideas with more clarity and gracefulness. You'll discover that <strong>colons </strong>don't just give you a neat way of introducing lists; they can be used to heighten drama and anticipation.</p><p>In fact, you'll come to see that each little symbol that you thought was so mundane has its own unique power to create special effects right across your writing. </p>","suitableLearners":["Anyone unsure of how to use punctuation","Anyone who wants to deepen their understanding of punctuation","Marketers, salespeople, communications professionals","Writers and journalists","Students"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2020-09-21T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2020-09-24T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fb39c9b04f3f624d682"],"topics":[],"reviews":[],"meta":{"ratingCount":4843,"studentCount":24751,"avgRatingScore":4.5301356,"contentVideoLength":7965},"basicInfo":{"udemyCourseId":1327004,"slug":"develop-amazing-social-skills-connect-with-people","title":"Develop Amazing Social Skills & Connect With People","subtitle":"Develop Amazing Social Skills, Social Confidence, Communication Skills, Self Esteem, Charisma, Self confidence","image":"https://img-c.udemycdn.com/course/240x135/1327004_268e_20.jpg","price":2064370,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["Start A New Conversation With Anyone","Make A Powerful First Impression","Connect With People Instantly","Master Social Events (Networking, etc)","Destroy Your Social Fears (rejection, etc)","Communicate With Confidence & Charisma","Boost Your Social Confidence","Make New Friends","and so much more!"],"requirements":["You can have a pen and notepad to take notes","You should be willing to apply the advice that you will get in this course"],"description":"<p><strong>**Alain's work has been featured on CBS, NBC, ABC, FOX, CW and 300+ of nationally-syndicated television, newspaper, and magazine outlets.** </strong></p><p><strong>3 REASONS TO TAKE THIS COURSE RIGHT NOW:</strong></p><ul><li><p>OVER <strong>150'000+ happy students</strong> from <strong>183 countries</strong>&nbsp;have enrolled in my courses and have left <strong>6'500+ TOP Reviews</strong></p></li><li><p>Presented by the social skills expert, Alain W., who is a <strong>recognized expert</strong> in the field of social skills and communication skills <strong>with over 15 years of experience</strong></p></li><li><p>There is a <strong>30 day money back guarantee offered by Udemy</strong>. I&nbsp;am 100%&nbsp;confident that this course will help you communicate better with people so<strong> try it risk FREE!</strong></p></li></ul><p><strong>In this course, you will learn all the social skills you will ever need! You will learn the art of approaching people and becoming unforgettable so you can make new friends, get new clients, or simply attract more opportunities to your life.&nbsp;</strong></p><p>You will learn how to make a powerful first impression with everyone you meet.&nbsp;</p><p>You will also learn how to be more confident and comfortable in social events.&nbsp;</p><p>You will also have the tools and techniques to be more charismatic and become the most interesting person in the room.&nbsp;</p><p>So my question to you is:</p><p><strong>Would you like to learn the art of having great interactions with people constantly?</strong></p><p>I don't want to convince you to take this course. I would like you to try it and see how it can transform your life. If you don't like it, return it! The 30 day money back guarantee is here to make you feel 100% comfortable with the decision of enrolling in this course.</p><p>Everyone can learn social skills. It is like playing sports. You can hire a coach and he will help you to develop your skills. Everyone can become socially successful as long as they have the best advice. My style is direct, to the point, no fluff and I only share what works &amp; will give you the results you want fast. Obama learnt social skills, shy people learn social skills everyday.&nbsp; </p><p>This course is for people who would like to develop better social skills &amp; communication skills in any category of your life; work, family, personal life, etc. If you are socially shy, I'll go over the basics so you can improve your social skills. If you already have good social skills, I'll share many advanced concepts &amp; techniques so you can develop even more extraordinary social skills.</p><p>You will learn how to start any interaction, exactly what to say, how to never run out of things to say, how to remove your fear of approaching, how to connect with people, how to make friends, how to be confident &amp; comfortable in social interactions, how to be the most interesting person in the room &amp; so much more!</p><p>There is a 30 day money back guarantee, so you can enroll in the course, watch the entire course, learn some social skills in the way and if you decide that this course is not for you, you can get your money back within 30 days with no questions asked. You have zero risk! You can only improve your social skills from that deal.</p><p>Go ahead and enroll in the course now. See you on the other side.</p><p><strong>WHAT PEOPLE ARE SAYING ABOUT THIS COURSE:</strong></p><p><em>\"this course inspired me with a lot of points before making my new year plan\"&nbsp;Basma ★★★★★<br></em></p><p><em>\"Just awesome.\"&nbsp;Shah ★★★★★</em></p><p><em>\"I'm enjoying every second of this course! Super helpful information and I'm learning a lot. The instructor is an outstanding presenter, warm and engaging, with a great sense of humor. It's more like listening to a best friend haring his skills than a lecture. Thank you for this course!\"</em>&nbsp;Caroline ★★★★★</p><p><em>\"The presenter have broad knowledge on the subject and explain in details on the course.\"</em>&nbsp;Abdul ★★★★★</p><p><em>\"absolutely deserve 5 stars\"&nbsp;</em>Osama ★★★★★</p>","suitableLearners":["People would like to develop powerful social skills","People who would like to communicate better with people around them","People would like to understand better social dynamics","People who would like to learn how to approach, connect and make a great first impression"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-11-11T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-11-14T00:00:00.000Z"},"promotions":{"discountPrice":298220,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fb39c9b04f3f624d682"],"topics":[],"reviews":[],"meta":{"ratingCount":4756,"studentCount":32205,"avgRatingScore":4.522349,"contentVideoLength":23566},"basicInfo":{"udemyCourseId":963844,"slug":"editing-mastery-how-to-edit-writing-to-perfection","title":"Editing Mastery: How To Edit Writing To Perfection","subtitle":"The Deep Editing Secrets Of The World's Best Editors","image":"https://img-c.udemycdn.com/course/240x135/963844_5c09_2.jpg","price":1949670,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["You will receive an Editing Mastery Certificate of Completion after finishing the course.","You will discover how top editors create captivating copy for millions of readers every day.","You will learn how to professionally edit almost any type of nonfiction writing.","You will learn the tricks of the trade from an experienced ex-Wall Street Journal editor.","You will learn how to self-edit your writing to an immaculate standard.","You will discover how to effortlessly create spellbinding writing.","You will learn how to confidently improve the content, structure, style and presentation of a piece of nonfiction writing.","You will learn a method and tools that will set you apart from other editors."],"requirements":["You will need a desktop computer or laptop to perform editing exercises","Having Adobe Acrobat will make doing editing exercises easier, since assignments are provided in PDF form."],"description":"<p>FROM&nbsp;THE&nbsp;CREATOR&nbsp;OF THE&nbsp;BESTSELLING,&nbsp;<strong><em>Writing With Flair: How To Become An Exceptional Writer...</em></strong></p><p><strong>Want to become an outstanding&nbsp;editor?</strong></p><p>Most editors do a fine job of&nbsp;fixing up the&nbsp;spelling, grammar, punctuation, and typos in a piece of writing.</p><p>It takes a different skill&nbsp;level to turn dry,&nbsp;disorganised, and clunky prose into writing that is beautifully organised&nbsp;and bursting with life and&nbsp;energy.</p><p>Imagine having that power over your own&nbsp;writing.&nbsp;</p><p><strong>Enter,&nbsp;deep editing</strong></p><p><strong><em>Editing Mastery</em></strong>&nbsp;introduces&nbsp;you to&nbsp;a technique the author calls deep editing,&nbsp;familiar only&nbsp;to an inner circle&nbsp;of exceptional editors.</p><p>It offers&nbsp;a systematic way of editing&nbsp;that reliably&nbsp;transforms almost&nbsp;any piece of nonfiction&nbsp;writing into magnificent, sparkling prose.</p><p>The deep editing&nbsp;technique forces you to consider <strong><em>every</em></strong> aspect of&nbsp;a document, ensuring&nbsp;that&nbsp;quality gets embedded into each&nbsp;and every pore of the writing.&nbsp;</p><p><em>\"It takes a genius to make the complex and difficult look exceedingly easy and simple and Shani Raja is one such case. I learned so much from him that even though I spent my life in journalism, I never learned as much from anyone as I did from him. Highly recommended...\"</em> <strong><em>-- GLORIA LINDA ABELL, UDEMY&nbsp;STUDENT</em></strong></p><p><em>\"I'm crafting better content than ever...\"&nbsp;</em><strong><em>-- PAULO&nbsp;ARMI, UDEMY&nbsp;STUDENT</em></strong></p><p><em>\"The editing process is beautifully simplified...\"&nbsp;</em><strong><em>-- SUMAN PRABHU, UDEMY&nbsp;STUDENT</em></strong></p><p><em>\"A&nbsp;remarkably simple and clear process to edit writing...\"&nbsp;</em><strong><em>-- JIM&nbsp;CANTONI, UDEMY&nbsp;STUDENT&nbsp;</em></strong></p><p><em>\"Satisfies a writer's hunger for certainty that his work will garner a five star ranking...\"</em><strong><em>&nbsp;-- GREG&nbsp;STONE, UDEMY&nbsp;STUDENT</em></strong></p><p><em>\"The most professionally produced training I've seen on Udemy&nbsp;...\"&nbsp;</em><strong><em>-- DANIEL&nbsp;HARRIGAN, UDEMY&nbsp;STUDENT</em></strong></p><p><em>\"My experience while doing this Deep Editing course has been one of sheer delight...\" </em><strong><em>-- ROSALIE&nbsp;PRINTER, UDEMY&nbsp;STUDENT</em></strong></p><p><em>\"Every lesson is gold...\" --&nbsp;</em><strong><em>MEGHAN&nbsp;BLOOD,&nbsp;UDEMY&nbsp;STUDENT</em></strong></p><p><em>\"Excellent for anyone who wants to learn about clarity, simplicity, and elegance in writing...\" </em><strong><em>-- AGATA&nbsp;T SZCODRAK, UDEMY&nbsp;STUDENT</em></strong></p><p><em>\"Half an hour into this course, and I am less overwhelmed...\"&nbsp;</em><strong><em>--&nbsp;KATEY&nbsp;NIXON, UDEMY&nbsp;STUDENT</em></strong></p><p><em>\"Simply awesome...\" </em><strong><em>-- GOPINATH CHANDRA, UDEMY&nbsp;STUDENT</em></strong></p><p><em>\"Brilliant content and structure...\" </em><strong><em>-- JESS&nbsp;MELAS,&nbsp;UDEMY&nbsp;STUDENT</em></strong></p><p><em>\"A very lean and methodical way to edit a document...\" </em><strong><em>--&nbsp;DANA&nbsp;PETERSON, UDMEY&nbsp;STUDENT</em></strong></p><p><em>\"A genius teacher...\"&nbsp;</em><strong><em>-- TRISH&nbsp;ELLIS, UDEMY&nbsp;STUDENT</em></strong></p><p><em>\"Will help editors of every level...\"&nbsp;</em><strong><em>--&nbsp;DSDAVIS, UDEMY&nbsp;STUDENT</em></strong></p><p><em>\"A realistic perspective on different editing techniques...\" </em><strong><em>-- CHAE CLARK, UDEMY&nbsp;STUDENT</em></strong></p><p><em>\"Very impressed...\"&nbsp;</em><strong><em>-- MICHAEL&nbsp;JORDAN, UDEMY&nbsp;STUDENT</em></strong></p><p><em>\"Concise and practical...\" </em><strong><em>-- AUROSHREE MAJUMDAR, UDEMY&nbsp;STUDENT</em></strong></p><p><strong>\"</strong><em>A process we can follow for all our writing...\" </em><strong><em>-- JOAN&nbsp;SALANITRI -- UDEMY&nbsp;STUDENT</em></strong></p><p><em>\"Shani's courses are simply the best when it comes to real life, practical, applicable writing...\" </em><strong><em>-- ALICIA&nbsp;ADAMS, UDEMY&nbsp;STUDENT</em></strong></p><p><strong>The deep editing&nbsp;method&nbsp;will&nbsp;set you apart from other editors --&nbsp;whether you’re editing a book, a blog, an essay, or business writing of some type.</strong></p><p>It will also help you self-edit your own writing to its full potential.</p><p><strong><em>[NOTE:&nbsp;Having Adobe Acrobat may make doing the editing exercises in the course slightly easier, as assignments are provided only in PDF form.]</em></strong></p><p><strong>Trade secrets&nbsp;</strong></p><p>Among the few&nbsp;who know how&nbsp;perform this sort of&nbsp;advanced&nbsp;surgery on writing are senior editors on top newspapers, who spend their days turning raw copy into captivating stories for millions of readers.</p><p>I've&nbsp;worked for several such newspapers,&nbsp;including The Wall Street Journal, where I was employed as&nbsp;a senior editor and writing coach&nbsp;for some years.</p><p><strong><em>Once you learn these deep&nbsp;editing secrets, you won't just be a competent editor. You'll become a masterful one.</em></strong></p><p>Having these skills will&nbsp;enhance your own writing exponentially, too,&nbsp;as you begin&nbsp;incorporating deep-editing techniques into your work naturally.</p><p>Your books, blogs, essays, emails, or&nbsp;website copy will&nbsp;shine like never before.&nbsp;</p><p><strong>What is deep editing?</strong></p><p>The system basically has four stages.&nbsp;First, you edit the <strong><em>content</em></strong> of a piece of writing.&nbsp;Then you edit the <strong><em>structure</em></strong>.&nbsp;Next, you edit for <strong><em>style</em></strong>.&nbsp;And finally, you focus on the&nbsp;<strong><em>presentation</em></strong>.&nbsp;</p><p>By&nbsp;concentrating&nbsp;on&nbsp;those layers one at a time, your edit will be thorough --&nbsp;and the writing as a result&nbsp;will&nbsp;look&nbsp;spectacularly polished.</p><p><strong>STAGE 1: THE&nbsp;CONTENT&nbsp;EDIT</strong></p><ul><li><p>You&nbsp;make sure every point in a piece of writing is unique,&nbsp;makes perfect sense, is factually correct, and is worth keeping.</p></li></ul><p><br></p><p><strong>STAGE 2: THE&nbsp;STRUCTURE&nbsp;EDIT</strong></p><ul><li><p>You&nbsp;organise all the points into an orderly narrative that flows elegantly from start to finish.</p></li></ul><p><br></p><p><strong>STAGE 3: THE&nbsp;STYLE&nbsp;EDIT</strong><br></p><ul><li><p>You&nbsp;make sure all the ideas are expressed as simply, clearly,&nbsp;elegantly, and evocatively as possible. &nbsp;</p></li></ul><p><br></p><p><strong>STAGE 4: THE&nbsp;PRESENTATION EDIT</strong></p><ul><li><p>You&nbsp;fix&nbsp;any mistakes and inconsistencies that&nbsp;create a bad look for any type of professional writing.</p></li></ul><p><br></p><p><strong>In this premium&nbsp;course, I'll guide you&nbsp;through each stage of a deep edit so&nbsp;the process becomes second nature to you.&nbsp;<br></strong></p><p>You'll be editing a piece of writing right along&nbsp;with me.&nbsp;I chose&nbsp;this interactive&nbsp;method to help you get to the top of the learning curve of deep editing in the fastest possible time.</p><p>The writing you'll&nbsp;be working with&nbsp;will be very&nbsp;flawed and difficult to edit. But with my help, you'll&nbsp;move step by step&nbsp;toward&nbsp;making it read brilliantly.</p><p><strong>Supreme&nbsp;confidence and competence</strong></p><p>Once you know how to deep&nbsp;edit,&nbsp;you'll know&nbsp;how to make any type of writing&nbsp;reach&nbsp;its full potential.</p><p>You'll&nbsp;come out of&nbsp;this course&nbsp;a&nbsp;much more proficient and&nbsp;confident editor,&nbsp;as well as a much better writer.<br></p><p><strong>ABOUT THE&nbsp;INSTRUCTOR&nbsp;</strong><br></p><p><em>Shani Raja is a veteran&nbsp;journalist who&nbsp;has edited for&nbsp;The Wall Street Journal and&nbsp;contributed to&nbsp;The Economist, the&nbsp;Financial Times,&nbsp;and&nbsp;Bloomberg News, among other top news organisations. He has trained&nbsp;dozens of&nbsp;prominent journalists in the craft of writing, including at The Wall Street&nbsp;Journal. Shani's flagship course,&nbsp;</em><strong><em>Writing With Flair</em></strong><em>,&nbsp;has long been&nbsp;the&nbsp;bestselling writing course&nbsp;on Udemy,&nbsp;with many&nbsp;tens of thousands of passionate&nbsp;students&nbsp;learning how to become elite writers.&nbsp;</em></p>","suitableLearners":["Anyone who wants to become a professional editor","Anyone who is already an editor and wants to raise their game","Anyone who wants to dramatically enhance their own writing by self-editing"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-08-29T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-09-01T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fb39c9b04f3f624d682"],"topics":[],"reviews":[],"meta":{"ratingCount":4728,"studentCount":8989,"avgRatingScore":4.4314647,"contentVideoLength":6211},"basicInfo":{"udemyCourseId":1411696,"slug":"digital-diversitycyber-citizencross-cultural-communication","title":"Digital Diversity/Cyber-Citizen/Cross Cultural Communication","subtitle":"Connecting Across Cultures: Multi-cultural, \"-national, \"-generational, \"-sectoral, \"-lingual, and \"-stakeholder Teams","image":"https://img-c.udemycdn.com/course/240x135/1411696_4ebc_3.jpg","price":573270,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["How to use specific communications tools effectively to hit your target market with the right message via the right medium at the right time.","Create a Communications Charter with and for your team setting expectations and standards for connecting.","Implement a Communications Matrix with specified channels, media, frequency, and messages for your target audiences.","Coach your teams to identify the cultural challenges of distinct country, corporate, and generational cultures.","Why it matters which country and cultural distinctions are associated with high and low country contexts.","How Generational characteristics cause misunderstanding preventing meaningful connection.","What leadership styles to apply and what are the five dysfunctions of teams.","Learn individual's communication styles to move people from reactive to proactive and lift performance."],"requirements":["You should understand English and you may be multilingual, and you may have some work experience or a desire to work in a multi-cultural or multi-generational project, team, organization, company or community.","Please be prepared to take notes and focus without distraction to actively listen and proactively make distinctions among cultures, generations, as well as leadership and communication styles."],"description":"<p>Successful cultural communication in a globalized and digitized world is more urgent and important than ever for business, corporate and organizational performance.</p><p>Accelerating cyber connectivity creates an ever-shrinking world over ubiquitous platforms expanding access to emerging talent 24/7 beyond borders, time zones, languages, generations, countries, cultures, and corporate behaviors. </p><ul><li><p>How will you capture your share of the global communications currency? </p></li></ul><ul><li><p>How will you become fluent in this borderless world and connect to this global community that knows no boundaries and demands more and expects no less than excellence, innovation, access to foreign talent pools?</p></li></ul><p><strong>Join us now and become a member of this global movement of cyber citizens and global cross cultural community!</strong></p><p><strong>Don't miss out.  Take this on-ramp to the global highway connecting you to the world. Get connected and become fluent in cross cultural communications.</strong></p>","suitableLearners":["International students, global businesses, corporations, organizations, emergency and disaster relief teams, international development project teams, multi-cultural communities, community service personnel including police services.","Udemy instructors and Association managers, Non-governmental Organization experts,  International Development experts, International students, global businesses, corporations, organizations, emergency and disaster relief teams, international development project teams, multi-cultural communities,","Business people and online or digital entrepreneurs expanding beyond borders and connecting to a global marketplace.","Bloggers and communicators connecting across generations and with messages targeted to hit stakeholders worldwide.","Project managers and team leaders, virtual team members","Travel enthusiasts","Community services including police and security services."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2017-11-17T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2017-11-20T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}}]