[{"status":"active","categories":["625e82a09c9b04f3f624d732","625e82f49c9b04f3f624d77f"],"topics":[],"reviews":[],"meta":{"ratingCount":4009,"studentCount":18465,"avgRatingScore":4.634256,"contentVideoLength":55064},"basicInfo":{"udemyCourseId":1855830,"slug":"the-complete-sketch-5-course-design-apps-websites-2021","title":"The Complete Sketch 5 Course - Design Apps & Websites 2021","subtitle":"Master Sketch software and learn a modern approach to designing mobile apps, websites, and everything UI/UX","image":"https://img-c.udemycdn.com/course/240x135/1855830_155f_4.jpg","price":1949670,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["Master the number one platform in UI/UX design, Sketch.","Take an idea and bring it to life. Everyone has a great idea, this course will allow you to start building your dream.","Wireframe websites, mobile apps, and more.","Design Mobile Apps, Websites, Web Apps & More","Create a clickable prototype that looks and functions like the real deal.","Build a style guide to make sure everything you do stays on brand.","Approach product design from a complete Design System","Join a startup, land your dream job, or freelance on the side for extra cash"],"requirements":["We do not require any pre defined skills to take this course. A good attitude is all it takes to master the concepts.","Sketch is a free-to-try software built specifically for Mac computers and Apple OS. If you do not have a Mac and are using a Windows computer, make sure you are running the OS X virtual environment on your computer"],"description":"<p><strong>This course uses Sketch 5 (version 51.2), course version 2018.1 - released August 23rd 2018,</strong> <strong>and featuring the latest features of Sketch 3</strong> <strong>such as Libraries &amp; Prototyping.</strong></p><p>Clean, intuitive and frequently named on of the best packages available for digital design, Sketch is used by everyone from entrepreneurs and start ups to Apple, Google, Facebook, and Instagram. </p><p>A brilliant tool for platform design, Sketch and can be learned in a matter of hours and days, not weeks and months, and this course will take your mobile and web app designs to the next level! </p><p>But is it the right course for you? It is if....</p><ul><li><p>You want to get a job at an amazing company like Facebook, Google, Amazon, or Uber. </p></li><li><p>You have amazing startup ideas, but don't know how to bring them to life.</p></li><li><p>You are tired of your day job and want to learn a new (and extremely valuable) skill.</p></li><li><p>You want to earn money on the side as a freelancer.</p></li><li><p>You want to change your career trajectory but do not have the time or money to go to an immersive 3 month bootcamp.</p></li><li><p>You are a developer and want to be able to run all aspects of the product development lifecycle including frontend design.</p></li></ul><p>Still not convinced? Course instructor Andrew Eddy is an extremely well regarded UI/UX designer with over 10 years of professional experience. He has helped some of the largest companies in the world design beautiful products, and worked with countless start-ups to help bring their ideas to life. And he did it all with one tool, Sketch.</p><p>With <strong>over 13 hours</strong> of content across <strong>110+ lectures</strong>, Andrew will take you from beginner to expert, and teach you everything you need to know in order to use Sketch in professional setting. The first half of the course is a compendium of hundreds of the most important techniques, key shortcuts, tips and tricks... welcome to:</p><ul><li><p><strong>Sketch University!</strong> The most comprehensive A-Z approach to understanding Sketch concepts and the tools that power the platform.</p></li></ul><p>The second half of the course is entirely practical and teaches you the skills you need to tackle your own projects and ideas. Together you and Andrew will design, build and complete two brilliant projects. Beginning with a...: </p><ul><li><p><strong>Speed Project</strong>! Use your newfound skills to design your very first mobile app screen.</p></li></ul><p>This is followed by a huge, in-depth project to build a commercial mobile and web app called Spendo. Here you’ll get the inside track on everything you need to consider for your own projects - from the initial idea, through research and mock ups, to prototyping, design and, finally, the deployment of assets to developers<strong>:</strong></p><ul><li><p><strong>The Idea: </strong>What do you need to consider when launching your own business? Find out here!</p></li><li><p><strong>Style Guide</strong>: Learn how to create a brand-focused style guide, and why it’s so important you do! Includes typography and colour design. </p></li><li><p><strong>Logo Design</strong>: Every great business needs a great logo. In this section you’ll learn how to create an amazing business logo. </p></li><li><p><strong>Wireframing</strong>: Learn what a wireframe is and how to use it to create a first draft for a mobile application. </p></li><li><p><strong>Building the mobile app:</strong> Learn best practices for your mobile design work, from an industry professional!</p></li><li><p><strong>Building the web app: </strong>See how web differs from mobile, and the key elements you must include for a successful web app.</p></li></ul><p><strong>Every lecture is fully supported by the Instructor, </strong>with image downloads and sketch files available, as well as additional resources, quizzes, and assignments to make sure test and cement your knowledge. </p><p>A fantastic course for people with zero design experience, or for experienced designers that want to learn and master Sketch 3. <strong>By the end of this course you’ll have a complete, professional-level project for your own portfolio, </strong>and every student will have the knowledge they need to create beautiful and usable apps that leave people with a smile on their face.</p><p><strong>Course highlights:</strong></p><ul><li><p>Practical, A-Z project of App design</p></li><li><p>Tips &amp; Tricks, make most of Sketch Tools</p></li><li><p>Vector Tools and Symbols</p></li><li><p>Colors, Icons, and Typography</p></li><li><p><strong>BONUS!</strong> Creating a working, interactive Prototype</p></li><li><p>A certificate of completion upon finishing the course.</p></li></ul><p>So, what are you waiting for? Enroll today!!</p>","suitableLearners":["Entrepreneurs that want to finally bring their startup to life. This is the single biggest step you can take to getting a product out into the world.","Developers that want to understand front end principles to compliment their existing skills.","Anyone that is tired of their day job and wants to change their career.","People that want to earn additional income freelancing.","Individuals that want to land their dream job at companies like Google, Facebook, and Uber."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2020-04-12T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2020-04-15T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e82f49c9b04f3f624d77f"],"topics":[],"reviews":[],"meta":{"ratingCount":2667,"studentCount":19140,"avgRatingScore":4.464231,"contentVideoLength":46284},"basicInfo":{"udemyCourseId":1984658,"slug":"adobe-cc-masterclass-photoshop-illustrator-xd-indesign","title":"Adobe CC Masterclass: Photoshop, Illustrator, XD & InDesign","subtitle":"Learn graphic design today with Photoshop, Illustrator, Adobe XD, InDesign & more in this Adobe CC Masterclass!","image":"https://img-c.udemycdn.com/course/240x135/1984658_99af_2.jpg","price":2523170,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["You will have beginner to expert level knowledge of graphic design and Adobe CC applications that you will immediately be able to apply to your career, job, hobby, or company.","You will be given a major overview of the most common graphic design programs and how you can use them to your advantage.","You will be given real-world, applicable projects that you can follow along with and practice.","You will achieve the experience and knowledge to take graphic design fundamentals and apply them in your everyday life.","You will learn Adobe Photoshop, the industry-leading program for photo editing and manipulation.","You will learn Adobe Illustrator, the number one software for creating graphics, icons, symbols, branding, and more.","You will learn Adobe XD, the premiere software for creating stunning web design and mobile app design mockups.","You will learn Adobe InDesign, the best software on the market for publishing and marketing materials."],"requirements":["This course is for beginners to graphic design and for anyone who wants to learn the full suite of Adobe CC products, including Illustrator, Photoshop, XD, InDesign, and more!","You will learn intermediate and advanced terminology that you can use to incorporate in graphic design, user interfaces, mobile app design, logo design, t-shirt design, and other digital or print mediums.","You will need a subscription to the Adobe CC suite of applications. The current version filmed in this course is the Adobe CC 2019 suite.","Project files and resources can be found in available lessons located directly in this course."],"description":"<p><strong>Learn Graphic Design with Adobe CC in this New Course!</strong></p><p>Many people want to become designers but don't know the basic fundamentals of design at all.</p><p>It can takes years to piece together different ideas to truly begin to understand how it even works.</p><p><em>but it doesn't have to be like that.</em></p><p>By utilizing the proper tools of programs like Photoshop, Illustrator, XD, InDesign, and more you can propel yourself from a <strong>beginner to an expert</strong>, <em>just by having the right education</em>.</p><p>You have found the perfect course for learning graphic design. It doesn't matter if you have no experience at all, this course was designed to teach you design in the most effective means necessary.  </p><p>With <strong>over 13+ hours </strong>(and counting) <strong>of video</strong> and <strong>practical projects to follow along with</strong>, this course is<strong> JAM PACKED</strong> with information to help you learn this graphic design and Adobe CC programs!</p><p>The videos build on one another so that as you work through this course, you will understand more and more!</p><p>Not only that, but this course is also designed so that if you already know some graphic design principles and just need help with a specific program, <em>you can skip directly to that topic!  </em></p><p><strong>So who can benefit from learning graphic design?</strong></p><p>The fundamentals of design are useful for a lot of careers, industries, and hobbies. It doesn't matter if it's logo design, web design, social media, user interface design, advertising, product design, printing, or t-shirts. <strong>This course will cover ideas that can be used in any niche!</strong></p><p>Each section goes into specific detail of the main principle being taught so that you get in-depth knowledge of that theory. And most sections come with a practical, real-world project that you can follow along with.</p><p><strong>This course will cover:</strong></p><ul><li><p>Adobe CC Programs</p></li><li><p>Adobe Photoshop</p></li><li><p>Adobe Illustrator</p></li><li><p>Adobe XD</p></li><li><p>Adobe InDesign</p></li><li><p>Social Media Graphic Design</p></li><li><p>Icon Design</p></li><li><p>Logo Design</p></li><li><p>Website Design</p></li><li><p>Mobile App Design</p></li><li><p>Poster Design</p></li><li><p>Book Cover Design</p></li><li><p>and much, much more!</p></li></ul><p><strong>Other great stuff you might want to know..</strong></p><p>Not only will you get over<strong> 13+ hours of video content</strong> (and counting) and lessons, project files, and a new life skill, you will also have direct communication with the instructors to help you along.</p><p>This includes direct messages, discussions, and specialized projects in the course that will allow you to interact with the instructors and others. There is even a <strong>facebook group </strong>to connect with Lindsay and I and other students to ask questions, get feedback and participate in design challenges. </p><p><em>Feeling lost?</em>  Don't worry, <strong>we are here for you!</strong></p><p>As they say, \"Come for the course, stay for the community.\"</p><p><strong>What else is there to know?</strong></p><p>Well there is that little <strong>30 day money back guarantee</strong> thing.</p><p>That basically means that if you don't enjoy this course for any reason at all, you can get a <em>full refund</em> up to thirty days since the time you purchase it.</p><p>It's a <strong>win-win situation!</strong></p><p>and we applaud winners.</p><p><strong>So what are you waiting for?!</strong></p><p>The time is now to stop procrastinating and begin learning graphic design with Adobe CC so that you can take full advantage of everything that it has to offer!</p><p><strong>Enroll now in this course and get started!</strong></p>","suitableLearners":["This course is specifically design for beginners interested in graphic design. Philosophies and practical projects are given so that you not only understand the reasoning behind the theory, but you also get a chance to practice it to.","This course is great for:","- Graphic Designers","- Website Designers","- Logo Designers","- UI / UX Designers","- Product Designers","- T-Shirt Designers","- Businesses","- Marketers","- Publishiers","- Social Media Experts","any anyone else interested in learning the fundamentals of graphic design and Adobe CC programs!"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2020-05-09T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2020-05-12T00:00:00.000Z"},"promotions":{"discountPrice":367040,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e82f49c9b04f3f624d77f"],"topics":[],"reviews":[],"meta":{"ratingCount":2554,"studentCount":30502,"avgRatingScore":4.380065,"contentVideoLength":55676},"basicInfo":{"udemyCourseId":1771952,"slug":"davinci-resolve-2022-the-complete-video-editing-course","title":"DaVinci Resolve 2022 - The Complete Video Editing Course","subtitle":"Master the art of Video Editing, Color Correction & Color Grading in DaVinci Resolve 16 & DaVinci Resolve 17","image":"https://img-c.udemycdn.com/course/240x135/1771952_99db_3.jpg","price":1949670,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["Edit an entire video from beginning to end, using professional and efficient techniques in DaVinci Resolve 16","By the end of the course, you'll have edited your own short documentary using either the supplied footage (video clips, photos, graphics, music, etc.), or your own footage!","Start a project with the right settings for any type of video, from any camera.","Edit your videos, and make them more dynamic with cutaway footage and photos.","Export and save your videos for HD playback in DaVinci Resolve 16","Design clean and professional titles for you videos.","Add motion to your titles, photos, and videos... making them more visually interesting.","Color correct your video to fix issues with white balance and exposure.","Add a feeling to your video with color grading in DaVinci Resolve 16","Apply visual effects to your videos to make them look better.","Edit green screen footage and, add backgrounds that actually look good."],"requirements":["Students will need to install DaVinci Resolve 16 on their computers to follow along. There are A LOT OF PRACTICE EXERCISES throughout this course with downloadable practice clips. We want you to follow along.","We teach this course using DaVinci Resolve 16 & 15. If you have a older or newer version, you should still be able to learn with this course.","For Windows users, Windows 10 is needed. A computer with at least 16GB RAM, dedicated GPU and a fast Processor is recommended."],"description":"<p><strong>Start editing your video professionally with Blackmagic Design's DaVinci Resolve 16!</strong></p><p>If you are looking for a free video editing application that will allow you to edit videos however you want them, DaVinci is the best answer. DaVinci Resolve&nbsp;16 is used by amateur and professional video editors&nbsp;across the world for every type of production from business &amp; marketing videos, music videos to documentaries, feature films. This full course is the best way to jump right in and start editing.</p><p><strong>Make videos the way you imagine them!</strong></p><p>Practice editing while you learn. This course includes practice video files so you can follow along and&nbsp;<em>actually learn by doing.</em></p><p>We'll be teaching the course using the DaVinci Resolve 16 &amp; DaVinci Resolve 15 versions, but if you have a previous version,&nbsp;or even a newer version,&nbsp;you can still learn to edit with this course.</p><p><strong>What makes us qualified to teach you?</strong></p><p>The lead instructor for this course, Kashif A. has partnered with Phil Ebiner of Video School Online to put together this DaVinci Resolve 16 masterclass. Kashif is a best-selling instructor of top-rated courses that get great reviews such as:</p><p><em>An incredible learning experience. The instructor is very clear and easily understood. - Walter Simmons</em></p><p><em>Teaching by an expert teacher. - Abdulkadir Cabuğa</em></p><p><em>Excellent! I couldn't ask for a better tutorial on whiteboard animations. The course is very thorough, and provides enough practice activities to apply the skills.&nbsp;-&nbsp;<br>Shamuel</em></p><p><strong>Our Promise to You</strong></p><p>We'll be here for you every step of the way. If you have any questions about the course content or anything related to this topic, you can always post a question in the course or send us a direct message.&nbsp;</p><p><strong>What is this DaVinci Resolve 16&nbsp;course all about?</strong></p><p>In this complete guide to DaVinci Resolve 16&nbsp;video editing course, you'll not only learn all of the editing tools available in DaVinci Resolve 16, but also how to edit with the mindset of a professional editor.</p><p><strong>This course will cover everything you need to know to start video editing, including:</strong></p><ul><li><p><strong>Starting a project</strong></p></li><li><p><strong>Editing your videos</strong></p></li><li><p><strong>Adding video and audio transitions</strong></p></li><li><p><strong>Adding professional and modern titles (even some with motion)</strong></p></li><li><p><strong>Improving audio and finding great free music for your projects</strong></p></li><li><p><strong>Correcting and grading the color of your video to give it a great style</strong></p></li><li><p><strong>Adding visual effects to your projects</strong></p></li><li><p><strong>Editing green screen (chroma key) footage</strong></p></li><li><p><strong>Exporting your video for high-quality playback on any device</strong></p></li><li><p><strong>Advanced efficiency tips</strong></p></li><li><p><strong>So much more!</strong></p></li></ul><p><strong>BONUS 1: As a bonus, you'll receive supplemental video and audio clips to practice with while I teach you with.</strong></p><p><strong>BONUS&nbsp;2: Moreover, you will get access to more than 3 hours of tutorials on how to create whiteboard animation videos in Videoscribe.</strong></p><p>By the end of this course, your confidence as a video editor will soar, and&nbsp;you'll have a thorough understanding of how to use DaVinci&nbsp;Resolve 16&nbsp;for fun or as a career opportunity.</p><p><strong>Go ahead and click the enroll button, and we'll see you in lesson 1!</strong></p><p>Cheers,<br>Phil &amp; Kashif</p>","suitableLearners":["You are a video creator (or want to make videos), and are wanting to edit videos with THE BEST FREE video editing application, i.e.  DaVinci Resolve 16","You might know how to edit with Final Cut, iMovie, Sony Vegas, Premiere Pro, Windows Movie Maker, Camtasia, Screenflow, etc. But you want to transition to editing with DaVinci Resolve 16","You are a complete beginner who has never opened  DaVinci Resolve (or have never learned how to use it properly).","You have played around with DaVinci Resolve 16, but need some help becoming a more efficient editor."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-03-17T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-03-20T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e82f49c9b04f3f624d77f"],"topics":[],"reviews":[],"meta":{"ratingCount":2314,"studentCount":85629,"avgRatingScore":4.445697,"contentVideoLength":33379},"basicInfo":{"udemyCourseId":3176930,"slug":"learning-solidworks-for-students-engineers-and-designers","title":"Learning SOLIDWORKS : For Students, Engineers, and Designers","subtitle":"For Basic and Intermediate Users","image":"https://img-c.udemycdn.com/course/240x135/3176930_53ae_2.jpg","price":687970,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["The students will learn the basic tools of Solidworks. Also they will get a thorough knowledge of Sketch, Part, Assembly, and Surface environments of Solidworks."],"requirements":["This course starts teaching you from scratch so there are no prerequisites."],"description":"<p><strong>SOLIDWORKS</strong> is a very productive 3D CAD software tool. It helps to design various products and services, testing them in very cost effective way like Model and prototype testing as you learned earlier in engineering degree class. </p><p>The Solidworks have wide range of applications in industries such as</p><ul><li><p>Aerospace</p></li><li><p>Defense</p></li><li><p>Automotive</p></li><li><p>Transportation</p></li><li><p>Machinery</p></li><li><p>Heavy Equipment</p></li><li><p>Consumer products</p></li><li><p>Mold &amp; Tools design</p></li><li><p>Electronics</p></li><li><p>Sheet metal work</p></li><li><p>Process Plant</p></li><li><p>Energy conservation</p></li><li><p>Construction</p></li><li><p>Medical tools</p></li><li><p>Product design and other engineering services.</p></li></ul><p>This course will help you in understanding and learning the basic and advanced tools of the software. You will get a thorough knowledge and hands on experience on Sketch, Part, Assembly and Surface Environments of SOLIDWORKS.</p>","suitableLearners":["Students, Engineers, Diploma Holders, CAD Designers, and Product Engineers."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2020-07-13T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2020-07-16T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e82f49c9b04f3f624d77f"],"topics":[],"reviews":[],"meta":{"ratingCount":2275,"studentCount":30047,"avgRatingScore":3.9946427,"contentVideoLength":48763},"basicInfo":{"udemyCourseId":55577,"slug":"mastering-adobe-photoshop-cc","title":"Mastering Adobe Photoshop CC","subtitle":"Take Your Creative Skills to The Next Level with this Adobe Photoshop CC Tutorial. Taught By Leading Photoshop Trainer","image":"https://img-c.udemycdn.com/course/240x135/55577_e321_7.jpg","price":1146770,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["Learn How To Master Photoshop CC","Take Your Creativity To The Next Level","Practical real-life lessons that are essential for the creative professional.","Complete working files for you to follow along at your own pace."],"requirements":["PC or Mac"],"description":"<p style=\"\">  \tIn this Adobe Photoshop CC training course from Infinite Skills, you will learn how to use the worlds most popular graphics and photo editing software. This training is designed for the absolute beginner, and you will learn Photoshop from the ground up, with no prior experience required.  </p>  <p style=\"\">  \t<br style=\"\">  \tThis training course breaks down the features and tools of Photoshop CC into easily understood parts, increasing your ability to understand and retain the information. You will learn how to: organize your files using Adobe Bridge, work with Camera Raw images, create and manage color in an image, utilize layers in Photoshop and work with filters. Andy shows you how to use tools such as dodge and burn, the magic wand, brushes, cloning and healing, and even Type in Photoshop. With almost 13 hours of instruction in this Photoshop CC tutorial, you will learn more than can be possibly listed here!<br style=\"\">  \t<br style=\"\">  \tBy the time you have completed this video based training for Adobe Photoshop CC, you will be familiar with the tools available to you in this graphics editing and creation software, and how to apply them to your own projects. Working files are included, allowing you to follow along with the author throughout the lessons.  </p>","suitableLearners":["Creative professionals who need to build a solid understanding of working with Adobe Photoshop in a creative environment whether they wish to output to print, web or video.","Beginners to Photoshop who wish to learn the fundamentals of digital image editing, manipulation and correction.","Photographers who want to gain the skills to alter, enhance and correct photographs. Essential for Photographers who prefer to work in the RAW image format."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2017-01-09T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2017-01-12T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e82f49c9b04f3f624d77f"],"topics":[],"reviews":[],"meta":{"ratingCount":2257,"studentCount":42550,"avgRatingScore":4.396513,"contentVideoLength":134195},"basicInfo":{"udemyCourseId":697570,"slug":"adobe-photoshop-cc-essentials-photoshop-masterclass","title":"Adobe Photoshop CC Essentials | Photoshop Masterclass","subtitle":"This Adobe Photoshop masterclass will teach you Photoshop retouching + photo editing. Bonus: 7 Photoshop courses in 1.","image":"https://img-c.udemycdn.com/course/240x135/697570_8598_10.jpg","price":1146770,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["New, Photoshop tutorials added every month.  Your Photoshop learning never stops!","33+ hours of Photoshop tutorials (recorded at 1080HD) already included - for both beginners and advanced users!","Photoshop - Learn how to edit like a pro.  You'll learn how to use ALL retouching tools for awesome photos.","Photoshop Layers - learn how to use layers and take your creativity to the next level","Pro tips for a fast productive workflow","How to use Adjustment Layers & Masks to edit like a pro and be more creative","Adobe Camera Raw - everything you need to know to edit your photos like a pro","How to be more productive - a must for a fast and productive workflow","Photoshop basics - a solid foundation for your journey with Photoshop CC","How to use Adobe Bridge to organize and streamline your workflow","Understand the fundamentals of Photoshop","Understanding color in Photoshop - a must for a fast and productive workflow","33+ Hours of Photoshop tutorials recorded at 1080HD!","How to add Photoshop  Layer Styles to add that extra touch of creativity","Learn about Blending Modes and how to use them to take your creativity to the next level","How to create vectors in Photoshop","Learn how to Clone + Heal to master retouching","Learn how to crop, straighten and adjust for perspective","Learn how to convert your images to B&W like a true artist","Learn all about Photoshop filters, how to use and apply","Learn how to make your own Photoshop actions","Learn how to use 2 pro Photoshop editing tools;  Curves & Levels.","Learn all about Photoshop brushes to help you master your editing.  Plus, creative techniques too.","Learn all about how to use Typography with Photoshop","Learn how to make Selections to fine-tune your editing","Advanced Web Design Project - for Photoshop"],"requirements":["Any version of Adobe Photoshop, preferably the CC (Creative Cloud) version.","No prior knowledge or experience with Photoshop is required"],"description":"<p>Hello! </p><p>My name is Chris Parker and I’m a <strong>photographer and graphic designer that has been using Photoshop professionally since 1991</strong>. Yes, I’m that old. But, that just means I have a lot of pro experience to share with you.</p><p>I’ve also been teaching other creative artists on how to use Photoshop for the last 10+ years.</p><p><br></p><p>This course includes 7 Photoshop courses in 1!&nbsp; Learn Photoshop retouching, image editing, portrait editing, portrait retouching, RAW retouching, JPG retouching, photo editing, special effects and more.</p><p><br></p><p><em>Check out what a recent student had to say about this Photoshop course…</em></p><p><br></p><p><em>“Chris is obviously very much in love with what he does. This is equally important as knowing stuff and being able to teach stuff, in my opinion. I am 100% satisfied with this course. He responds to questions within a day! And he obviously cares about what his students think. I totally recommend this course for beginners. He covers everything and he seems to know everything about photoshop.”</em></p><p><strong>~ Busra</strong></p><p><br></p><p>…and another…</p><p><br></p><p><em>“A heart felt thanks to Chris Parker for such a comprehensive Adobe Photoshop course. Highly recommend course for every photographer &amp; graphic designer to become more creative and productive.”</em></p><p><strong>~ Hassan</strong></p><p><br></p><p>…and another…</p><p><br></p><p><em>“I have already done several courses with Chris and I think he is a great teaching professional. To be a good teacher, not only do you need high technical knowledge, but you also have to know how to communicate it to the students.</em></p><p><em>Also, in my case, the English language is not my native language, I appreciate very much that Chris speaks slowly and with a \"neutral\" accent, which allows me not to have to \"rewind\" because I have not understood the sentence in English. Thanks, Chris.”</em></p><p><strong>~ Juan</strong></p><p><br></p><p>*********</p><p><br>So, I have a question or two for you. <strong>Are you new to Photoshop and/or struggling to learn Photoshop on your own?</strong></p><p>Then, <em>this course is perfect for you.</em></p><p>In the beginning you’ll learn the basics of Photoshop and as you work your way through the course we’ll cover more advanced Photoshop projects.</p><p>You can then take <strong>your new Photoshop skills and begin getting paid for it!</strong></p><p>How?</p><p>Either apply your knowledge to your own images for <em>your photographic studio</em> or <em>take on freelance work</em> for editing, re-touching, color correction, and even graphic design (we’ll cover graphic design projects later in the course: how to use/add text, create logos, web design and more).</p><p><strong>Yes</strong>, it is possible to learn everything you need to know about getting started with Photoshop in one course.</p><p>With over 33 hours of Photoshop content and 7 Photoshop courses in 1, with more tutorials being added on a regular basis, you can <strong>learn Photoshop essentials</strong> and advanced projects in this 1 Photoshop course.</p><p>This Photoshop course is perfect for <em>both photographers and graphic designers</em>.</p><p><br>******</p><p>Oh, and this course was designed for beginners in mind. You do not need any previous knowledge of Photoshop, photography or graphic design.</p><p>******<br></p><p><em>“I love how clear and easy this is to follow along. I feel like I am learning so much, and I am only part way through the class. I definitely recommend this if you want to learn Photoshop, and improve your workflow with it!”</em></p><p><strong>~ Jeron</strong></p><p><br><em>“Great job. Clearly explains the details in a way you can follow and understand. Good response to questions. Photoshop has so much to offer it takes somebody who can really organize the flow and the delivery and Chris does a wonderful job. Highly recommended.”</em></p><p><strong>~ Chuck</strong></p><p><br></p><p><em>“I love this course! I'm not even finished and I've already learned so much! Chris Parker speaks clearly and zooms in to show you where he's at. I appreciate this a lot. Can't wait to create another book cover or create a fun family picture with my new skills! Thanks for doing such a great job, Chris!”</em></p><p><strong>~ Pixie</strong></p><p>*********</p><p><br></p><p><strong>Here is a complete list of everything</strong> you’ll learn in this Photoshop course.</p><p><br></p><p><strong><em>Section 1:</em></strong><em> Photoshop Crash Course for Beginners!</em></p><p>Here you’ll download all course resources: <strong><em>photo files and the exclusive Photoshop Essentials Guide.</em></strong></p><p>The <em>Photoshop Essentials Guide </em>is designed to be used with this Photoshop course. Print it out and use it to take notes. Plus, each lecture is summarized in the guide for easy reference when offline.<br></p><p>Throughout the remainder of this section you’ll learn key essentials all Photoshop users should know…</p><ul><li><p>How to use the Home Screen</p></li><li><p>How to create new files</p></li><li><p>How to use and setup the Photoshop interface</p></li><li><p>How to open your images (there are several ways to do so)</p></li><li><p>How to work with multiple files that are open at once</p></li><li><p>How to save and export your files</p></li></ul><p><br></p><p><strong><em>Section 2:</em></strong><em> Quick Start Photoshop for Image Editing</em></p><p>Learn the 3 most requested things Photoshop beginners want to know…</p><ul><li><p>How to make your images “POP”</p></li><li><p>How to retouch your photos in Photoshop</p></li><li><p>How to re-size and save your images for social media</p></li></ul><p><br></p><p><strong><em>Section 3: </em></strong><em>Photoshop Course 2: Photoshop Layers: What They Are &amp; How To Use Them</em></p><p>You’ll learn all about layers in the “digital world” AND the “real world”. Why?</p><p>Knowing how I used layers (before there were layers) will help you better understand how and why layers are an essential Photoshop skill.</p><p>Discover the 12 different types of Photoshop layers, an overview of the layers panel and much more.</p><p>Oh, and this is the beginning of the second Photoshop course. The first one was the first 2 sections: “crash course” + “quick start”.</p><p><br><strong><em>Section 4: </em></strong><em>How To Edit Your Photos, in Photoshop, Like a Pro!</em></p><p>In this section, you’ll learn the power of Photoshop Adjustment Layers (and what they are and how to use them).</p><p><br></p><p><strong><em>Section 5:</em></strong><em> How to Maximize Color in Photoshop</em></p><p>Understanding the color of light, color in general and how to manage it in Photoshop is critical for getting the results you want.</p><p>Learn how to “see” color and pro tips for managing color.</p><p><br></p><p><strong><em>Section 6: </em></strong><em>How to Edit RAW Files In Photoshop</em></p><p>Learn the difference between RAW &amp; JPG and which one is better (and why).</p><p><br></p><p><strong><em>Section 7: </em></strong><em>Image Processing &amp; a Photoshop Workflow</em></p><p>You’ll learn my thoughts on processing and you’ll learn from my own personal workflow. The same workflow I’ve used on millions of edits.</p><p><br></p><p><strong><em>Section 8: </em></strong><em>How To Use Photoshop Adobe Camera Raw plugin… Or Also Known As: ACR</em></p><p>Learn the ins-and-outs of editing your RAW (and jpg if you prefer) files in ACR.</p><p>You’ll learn all of the following</p><ul><li><p>White Balance, what it is and how to adjust it (properly)</p></li><li><p>a lesson on the Histogram and why it’s important to use before and during editing</p></li><li><p>a quick overview of the Photoshop ACR interface</p></li><li><p>How to make adjustments to improve the dynamic range of your photos</p></li><li><p>How to use the power of Tone Curves to improve your photos</p></li><li><p>How to sharpen your photos (properly)</p></li><li><p>How to use the HLS + Color for editing your images</p></li><li><p>How to use the lens correction to fix distortions</p></li><li><p>How to add a vignette, grain and use the de-haze tool</p></li><li><p>How crop &amp; straighten your photos in Photoshop ACR</p></li><li><p>How to remove spots in ACR</p></li><li><p>How to use the graduated filters to improve your photos</p></li><li><p>How to use the target adjustment tool to precisely control your edits</p></li><li><p>How to merge multiple images for an HDR effect</p></li><li><p>How to merge multiple images to create a panoramic</p></li><li><p>How to remove “red eye” (and pet eye) in ACR</p></li></ul><p><br><strong><em>Section 9:</em></strong><em> How to Crop, Straighten and Fix Perspective in Photoshop</em></p><p>Although you learned how to crop your photos in ACR, you’ll learn how to do so directly in Photoshop.</p><p>Plus, learn how to straighten and fix perspective issues with Photoshop.</p><p><br></p><p><strong><em>Section 10: </em></strong><em>How to Convert Color Images to B&amp;W</em><br>First, you’ll learn 3 ways NOT to convert your images into B&amp;W.</p><p>Then, you’ll learn how the pro’s convert to B&amp;W for full creative control.</p><p><br><strong><em>Section 11: </em></strong><em>How to Precisely Edit Your Photos in Photoshop</em></p><p>You’ll now learn some additional ways to edit your images, like a pro.</p><p><br></p><ul><li><p>Here are a few things you’ll learn in this section…</p></li><li><p>Learn what the dodge, burn and sponge tool are used for</p></li><li><p>How to use the dodge and burn tool to edit your images</p></li><li><p>How to use the sponge tool to edit your images</p></li><li><p>How to use the dodge and burn tool with blending modes</p></li><li><p>How to use the dodge and burn tool with gradients</p></li></ul><p><br><strong><em>Section 12:</em></strong><em> How to Use the Tone Curve in Photoshop</em></p><p>We’ll expand on your knowledge of the tone curve tool (based on what you learned in ACR first). Learn how to use it directly in Photoshop and you’ll learn some basic color corrections that can be done with the curves tool.</p><p><br></p><p><strong><em>Section 13:</em></strong><em> How to Use the Levels Tool in Photoshop</em></p><p>You’ll learn how to use the Levels tool to edit your photos. We’ll start with the basics and then you’ll learn how to add contrast with it.</p><p><br></p><p><strong><em>Section 14:</em></strong><em> How to Use Photoshops Stamp Tool</em></p><p>We’ll start with a quick overview. Then, you’ll learn how to use the stamp tool to edit your photos.</p><p><br></p><p><strong><em>Section 15: </em></strong><em>How to Use the Healing Tools in Photoshop</em></p><p>The Heal Tool is a powerful tool all retouchers should learn how to master. There are several tools within the “Heal” category that can be used for a variety of retouching challenges.</p><p>You’ll learn about each and when/why to use it for specific retouching projects.</p><p><br><strong><em>Section 16: </em></strong><em>How to Use the Select Tools in Photoshop</em></p><p>“Selecting”, in Photoshop, is another one of those skillsets you’ll need to master in order to fulfill your creative vision. There’s a lot of selection tools to get the job done.</p><p>You’ll learn about all of them and how to use them. Including…</p><ul><li><p>How to use the Marquee Selection tool</p></li><li><p>How to use the Lasso tool</p></li><li><p>How to use the Magic Wand tool</p></li><li><p>How to use the Quick Mask mode</p></li><li><p>How to use a Mask selection</p></li><li><p>How to use the Content Aware Fill tool</p></li><li><p>How to use the Color Range tool</p></li><li><p>How to use the Select Subject tool</p></li><li><p>Take your knowledge, and the provided photo, to make a selection of an outfit and change the color</p></li><li><p>Plus, learn advanced selection techniques to “select” and edit your photos</p></li></ul><p><br></p><p><strong><em>Section 17: </em></strong><em>How to Use Blending Modes, in Photoshop, For Creative Edits</em></p><p>Blending Modes are another part of “layers”. They can be used for creative editing effects not possible with other tools.</p><p>First, we’ll start off with the basics of blending modes and how they work.</p><p>Then, we’ll cover each group of blending modes and learn what type of editing effects to expect for your artwork/photos.</p><p><br><strong><em>Section 18: </em></strong><em>How to Use Photoshop Filters For More Creative Edits</em></p><p>Take your creativity to the next level with Photoshop filters. Learn what they are, where they are and how to use them for your creative vision.</p><p><br></p><p><strong><em>Section 19: </em></strong><em>Learn Additional Photoshop Layer Tips: for Graphic Designers</em></p><p>This section is focused on layer skills all graphic designers should know!</p><ul><li><p>How to align layers</p></li><li><p>How to stack, copy + delete layers</p></li><li><p>How to organize your layers, like a pro</p></li></ul><p><br></p><p><strong><em>Section 20: </em></strong><em>Learn How to Use Photoshop Brushes</em></p><p>All creative artists should know how to use brushes in Photoshop. They are essential for editing, drawing, painting, design and more.</p><p>First, you’ll learn the basics of the brush tool. Then…</p><ul><li><p>How to adjust brush options</p></li><li><p>How to create a custom logo brush</p></li><li><p>Learn the difference between brushes vs. the pencil</p></li><li><p>How to use the color replacement tool</p></li><li><p>How to use the “history” brush</p></li><li><p>and more tips along the way</p></li></ul><p><br><strong><em>Section 21:</em></strong><em> Learn How to Output Your Files From Photoshop</em></p><p>Once you’ve completed your creative masterpiece it’s time to share it with the world! Learn about different file formats, saving and more.</p><p><br></p><p><strong><em>Section 22:</em></strong><em> How to Use the Eraser Tool in Photoshop</em></p><p>Sometimes you just need to get rid of something, fast. Introducing the Eraser tool, how to use it to remove backgrounds and more.</p><p><br></p><p><strong><em>Section 23: </em></strong><em>How to Use the Frame Tool in Photoshop</em></p><p>This new Photoshop frame tool is something I desired during my 30 year career as a graphic designer. It’s an awesome new tool all graphic designers will want in their toolbox.</p><p>Learn what it is and how to use it.</p><p><br></p><p><strong><em>Section 24: </em></strong><em>How to Use the New Content Aware Fill Tool in Photoshop</em></p><p>Another new awesome Photoshop tool. This tool is intelligent and will make a breeze at retouching your photos. Learn what it is and how to use it to retouch your photos.</p><p><br></p><p><strong><em>Section 25:</em></strong><em> How To Be More Productive in Photoshop</em></p><p>Now that you know the basics of Photoshop it’s time to improve your productivity. Some of this stuff is boring. However, it’s imperative to a fast and productive workflow. Especially for working professionals where time is money.</p><ul><li><p>How to adjust the Photoshop preferences for optimal performance</p></li><li><p>How to adjust Photoshop color preferences for consistent results</p></li><li><p>How to adjust menus based on your own specific requirements</p></li><li><p>How to save 1 hour for every 8 hours worked!</p></li><li><p>How to use the zoom + hand tools like a pro</p></li><li><p>and much more</p></li></ul><p><br></p><p><strong><em>Section 26:</em></strong><em> How to Use Adobe Photoshop Bridge to Manage Your Digital Assets</em></p><p>Adobe Bridge is a free plugin included with Photoshop. You can use it as a file manager to organize, search, add metadata and more…</p><ul><li><p>You’ll learn the basics of Bridge</p></li><li><p>How to adjust the Bridge preferences for optimal performance</p></li><li><p>How to adjust the Bridge workspace</p></li><li><p>How to use favorites + collections for organizing your files</p></li><li><p>How to improve your organization with keywords, ratings and labels</p></li><li><p>How to quickly find any photo (providing you did some of the above) with search + filter</p></li><li><p>How to add copyright metadata to your files (and more)</p></li><li><p>Plus, my personal workflow with Adobe Bridge</p></li></ul><p><br></p><p><strong><em>Section 27: </em></strong><em>How to Use Photoshop Actions</em></p><p>Photoshop actions are another powerful tool for helping you streamline your workflow.</p><p>Learn how to record specific steps you take to edit your photos and save it (as an action) to be re-used on other photos.</p><p><br></p><p><strong><em>Section 28:</em></strong><em> Photoshop Course 3: Light Effects</em></p><p>This Photoshop course (included for free) provides valuable lessons on <strong>how to use 5 awesome Photoshop tools that will allow you to</strong>; <em>add light, enhance existing light, enhance and add color to your sunsets and sunrises, create lens leaks, add lens flare and much more.</em></p><p>Included with this course are the images used in each lesson. Use them to follow along as you learn! This is a great way to increase the learning process. Plus, <strong>submit your practice files for feedback!</strong></p><p>First, <strong>you'll learn about the 5 tools that are used throughout the course</strong>; <em>Adjustment Layers, Adjustment Layer Masks, Curves, Levels &amp; Gradients</em>.</p><p>Then, you will be able to confidently use them while watching the lessons. By the time you're done with the course &amp; practice files, <strong>you'll be able to achieve the same look on your own photos.</strong></p><p>Each lighting effect is taught in <strong>bite-size, step-by-step lessons</strong> to better grasp each step of the process.</p><p>You will also see how different Blend Modes effect the final results, how to use opacity, keyboard shortcuts and much more.</p><p>A comprehensive resource file is included that has all of the keyboard shortcuts used throughout the lessons. And, each video will display the keyboard shortcut used at that time!</p><p><br><strong><em>Section 29: </em></strong><em>Photoshop Course 4: Zombie Apocalypse</em></p><p>In this course you’ll learn all the tools I use to create custom Zombie’s, in Photoshop, from ordinary portraits. Plus, you’ll also receive my Zombie Apocalypse Photoshop action (includes 3 versions) that will easily and quickly transform your ordinary portrait into a Zombie… all in under 2 minutes!<br></p><p>Once you know how to create a Zombie, from the Photoshop action, I’ll then walk you through all the different tools, tips and techniques that I use to create custom Zombie portraits.</p><p>First, you'll install the <strong>3 Zombie Photoshop actions, 20+ skin textures and 10+ blood brushes that come with this course</strong> and then you'll run the Photoshop action. I’ll explain what needs to be done for best results and additional tips.</p><p>Once you know the basics, <em>you’ll be able to transform your ordinary portrait, into a Zombie, in 2 minutes or less.</em></p><p>Then <strong>you’ll begin learning advanced techniques for customizing your Zombie</strong> to fulfill your creative vision. This course has been <em>structured for all levels of Photoshop users, from beginners to more experienced users</em>.</p><p>Plus, bite-size (each lesson is around 5 - 6 minutes) detailed explanations and Photoshop keyboard shortcuts are included for you as well. All keyboard shortcuts are displayed, throughout the tutorials, for easy and quick reference.</p><p>Some of the tools <em>you’ll learn throughout the course will include</em>…</p><ol><li><p>the Free Transform Tool</p></li><li><p>Layer Styles</p></li><li><p>Blending Modes</p></li><li><p>Layer Masks </p></li><li><p>…and much more</p></li></ol><p><strong>Each tutorial is jam packed with shortcuts, tips and techniques for creating one-of-a-kind Zombies!</strong> Plus, as an <em>extra bonus</em>, <em>you'll also receive 20+ additional wound overlays for customizing your Zombies</em>. This includes skin lesions, open wounds, bullet holes and more. You’ll learn how to add them to your Zombie portraits and customize for a “natural” look.</p><p>Once you’ve completed this course you’ll be able to easily and quickly create gory Zombie portraits your friends and/or clients will be <strong>DYING</strong> for.</p><p><br><strong><em>Section 30: </em></strong><em>Photoshop Course 5: How to Transform Photos With Fall Colors</em></p><p>Hello and welcome to my Photoshop Fall Edits for Outdoor Portraits &amp; Landscapes!</p><p>In this Photoshop course I share how to easily and quickly transform ordinary, boring, green foliage into beautiful, vibrant and colorful Fall colors.</p><p>It's super easy. So easy, you can could create this transformation within a couple of minutes.</p><p>So, the question is, why does it take over an hour to explain? Well, I'm sharing more than how to achieve this creative edit.</p><p>Not only do I share the fundamentals of the tools being used... like layers, layer masks, blending modes, ACR and more... but, I'm also going to share my 3 step editing workflow! This is the same workflow I use to edit hundreds of images PER hour!</p><p>As a professional photographer, it's imperative to spend less time in front of the computer and have more time for more clients. That doesn't mean we cut corners and ignore the creative process. Instead, we prioritize with the end in mind. You'll learn my basic premise for editing in general and exactly where your editing should start... Hint: it's not in Photoshop.</p><p><br><strong><em>Section 31: </em></strong><em>Photoshop Course 6: Cinematic Edits</em></p><p>Hello and welcome to my <strong>Photoshop Cinematic Photography Effects</strong> course!</p><p>Have you ever wondered <strong>how Hollywood creates those stunning, cinematic colors </strong>and wished you could apply to your photos? Well, wonder no more. This course will teach you how to add Cinematic color style effects to your still photography - all in Photoshop!</p><p><strong>You will learn how easy it is to apply those Cinematic effects directly in Photoshop</strong>. No filters, plugins or other tools required. Everything can be done directly in Photoshop within minutes.</p><p>Plus,<strong> I'll share with you my favorite keyboard shortcuts, editing process and more to streamline your Photoshop workflow</strong>.</p><p>You'll be amazed <strong>how easy it is</strong> to create this trendy photo effect in Photoshop. You'll also learn what Color Grading is and how to apply to your images.</p><p><strong>First</strong>, you'll start of learning all the basics in the, well, Basics section. :)</p><p>This includes learning all about the Curves tool (how to use, tips and more), how to use Adjustment Layers (plus Masks) to streamline your workflow, an awesome (free) tool for finding complimentary colors (which are important for achieving the Cinematic style), how to color correct an image in 5 seconds and much more.</p><p>Once you've mastered the basics, you'll move on to learn <strong>3 different ways to create the Cinematic style</strong> within Photoshop.</p><p><strong>Want feedback?</strong></p><p>Projects include the same photos used in the course. This will give you an opportunity to follow along, practice with and upload <strong>your Cinematic edits for review</strong> either by me and/or other photographers in the community.</p><p><br><strong><em>Section 32 - 50: </em></strong><em>Photoshop Course 7: Advanced Photoshop Projects</em></p><p>This and the following sections include additional Photoshop advanced projects and is considered another course in-and-of-itself. Includes projects for photographers and graphic designers.</p><p>Here are a few of the things you’ll learn…</p><p><strong><em>photography…</em></strong></p><ul><li><p>how to control depth-of-field</p></li><li><p>how to add motion blur</p></li><li><p>landscape editing workflow</p></li><li><p>high school portrait editing workflow</p></li><li><p>how to replace skies with new clouds</p></li><li><p>how to add snow to your winter images</p></li><li><p>how to blur the background</p></li><li><p>how to create the Stranger Things “Shadow” Monster</p></li><li><p>how to transform a portrait into vector art</p></li><li><p>how to transform a photo into a watercolor</p></li><li><p>how to create a half B&amp;W and half sepia toned image with a torn paper effect down the middle</p></li></ul><p><strong><em>graphic design…</em></strong></p><ul><li><p>how to add text to your documents</p></li><li><p>how to use layer styles for your creative vision</p></li><li><p>how to use vector paths and create shapes</p></li><li><p>how to design a website in Photoshop</p></li><li><p>how to create grungy/retro/3D text</p></li><li><p>how to create a modern/retro logo</p></li><li><p>how to create a web banner</p></li><li><p>7 tips for creating t-shirt designs in Photoshop</p></li><li><p>and much more pro tips along the way</p></li></ul><p><br></p><p>*********</p><p>“So far I'm really enjoying this course. I've been using Photoshop in hobby photography for about 10 years and thought it was time to check and see what I'm not using :) Chris's presentation is clear and precise and I'm learning tips and tricks that will definitely be useful. Looking forward to the rest of the course!”</p><p>~ Susan</p><p><br></p><p>“Amazing instructor with years of experience the instructor have giving lots of info on his tutorials, easy to follow step-by-step. I would recommend for those who are beginner and work your way up to become a pro in photoshop.</p><p>I have taken several courses and this course has taught me in depth learning Photoshop. 5 star for this Photoshop course. The best part after you have learn the basic, the instructor give us a project to follow along beside guiding us to successfully understanding on our tools and project,</p><p>I have managed to improve my skills. You just need to practice and keep practicing.</p><p>Finally I have manage to finish my own project and this Photoshop course have make me to keep crafting ideas and make my imagination come to next level. Thumb up..!!</p><p>~ Muhammad</p><p>*********<br></p><p>If you’ve read this far, thank you! Just a few more things (in case I forgot anything)…</p><ul><li><p>Photos are included to practice what you learn</p></li><li><p>The Photoshop Essentials Guide includes project details and some homework assignments</p></li><li><p>Feedback and critiques are provided if requested</p></li><li><p>Course is updated based on student demand/requests</p></li></ul><p>I think that covers everything (just like these Photoshop courses)! :)</p><p>Looking forward to helping you achieve your creative vision and improving your Photoshop skills. Can’t wait to see you on the inside.</p><p>Regards,</p><p>Chris Parker</p><p>Photoshop Guru, Pro Photographer + Graphic Designer</p><p><br></p>","suitableLearners":["Beginners to Adobe Photoshop CC","Photographers of all levels","Designers of all levels","Anyone who wants to learn the essentials of Photoshop"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-03-01T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-03-04T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e82f49c9b04f3f624d77f"],"topics":[],"reviews":[],"meta":{"ratingCount":2191,"studentCount":8875,"avgRatingScore":4.7513456,"contentVideoLength":12052},"basicInfo":{"udemyCourseId":2217006,"slug":"how-to-draw-cartoon-characters-in-procreate","title":"How to Draw Cartoon Characters In Procreate","subtitle":"Learn how to bring your cartoon characters to life using Procreate","image":"https://img-b.udemycdn.com/course/240x135/2217006_79cb_3.jpg","price":458570,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["The basics of drawing in Procreate on the iPad","The basics of cartooning from sketching to inking to coloring","How to use shapes to make your characters look different from each other and develop your own style","How to use faces and body launguage to convey emotion and personality"],"requirements":["An iPad with with the app Procreate","No experience needed just the desire to learn new skills and have fun"],"description":"<p>If you can draw a stick figure you can learn to draw cartoon characters. Most cartoons are made up of simple shapes and understanding how to put them all together to make something fun and interesting is easier than you think. </p><p>This course gets you drawing. I don't just want to explain the skills I want to to practice and learn the skills. We start with basic shapes and build upon that foundation. Creating different shape combinations to build our characters and then we talk about how to create clean line work so our characters look professional. Then we talk about how artist choose colors and how to enhance those colors to really make your character pop.</p><p><strong>Why Procreate?</strong> The best drawing app for the iPad is Procreate. procreate has been listed in the iPad’s top selling apps month after month and for good reason. It rivals many desktops apps for power and features. In this class we tackle Procreate to start drawing on the iPad.</p><p>Who is this for:</p><ul><li><p>People who want to improve their art but aren't sure where to start</p></li><li><p>Illustrators looking to learn some tips and trick using Procreate</p></li><li><p>People who love drawing and sketching and want to start doing it digitally</p></li></ul>","suitableLearners":["Beginner Procreate Users","Aspiring artists and Illustrators"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2019-02-18T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2019-02-21T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e82f49c9b04f3f624d77f"],"topics":[],"reviews":[],"meta":{"ratingCount":2186,"studentCount":15946,"avgRatingScore":4.7446866,"contentVideoLength":13551},"basicInfo":{"udemyCourseId":778548,"slug":"adobe-premiere-pro-cc-learn-video-editing-in-premiere-pro","title":"Adobe Premiere Pro CC: Learn Video Editing In Premiere Pro","subtitle":"Adobe Premiere Pro CC video editing for beginners: Edit footage,  audio, make titles & more using Adobe Premiere Pro CC","image":"https://img-c.udemycdn.com/course/240x135/778548_e583_7.jpg","price":1949670,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["The process to complete a video editing project start to finish","Use the many different Premiere Pro panel windows","Importing media & create custom sequence presets for different resolutions","File organization & workflows for efficient & professional video editing","Edit footage, images, music & audio together across multiple editing tracks","The basics of color correction and color grading","Create text titles, effects and lower third titles","How to speed up Premiere Pro CC with proxies to fix lag","Various video editing frame rates, resolutions & aspect ratios","Keyboard shortcuts to edit videos more efficiently","How to work with slow motion footage & how to speed ramp","How to get smooth and nice looking skin tones with color correction","How to use masks to create a mask wipe transition","Professional video editing terms & definitions","Finalize & export media using custom presets"],"requirements":["Download & install a free trial of Adobe Premiere Pro off of Adobe's website, or purchase a license from Adobe."],"description":"<p><strong>**Updated&nbsp;- New lessons &amp; Now includes footage, images &amp;&nbsp;music to download for editing practice**</strong></p><p><strong>Get started with Adobe Premiere Pro CC today and learn how to video edit!</strong></p><p><em>Over 12,300 students have enrolled in this class so far with more than 1,300 reviews and a rating of 4.5/5 stars!</em></p><p>This 3.5 hour course is an introduction into video editing using <strong>Adobe&nbsp;Premiere Pro CC</strong>. It will take you from the very beginning of opening Premiere Pro CC and learning the various panel windows to editing clips, performing audio work, color correction, creating sequence presets, titles, keyboard shortcuts, exporting and much more!</p><p><strong>This Adobe&nbsp;Premiere Pro CC For Beginners course Includes:</strong></p><ul><li><p><strong>3.5 hours of content covering a wide range of functions within Premiere Pro CC</strong></p></li><li><p><strong>Step by step instruction on how to import, setup projects and sequences, organize files, work with footage and audio, color correct, work with slow motion footage, fix laggy footage, create text titles, add effects, export media, and much more!</strong></p></li><li><p><strong>Several .PDF attachments to learn from</strong></p></li><li><p><strong>Downloadable footage and music to practice with</strong></p></li><li><p><strong>Questions and answers section where you can ask any questions you have!</strong></p></li></ul><p>Your instructor for this course is Will Bartlett. He has been professionally editing since 2004, and is the founder of an established video production company based out of Toronto. Over the years Will has edited well over 1000 projects for several hundred clients, and has trained over 100,000+ students across his 10+ video editing and motion graphics courses.</p><p>Our team will be available to answer any questions you may have, as well as help you with any issues you may come across while making your way through the course!</p><p>Even if you don’t have <strong>Adobe&nbsp;Premiere Pro CC</strong> you can still take advantage of this course by downloading a free&nbsp; trial from Adobe, off their website. All you need to do is create a free account with them, it only takes a couple minutes, and then you can downloading and start using Premiere Pro CC.</p><p><strong>Enroll today and get started with Premiere Pro CC, Adobe's professional video editing program to create engaging visual and audio stories!</strong></p>","suitableLearners":["This Premiere Pro video editing course is meant for beginners who want to learn how to edit. No prior video editing knowledge is required.","This course is also for people who may be already familiar with editing, but wants to make the switch to Premiere Pro.","This course is NOT for a professional Video Editor who already knows how to use Premiere Pro."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2020-12-29T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-01-01T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e82f49c9b04f3f624d77f"],"topics":[],"reviews":[],"meta":{"ratingCount":2158,"studentCount":15420,"avgRatingScore":4.5616064,"contentVideoLength":126343},"basicInfo":{"udemyCourseId":1347812,"slug":"gimp-210-made-easy-for-beginners-learn-gimp-from-a-pro","title":"GIMP 2.10 Made Easy for Beginners.  Learn GIMP from a pro!","subtitle":"Learn GIMP from a pro photographer.  Everything you need to know in 1 GIMP course for Linux, PC + MAC.","image":"https://img-c.udemycdn.com/course/240x135/1347812_3fb6_9.jpg","price":1146770,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["Learn how to install GIMP on a Linux, PC and/or a MAC","Learn how to edit your photos, like a pro, with GIMP","Learn how to process RAW files for GIMP","Learn what a Layer Mask is and how to use them in GIMP","Learn tips and techniques for editing images and creating graphics from a pro photographer (and graphic designer)","Learn what a Layer is and how to use them in GIMP","Learn how to configure the GIMP interface for increased productivity","Learn the different file types you can use in GIMP as well as GIMP's proprietary file format","Learn how to setup and use the History panel for streamlining your workflow","Learn how to save 1 hour for every 8 hours worked","Learn how to save files for the web, print, Photoshop and more","Learn what Blending Modes are and how to use them in GIMP","Learn about the 7 different Blending Mode groups and how to use them in GIMP","Learn all about the 4 main tools in GIMP; Selections, Paint, Transform and Color Tools","Learn how to use brushes in GIMP","Learn how to install pre-made brushes, from other artists, in GIMP","Learn how to create your own brushes in GIMP","Learn how to use Palettes & Presets to streamline your workflow","Learn the core differences between RAW and JPG files.","Learn how to create Color Tool Presets to streamline your workflow","Learn how to use the Color Balance Tool for editing your images","Learn how to use the Colorize Tool for editing your images","Learn how to use the Hue Saturation Tool for editing your images","Learn how to use the Brightness Contrast Tool for editing your images","Learn how to use the Levels Tool for editing your images","Learn how to read and utilize the Histogram to streamline your editing workflow","Learn how to use the Curves Tool for editing your images","Learn how to use the Threshold Tool for editing your images","Learn how to use the Posterize & Desaturate Tool for editing your images","Learn the difference between the Heal & Clone Tool","Learn how to use the Heal Tool for editing your images","Learn how to use the Clone Tool for editing your images","Learn how to use the Dodge & Burn Tool for editing your images","Learn the importance of the Selection Tools and how to use","Learn how to use the Free Select Tool","Learn how to use the Foreground Select Tool","Learn how to use the Fuzzy Select Tool","Learn how to use the Select by Color Tool","Learn how to use the Quick Mask Tool","Learn how to use the Path Tool","Learn how to use the Text Tool","Learn how to use the Patterns Tool","Learn how to use the Filter Tools","Learn how to create basic shapes in GIMP","Learn how to add photos to shapes","Learn my personal editing workflow for processing images","Learn by doing!  Project based lessons throughout the course","Learn how I edit JPG files from start to finish","Learn how I edit RAW files from start to finish","Learn how to add text along a path","Learn how to add an image to text","Learn how to create text out of grass","Learn how to add a reflection to your text","Learn how to make a superhero \"pop-out\" of an iMac screen","Learn how to add light to an image","Learn how to add smoke to an image"],"requirements":["Must have a Linux, PC or MAC operating system","A willingness to learn and take the time to do the included projects"],"description":"<p>THE GIMP course for photographers and graphic designers. Learn GIMP from a pro photographer. Everything you need to know in 1 GIMP course for Linux, PC + MAC.</p><p><strong><em>Why this GIMP course vs. others? </em></strong> </p><p>Well, I'll let the following students explain why you should choose this GIMP course...</p><p><br></p><p> <strong>David Cangiolosi </strong></p><p><em>\"Another GREAT course from Chris Parker !!! I was new to the photo editing part of photography, downloading (The FREE) GIMP and taking this course by Chris Parker was the right decision for me as a hobbyist photographer who does not need to pay a monthly fee for Photoshop. </em></p><p><em>Chris covers probably every aspect in this course I could use or ever would use. He teaches by examples that you can follow along to so you get the most out of each example or section of the course. I found it very helpful and enjoyed his style of teaching.\"</em></p><p><em>\"Extremely detailed and thorough, I am so far extremely positively impressed by the amount of information I am receiving and how nicely I can retain it due to a very friendly delivery method.\"</em></p><p><br></p><p><strong>James Eyrich</strong></p><p><em>\"This is an amazing course he goes through all the tools and explains it all so I can understand what is going on would recommend this course for anyone beginner or advanced something for everyone in here.\"</em></p><p><br></p><p><strong>Faletolu Roberts</strong></p><p><em>\"The step-by-step process of setting up your workspace and tools is so easy to follow. Knowing where exactly to look makes learning a new program less brain-numbing and fun so far.\"</em></p><p><br></p><p><strong>Khetile Mhlongo</strong><br><em>\"I am extremely happy with the course. I am learning more than just the basics. I am really learning how to make this program my own. I have already purchased another course from this tutor, and I am looking forward to that one too.\"</em></p><p><br><strong>Rachel Campbell</strong></p><p><em>\"I am still taking the course but can already tell the impact. I come from a Photoshop background but wanted an option that wasn't costing a monthly fee. I am surprised at how much can be done in GIMP but even more impressed with the instruction. I have never had anyone actually explain all the tools and options to this degree. </em></p><p><em>I feel way more knowledgeable and know I will continue to love the remaining lectures. **** not to mention I am already purchase another course planning on getting several other courses created by Chris**** So, worth every penny and more!\"</em></p><p><br></p><p> <strong>Jeremy Kinney</strong></p><p><em>\"I was able to go from nothing to a basic understanding and I've only done the first quarter of the course. It's been very helpful so far, and I'm excited to continue onward.\"</em></p><p><br></p><p><strong>Rex Graham</strong></p><p><em>\"To be honest, I have never done online lessons like this before, so I have no real reference. That said, I have learned more in this lesson than I have in hours of YouTube videos.</em></p><p><em>Great work so far.\"</em></p><p><br></p><p><strong>John Romero</strong></p><p><em>\"Instructor is very thorough and concise. Though I'm already familiar with GIMP, I've picked up at least one new tip or feature I was previously unaware of in practically every lesson.\"</em></p><p><br></p><p><strong>David Kiger</strong></p><p><em>\"I have taken a few courses on Gimp, and this is the most detailed step-by-step Gimp course I have seen so far. You don't rush through the lesson like in some courses. You take your time and talk clearly while making everything clear. Thank you for the wonderful course.\"</em></p><p><br></p><p>There are hundreds more testimonials just like these... but I think you get the idea... So, let's find out everything you'll learn from this GIMP course...</p><p><br></p><p><strong>First, </strong>this GIMP course is divided into two sections;</p><ol><li><p><strong>the Basics</strong>... &nbsp;A complete overview of all the tools in GIMP</p></li><li><p><strong>the Advanced GIMP projects</strong>. Learn by doing. Once you have the foundation from the first half of the course, you'll continue learning how to use GIMP <strong>by working on advanced GIMP projects</strong>.&nbsp;</p></li></ol><p><em>This GIMP 2.10 for beginners is designed for, well, beginners!</em></p><p><br></p><p><strong>&gt;&nbsp;the GIMP&nbsp;Basics</strong><br></p><p><strong>Section 1:</strong> Intro to the course + resources for download</p><p><strong>Section 2: </strong>learn how to install GIMP for Linux, Windows, and/or MAC</p><p><strong>Section 3:</strong> quick start guide for editing your images, re-sizing, and saving for social media</p><p><strong>Section 4:</strong> a quick look at the basics of GIMP. Including, but not limited to, setting up &amp; customizing your interface, creating new documents file formats, navigating around your document (pan + zoom), saving &amp; exporting your files, and more.</p><p><strong>Section 5: </strong>learn what layers are and how to use them, learn the four types of layers and four different ways to customize them, know what Layer Masks are and how to use for precise editing of your photos, learn what layer boundaries are, adjust them and why they're important</p><p><strong>Section 6: </strong>learn what adjustment layers are and whether or not you can use them in GIMP. They're essential for your photo editing.</p><p><br></p><p>Every lesson is created in short, bite-sized pieces to help you better retain the information, and each builds on the next.</p><p>1 of the most essential tools in GIMP is Layers. <strong>You'll learn all about Layers and how to work with them. </strong>Plus, <strong>you'll learn about another powerful type of layer; &nbsp;the Layer Mask</strong>. &nbsp;</p><p><em>Hint: a Layer Mask gives you the precision and control to apply edits exactly where you want them</em>. &nbsp;</p><p>Oh, these are so fun and awesome. I can't wait to share how to take advantage of Layers &amp; Layer masks in GIMP.</p><p>Another fun, creative and powerful tool (within GIMP) is Blending Modes. <strong>You'll learn about the seven distinct types of Blending Mode groups</strong> and how to use them to add creative flair to your artwork.</p><p><strong>You'll also learn about the four main tools in GIMP...</strong></p><ol><li><p>Selection Tools</p></li><li><p>Paint Tools</p></li><li><p>Transform Tools</p></li><li><p>Color Tools</p><p><br></p></li></ol><p>The Selection Tools are an integral part of your skill-set. <strong>You'll learn about the seven different types of selection tools</strong> to do your job of \"selecting\" that much easier. The selection tools are a big part of the advanced GIMP projects, and you'll want to learn the basics first (included!).</p><p><strong>You'll also learn all about the Paint Tools</strong> and how to use them to; add color, modify color, erase, clone, heal, and much more.</p><p>What about learning <strong>how to use the Transform tools</strong> to align graphics, move, rotate, scale, shear, and more? I got you covered there too! Check out the basic overviews of each tool and then master them with the advanced GIMP projects.</p><p>Next up; &nbsp;the Color Tools. <strong>Learn how to use these Color Tools</strong> to process and edit your photos like a pro. Learn from my 27+ years as a pro photographer.&nbsp;</p><p>Let's not forget about GIMP filters and Patterns. <strong>You'll learn how to use both</strong>! Learn how to download and install Patterns created by other artists. Plus, you'll learn how to apply the GIMP filters to enhance your creative artwork.</p><p><strong>&gt;&nbsp;the Advanced GIMP projects</strong></p><p>You'll&nbsp;learn how to create basic shapes in GIMP; rectangles and squares,&nbsp;free-form shapes, circles, and triangles too... oh my!</p><p>Learn my 3 step editing workflow I've used on hundreds of weddings and thousands of portrait sessions. How I use each of&nbsp;the Color Tools, how I use Levels and Curves, how I retouch with Clone and Heal, how I dodge and burn, and much more.</p><p>Then, we'll take your GIMP learning experience to a whole new level with the following projects;</p><p><br></p><ul><li><p>How to add text along a path</p></li><li><p>How to add an image to text</p></li><li><p>How to create a reflection of your text</p></li><li><p>How to make a SuperHero&nbsp;fly out of a monitor</p></li><li><p>How to add smoke to your image</p></li><li><p>How to separate a subject from the background (and save for the web)</p></li><li><p>and much more...</p></li></ul><p>What are you waiting for? Now is the best time to sign up for my complete GIMP course. Looking forward to sharing with you my photographic knowledge and how to use GIMP.</p><p>Chris Parker</p><p><br></p><p><br></p>","suitableLearners":["Anyone who wants to learn how to use GIMP to edit images","Anyone who want to learn how to use GIMP for creating text, shapes and other graphics"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-03-01T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-03-04T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e82f49c9b04f3f624d77f"],"topics":[],"reviews":[],"meta":{"ratingCount":2149,"studentCount":7543,"avgRatingScore":4.308045,"contentVideoLength":17079},"basicInfo":{"udemyCourseId":382714,"slug":"vsd-physical-design-flow","title":"VSD - Physical Design Flow","subtitle":"VLSI - Building a chip is like building a city!!","image":"https://img-c.udemycdn.com/course/240x135/382714_2a1b_2.jpg","price":1949670,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["Understand Industrial Physical Design Flow","Modify and Develop own Flow as per Specifications"],"requirements":["Basic Digital Design"],"description":"<p>The course is designed in the form of micro-videos, which delivers content in the form of Info-Graphics. It is designed for self-learning and will help to polish the Industrial skills in VLSI World. This course will cover end-to-end description from basic Device Physics to Chip Design.<br></p>\n\n<p>  \tWe have contributed anonymously to this website, just to share the part of knowledge learned all these years, with the students keen to learn the  basic concepts of the Chip Design. And also shared our industrial experience to give the technological exposure of current development in chip world...  </p>","suitableLearners":["Students looking for entry in VLSI World and explore new ways of solving problems"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2015-03-10T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2015-03-13T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e82f49c9b04f3f624d77f"],"topics":[],"reviews":[],"meta":{"ratingCount":2026,"studentCount":8960,"avgRatingScore":4.5313916,"contentVideoLength":14722},"basicInfo":{"udemyCourseId":1489540,"slug":"solidworks-become-a-certified-professional-today-cswp","title":"SOLIDWORKS: Become a Certified Professional Today (CSWP)","subtitle":"SOLIDWORKS Hands-on Training: Go from the Associate level to the Professional (CSWP) level today.","image":"https://img-c.udemycdn.com/course/240x135/1489540_5c19_3.jpg","price":2752570,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["Confidently list your SOLIDWORKS skills in your resume","Use SOLIDWORKS to design/draft your next innovation","Take, with confidence, the SOLIDWORKS Professional Certification test (CSWP)","Being able to self-learn new functions in SOLIDWORKS","Use SOLIDWORKS to create complex models"],"requirements":["You will need SOLIDWORKS 2015 or newer to open the models we provide throughout the course.","Basic Knowledge of SOLIDWORKS is required. The desire to learn and create awesome stuff is a plus.","This course is an advanced follow up of our previous courses \"SOLIDWORKS Course: Become a Certified Associate Today\". Taking the first course before this will give an advantage.","Microsoft Excel"],"description":"<p>This is a streamlined course to take you&nbsp;from knowing the basics about&nbsp;SOLIDWORKS to give you all the knowledge and skills needed to become a certified SOLIDWORKS Professional (CSWP). This course will&nbsp;enable you to, with confidence, use SOLIDWORKS to design&nbsp;complex&nbsp;innovations and draft complex models. After this course, you can proudly list your advanced&nbsp;SOLIDWORKS skills in your resume.<br></p><p>THIS COURSE IS NOT A SHORTCUT TO GET THE CERTIFICATE. We are following a learn-by-doing approach for you to truly master all the skills needed for the certification test.</p><p>*The screencasting&nbsp;for this course was done using SW 2017. However, you can fully follow the course and use the supplementary downloads if you are using SW&nbsp;2015 or newer.&nbsp;&nbsp;</p><p><strong>NOTE:</strong>&nbsp;This course can be considered as an advanced continuation of our previous best-selling SOLIDWORKS courses. The previous course takes you from nothing to the Associate Certification level (CSWA) while this course takes from the Associate Certification level (basic level)&nbsp;to the Professional&nbsp;Certification level (CSWP).&nbsp;</p><p>==================</p><p><strong>About this course:</strong></p><p>With this course, you will get:</p><ul><li><p>Full, free lifetime access to 51&nbsp;lectures (increasing over time).</p></li><li><p>All future extra lectures and upgrades will always be free.</p></li><li><p>Unconditional Udemy 30 days&nbsp;<strong>money-back guarantee&nbsp;</strong>- We are sure you would love the course though :)</p></li><li><p>Regular free bonus additions to increase your knowledge. - lots of fun topics!</p></li></ul><p>Today, you can start your journey to becoming a SOLIDWORKS professional starting from basic&nbsp;prior experience!</p><p>There is nothing extra to buy or pay for with the course. You will only need SOLIDWORKS&nbsp;2015 or a newer version. You will also need Microsoft excel.&nbsp;</p><p><strong>\n</strong></p><p><strong>Why our course?!</strong>\n</p><ul><li><p>Learn from the best, your instructor is the author of the book Learn SOLIDWORKS&nbsp;2020. </p></li><li><p>Have all your questions answered by experts in the course forum.</p></li><li><p>Get access to an exclusive students SOLIDWORKS&nbsp;community.</p></li><li><p>We have lots of experience teaching SOLIDWORKS. Our previous SOLIDWORKS&nbsp;courses are the best selling in Udemy with over 30,000 happy students.</p></li><li><p>We are following the learning-by-doing approach, which is proven the best for learning software like SOLIDWORKS.</p></li><li><p>We have&nbsp;<strong>enlarged the interface</strong>&nbsp;icons in our screencasts to make our videos more eye-friendly. We even enlarged the mouse cursor!</p></li><li><p>We use annotations in all our lectures for easier follow-up.</p></li><li><p>We made our videos short and concentrated on one or a few concepts&nbsp;to make them easier for reference. We also designed each lecture to be a stand-alone lecture.</p></li></ul><p><strong>You will learn:</strong></p><ul><li><p>How to use the advanced features Draft, Shell, Rib, and Features Mirroring.&nbsp;</p></li><li><p>How to use internationally defined standards to create holes and slots.&nbsp;&nbsp;</p></li><li><p>How to create a new Coordinate system and utilize it in Mass properties.&nbsp;</p></li><li><p>How to link dimensions in parts using equations.&nbsp;</p></li><li><p>How to create a part with more than one body (multi-body part)&nbsp;and how to take advantage of this approach.&nbsp;</p></li><li><p>How to specify features application to one body over another.&nbsp;</p></li><li><p>How to utilize&nbsp;Design Tables to create multiple configurations of the same model.&nbsp;</p></li><li><p>How to manually create model configurations, each with different applied features.&nbsp;</p></li><li><p>How to use the advanced mates Profile Center, Symmetric, Width, Path Mate, Linear/Linear coupler, and Distance &amp; Angle ranges.&nbsp;</p></li><li><p>How to link different dimensions in different parts using in-context features.&nbsp;</p></li><li><p>How to apply Assembly Features, and what is the design intent of doing that.&nbsp;</p></li><li><p>How to use collision and interference detection.&nbsp;&nbsp;</p></li><li><p>How to replace parts in an assembly and transfer all active mates.&nbsp;</p></li></ul><p>&nbsp;</p><p>Click the 'Add to Cart' button at the top right of the window... Every hour you delay is costing you great creations and skills :) </p><p>Yours in SOLIDWORKS&nbsp;Learning,</p><p>Tayseer &amp;&nbsp;The TforDesign Team</p>","suitableLearners":["Individuals intending to gain higher understanding and mastery of SOLIDWORKS","Individuals intending to take SOLIDWORKS Professional Certificate (CSWP)","Individuals wanting to get a better job via SOLIDWOKRS skills","Individuals wanting to list SOLIDWORKS skills in their resume","Designers, Engineers, Makers, and Hobbyist"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-01-02T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-01-05T00:00:00.000Z"},"promotions":{"discountPrice":389980,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e82f49c9b04f3f624d77f"],"topics":[],"reviews":[],"meta":{"ratingCount":1958,"studentCount":21907,"avgRatingScore":4.5710616,"contentVideoLength":41929},"basicInfo":{"udemyCourseId":71688,"slug":"adobe-illustrator-cc-tutorial-training-taught-by-experts","title":"Adobe Illustrator CC Tutorial - Training Taught By Experts","subtitle":"Learn the skills to become creative with  Adobe Illustrator CC. A practical hands-on tutorial for users of all levels","image":"https://img-c.udemycdn.com/course/240x135/71688_f3b1_9.jpg","price":1146770,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["Learn How To Become Creative With Adobe Illustrator CC"],"requirements":["PC or Mac"],"description":"<p>In this Adobe Illustrator CC training course, Infinite Skills  takes you through the the many tools and techniques that are available to you in this vector graphics software from Adobe. This tutorial is designed for beginners, and no previous Illustrator experience is required to get the most from this training.<br><br>The course  starts you off with a quick tour of the interface so that you are familiar with the location of the tools you will be shown in this video tutorial. You then jump right into using these tools, while learning how to control your interface and selecting and manipulating Illustrator objects. As you progress through the lessons, you will be taught how to work with shapes, fills and strokes, anchors and paths and how to manage vector shapes. You will work with type, add effects, learn to manage your design with layers, work with images and masks, and learn tips, tricks and techniques from the authors own experiences. Finally this video tutorial covers how to save and print your design depending on the intended final use of it.<br><br>Once you have completed this comprehensive overview of Adobe Illustrator CC, you will be comfortable with the tools available to you, and how you apply them to your own vector graphic projects. Working files are included in this computer based training course for Illustrator CC, allowing you to follow along with the author throughout the lessons.<br></p>","suitableLearners":["Graphic Designers, Web Designers, UI Developers"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2017-01-09T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2017-01-12T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e82f49c9b04f3f624d77f"],"topics":[],"reviews":[],"meta":{"ratingCount":1956,"studentCount":230135,"avgRatingScore":4.1345315,"contentVideoLength":15252},"basicInfo":{"udemyCourseId":2769314,"slug":"adobe-photoshop-2022-photo-editing","title":"Adobe Photoshop 2022 Photo Editing","subtitle":"Learn How to Edit Photos as we Learn all the Tools in Photoshop and then Finish out the Course with 3 Fun Projects","image":"https://img-c.udemycdn.com/course/240x135/2769314_30e9_2.jpg","price":1949670,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["Edit 3 Projects from Scratch","Edit Thumbnails","Edit Wallpapers","Photo Touchup on my Udemy Profile Picture","Learn Photoshop 2022 Tools","Move Tool","Rectangle Marquee Tool","Lasso Tool","Object Selection Tool","Crop Tool","Frame Tool","Eye Dropper Tool","Spot Healing Brush","Brush Tool","Clone Stamp Tool","History Brush Tool","Eraser Tool","Gradient Tool","Blur Tool","Dodge Tool","Pen Tool","Type Tool","Path Selection Tool","Custom Shape Tool","Hand Tool","Zoom Tool","Wallpaper Project","Thumbnail Project","Profile Picture Project","Have Fun Learning Photoshop 2022"],"requirements":["Willingness to Have Fun and Learn!","Setup Creative Cloud Account with 7 day free trial with a paid version after the trial & Download Creative Cloud App","Have Access to Photoshop 2022"],"description":"<p>Have you always wanted to learn how to Design but don't know where to start?</p><p>Would you like to make amazing Photos and bring your ideas to life?</p><p>Then Adobe Photoshop 2022 Photo Editing is for you!</p><p>Hi, I’m your instructor Josh Werner and I’ll be leading you through this course.</p><p>Photo Editing is an in-demand skill in 2022. </p><p>The course begins with the basics.&nbsp; </p><p>I'll take you through everything you need to know to start Editing Photos like an expert with Adobe Photoshop 2022.</p><p>You'll learn all the fundamentals of Adobe Photoshop 2022. </p><p>This is great for students starting or for Designers that need a refresher course on Adobe Photoshop 2022.</p><p>There are no requirements necessary to enroll I only ask that you come open minded and ready to learn</p><p>Feel Free to look through the course description and checkout some of my preview videos</p><p>The course is packed with over 4 hours of hands-on tutorials</p><p><strong>Here is what you will Learn:</strong></p><p><br></p><p><strong>01. Introduction</strong></p><p>&nbsp; 001. Overview</p><p><strong>02. Adobe Creative Cloud 2022</strong></p><p>&nbsp; 002. Overview</p><p>&nbsp; 003. Setup Account</p><p>&nbsp; 004. Download Creative Cloud App</p><p>&nbsp; 005. Install Creative Cloud App</p><p>&nbsp; 006. Summary</p><p><strong>03. Adobe Photoshop 2022 </strong></p><p>&nbsp; 007. Overview</p><p>&nbsp; 008. Install Adobe Photoshop 2022</p><p>&nbsp; 009. Summary</p><p><strong>04. Welcome Page</strong></p><p>&nbsp; 010. Overview</p><p>&nbsp; 011. Home</p><p>&nbsp; 012. Learn</p><p>&nbsp; 013. Lightroom Photos</p><p>&nbsp; 014. Cloud Documents</p><p>&nbsp; 015. Shared with You</p><p>&nbsp; 016. Deleted</p><p>&nbsp; 017. Create New</p><p>&nbsp; 018. Open</p><p>&nbsp; 019. Recent</p><p>&nbsp; 020. What's New</p><p>&nbsp; 021. Summary</p><p><strong>05. Main Menu</strong></p><p>&nbsp; 022. Overview</p><p>&nbsp; 023. File</p><p>&nbsp; 024. Edit</p><p>&nbsp; 025. Image</p><p>&nbsp; 026. Layer</p><p>&nbsp; 027. Type</p><p>&nbsp; 028. Select</p><p>&nbsp; 029. Filter</p><p>&nbsp; 030. 3D</p><p>&nbsp; 031. View</p><p>&nbsp; 032. Plugins</p><p>&nbsp; 033. Window</p><p>&nbsp; 034. Help</p><p>&nbsp; 035. Summary</p><p><strong>06. Tools</strong></p><p>&nbsp; 036. Overview</p><p>&nbsp; 037. Move Tool\t</p><p>&nbsp; 038. Rectangle Marquee Tool</p><p>&nbsp; 039. Lasso Tool</p><p>&nbsp; 040. Object Selection Tool</p><p>&nbsp; 041. Crop Tool</p><p>&nbsp; 042. Frame Tool</p><p>&nbsp; 043. Eyedropper Tool</p><p>&nbsp; 044. Spot Healing Brush Tool</p><p>&nbsp; 045. Brush Tool</p><p>&nbsp; 046. Clone Stamp Tool</p><p>&nbsp; 047. History Brush Tool</p><p>&nbsp; 048. Eraser Tool</p><p>&nbsp; 049. Gradient Tool</p><p>&nbsp; 050. Blur Tool</p><p>&nbsp; 051. Dodge Tool</p><p>&nbsp; 052. Pen Tool</p><p>&nbsp; 053. Horizontal Type Tool</p><p>&nbsp; 054. Path Selection Tool</p><p>&nbsp; 055. Rectangle Tool</p><p>&nbsp; 056. Hand Tool</p><p>&nbsp; 057. Zoom Tool</p><p>&nbsp; 058. Summary</p><p><strong>07. Conclusion</strong></p><p>&nbsp; 059. Summary </p><p><br></p><p><strong>So what are you waiting for? I look forward to going through course with you I’ll see you inside!</strong></p>","suitableLearners":["Beginner to Advanced Students wanting to Learn Photo Editing with Photoshop 2022"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-10-21T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-10-24T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e82f49c9b04f3f624d77f"],"topics":[],"reviews":[],"meta":{"ratingCount":1891,"studentCount":5095,"avgRatingScore":4.512708,"contentVideoLength":12521},"basicInfo":{"udemyCourseId":751226,"slug":"vsd-static-timing-analysis-i","title":"VSD - Static Timing Analysis - I","subtitle":"VLSI - Essential timing checks","image":"https://img-c.udemycdn.com/course/240x135/751226_f79b_2.jpg","price":1949670,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["Understand various STA checks for timing closure","Able to do a quality analysis for real designs","Know-how on how real STA works in industries, something which you will not find in any books","Step-by-step and structured timing analysis"],"requirements":["Knowledge on physical design flow will be good to have","If not, no worries. This course will take you from basics to advanced in a structured manner and create an interest in physical design world"],"description":"<p>Static timing analysis comprises broadly for timing checks, constraints and library. Having all of them in a single course makes it bulky. So we decided to have it in 3 parts and this is part I - Essential timing checks. This course will give an eagle's eye to every timing check that is being performed in current industries for sign-off. This will also introduce you to basic terminologies for timing, which are needed for advanced courses on STA. </p>\n\n<p>Timing comes at every step of physical design flow, but in this course, we primarily focus on signoff timing i.e. looking into each and every corner of design for any timing violations</p>\n\n\n\n\n\n<p>The course starts from very basic and gradually takes you to an advanced level at an intermediate pace. So no questions on you missing any details</p>\n\n\n\n\n\n<p>Hope you enjoy learning this course in the same way we enjoyed making them.</p>\n\n\n\n\n\n<p>Happy Learning !!</p>","suitableLearners":["Course starts from basic timing path to advanced latch checks, so basics of flipflops should be enough"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2016-04-29T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2016-05-02T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e82f49c9b04f3f624d77f"],"topics":[],"reviews":[],"meta":{"ratingCount":1851,"studentCount":44849,"avgRatingScore":4.492413,"contentVideoLength":11668},"basicInfo":{"udemyCourseId":502138,"slug":"adobe-illustrator-cc-mastery-zero-to-hero-in-illustrator","title":"Adobe Illustrator CC Mastery: Zero to Hero in Illustrator","subtitle":"Illustrator introduction for beginners or illustrators who want to learn more about illustrator. Learn the essentials!","image":"https://img-c.udemycdn.com/course/240x135/502138_9ac4_3.jpg","price":1146770,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["Design illustrations with Adobe Illustrator","Use the various tools of Illustrator","Stylize and customize type and shapes in Illustrator","Apply gradients, warp effects, blends, and other styles to shapes in Illustrator"],"requirements":["You will need a copy of Adobe Illustrator, either through 30-day free trial, Creative Cloud subscription, or older versions will work for most techniques."],"description":"<p><strong>Learn Illustrator and start creating logos, infographics, vector art and more illustrations today! </strong></p>\n\n<p><strong></strong>In this course, students learn the essentials of Illustrator, the industry-standard vector software, including</p>\n\n\n\n<ul><li>formatting and stylizing type</li><li>creating custom shapes</li><li>applying effects and styles</li><li>drawing with the brush and pen tools</li><li>tracing over photos</li><li>creating basic logos</li><li>using the various tools in Illustrator, including when to use certain ones</li><li>creating patterns, blends, and more</li></ul>\n\n\n\n\n\n<p><strong>Instructor Qualifications:</strong></p>\n\n\n\n<p>I've used Illustrator for years as a freelance graphic designer, and I've also used Illustrator when I was Internet Development Director at an award-winning advertising design firm. While I was Managing Editor of two international graphic design magazines, one of the magazines I oversaw focused on Illustrator. </p>\n\n\n\n<p>For the past eight years, as I've continued freelance work, I've taught students Illustrator and logo design in classes such as Layout and Design, as a full-time university professor.</p>\n\n\n\n<p>I have a BA in Communication, an MA in Journalism and Media Studies, a PhD in Communication, and a passion for teaching.</p>\n\n\n\n<p>Enroll now and let's get started learning and illustrating!</p>","suitableLearners":["This course is meant for people new to Illustrator or those who know a little about it and want to know more.","This course is NOT for people who are experts at Illustrator already.","If you already enrolled in my higher-priced Logo Design: Become a Professional Logo Designer course, then you do not need this course, since much of the Illustrator introduction in a few sections of that course overlaps with this course."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2020-05-08T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2020-05-11T00:00:00.000Z"},"promotions":{"discountPrice":298220,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e82f49c9b04f3f624d77f"],"topics":[],"reviews":[],"meta":{"ratingCount":1833,"studentCount":47088,"avgRatingScore":4.1979055,"contentVideoLength":4513},"basicInfo":{"udemyCourseId":968854,"slug":"adobe-photoshop-cc-for-beginners-main-features-of-photoshop","title":"Adobe Photoshop CC For Beginners: Main Features Of Photoshop","subtitle":"Adobe Photoshop CC For Beginners: Resize Images, Add Text & Effects, Remove Acne or Objects, Delete Backgrounds & More","image":"https://img-c.udemycdn.com/course/240x135/968854_f2fd.jpg","price":1949670,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["Use Adobe Photoshop CC","Use the most used tools in Photoshop","Edit Photos","Remove acne in a photo from a persons skin","Export images at different resolutions","Export images in different formats","Work with Vector files","Apply filter effects","Remove backgrounds from images","Draw shapes and designs","Customize their windows layout","Isolate parts of an image to apply effects to","Use the clone tool and magic wand tool to paint or remove parts of an image"],"requirements":["Download a free 30 day trial of Adobe Photoshop off of Adobe's website, or purchase a license from Adobe's website."],"description":"<p><strong>Get started with Adobe Photoshop CC&nbsp;today and learn all of the main tools and features; how to edit images, photos and more, all within 1 hour!</strong></p><p>This course is an introduction to Adobe Photoshop CC! It will take you from the very beginning of opening Photoshop and learning the various panel windows to importing and working with various images, cleaning up acne in photos, removing objects from images, apply effects, working with vector files, exporting and much more!</p><p><strong>You will learn how to:</strong></p><ul><li><p><strong>Use all of the main features of Adobe Photoshop CC</strong></p></li><li><p><strong>Get started in Photoshop by creating your first project</strong></p></li><li><p><strong>Navigate through the various panel windows</strong></p></li><li><p><strong>Import files</strong></p></li><li><p><strong>Work with various images</strong></p></li><li><p><strong>Clean up acne in photos</strong></p></li><li><p><strong>Remove unwanted objects from images</strong></p></li><li><p><strong>Apply effects</strong></p></li><li><p><strong>Work with vector files</strong></p></li><li><p><strong>Exporting</strong></p></li></ul><p><strong>And much more!</strong></p><p>Your instructor for this course is Will Bartlett. He is the founder of an established production company in Toronto, has trained over 100,000 people throughout his several creative courses, and has used Photoshop for&nbsp;hundreds of professional projects.</p><p>Our team will be available to answer any questions as well as help you with any issues you may come across while making your way through the course.</p><p><em>Even if you don’t have Adobe Photoshop you can still take advantage of this course by downloading a free trial from Adobe's website. All you need to do is create a free account with them, it only takes a minute and you will then be able to start downloading Photoshop.</em></p><p><strong>Get started now with Adobe's photo&nbsp;editing program today to improve your images today!</strong></p>","suitableLearners":["This Adobe Photoshop CC course was created for beginners. No prior knowledge of Photoshop is required.","The Photoshop Course was created with Entrepreneurs and Small Business Owners in mind. It's designed to teach you quickly how to manipulate photos to get the results you have efficiently.","This course is NOT for a professional image editor, or someone who already knows how to use Adobe Photoshop."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2020-04-24T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2020-04-27T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}}]