[{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83339c9b04f3f624d7ac"],"topics":[],"reviews":[],"meta":{"ratingCount":186,"studentCount":949,"avgRatingScore":4.468542,"contentVideoLength":4854},"basicInfo":{"udemyCourseId":880826,"slug":"how-to-do-fashion-design-research","title":"How To Do Fashion Design Research","subtitle":"Master this essential fashion design skill to ensure your designs are fresh, inspired and have your personal signature.","image":"https://img-c.udemycdn.com/course/240x135/880826_bd73_3.jpg","price":458570,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["How to easily carry out research for any project or design brief you are given, so you never struggle to achieve success.","How to organise your research material so that you can quickly and easily refer to it in the future.","How to create research goals so that you are kept focused and productive.","Where to go for the 15 sources of research so that you never run dry of material or ideas.","Understand the 4 fashion design research themes to use.","How to get behind the scenes access to research material in museums and galleries.","How to use a research planner to manage all your research projects.","How to become inspired when you feel stuck and your creative ideas are not flowing."],"requirements":["No pre-requisites are required."],"description":"<p>This course will help anyone that uses research as part of their creative fashion design process. Carrying out effective research is an essential skill for any designer and this course will help you to master this skill.</p>\n\n<p><strong>Make sure your fashion design work is constantly topped up with innovative ideas and inspired work because you have learnt the essential skills for fashion design research.</strong>\n</p>\n\n<p><strong>This course will help:</strong></p>\n\n<ul><li><strong>Fashion students at all levels</strong></li><li><strong>People going through the application process</strong> for a university or college course in fashion design or a fashion related course</li><li><strong>People applying for a job</strong> in the field of fashion where an understanding of research in the design process is required.</li><li><strong>Mature students, those on a GAP</strong> <strong>year and people in a job</strong> who want to refresh their design research skills.</li></ul>\n\n\n\n<p><strong>After completing the course:</strong></p>\n\n<p>By successfully completing this course and applying what you have learnt you will have a confident, well organised, efficient and disciplined approach to your fashion design research. </p>\n\n<p><strong>Duration</strong> - the course will take about 1.5 hours to complete.</p>\n\n<p><strong>Structure</strong> - you'll be guided by a tutor who has both fashion design and teaching experience and is a gifted designer in her own right, able to pass on her experience to you.</p>\n\n<p><strong>Materials</strong> - you will receive complimentary key learning point sheets, a research planner template, sheet as well as personal goal plans and action planner for use during and after you have completed the course.</p>\n\n<p><strong>Tutor Support</strong> - your tutor is on hand to call upon for any support you need and to help you to make the most of the course and the time and money you have invested.</p>\n\n<p><strong>Student Discussions</strong> - the course includes an opportunity to join in with other students and discussions relating to the creation of your fashion portfolio.</p>\n\n<p><strong>Life Time Access</strong> - you have lifetime access to the course so there's no need to feel that you have to complete it within a few days. Start and finish when it suits you knowing that if for any reasons you can't complete it in one go you can always finish it later.</p>","suitableLearners":["This course is designed for anyone that needs to carry out design research work as part of their creative process. This will include fashion designers, fashion design students or creatives working in the fashion sector."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2017-01-03T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2017-01-06T00:00:00.000Z"},"promotions":{"discountPrice":298220,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83339c9b04f3f624d7ac"],"topics":[],"reviews":[],"meta":{"ratingCount":181,"studentCount":1123,"avgRatingScore":4.4747267,"contentVideoLength":2338},"basicInfo":{"udemyCourseId":2445734,"slug":"pattern-making-for-fashion-design-part-2-yokes-stripes","title":"Pattern Making for Fashion Design - PART 2 (Yokes, Stripes,)","subtitle":"Draping, Pattern Making, Design Elements come together as Techniques to create new designs, such as Yokes, Stripes, etc.","image":"https://img-c.udemycdn.com/course/240x135/2445734_6d9f_3.jpg","price":917370,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["The use of Pattern Making and Draping combined as techniques to create a Fashion Design.","Introducing and working with a Yoke.","You will learn how to: Turn a Dart into Shirring/Gathers.","You will learn: Using the \"Slash-and-Spread\" technique to add fullness to a design.","The use of seams to separate panels and create a new design.","Learning the use of Notches, Grainlines, Labeling."],"requirements":["Some basic understanding of Pattern Making and Draping."],"description":"<p>In this Course you will learn about <strong>Yokes</strong> and how use them to create new ideas and designs, especially when using <strong>Stripes</strong>.&nbsp; You will see how stripes and grainlines effect the design element and thus effecting the style of your design. You will learn how to create a <strong>Yoke</strong> using both techniques: <strong>Draping </strong>and <strong>Pattern Making</strong>.&nbsp; You will how to turn a <strong>Dart</strong> into <strong>Shirring</strong> and thus eliminating the dart.&nbsp; You will see that by eliminating the darts in the bodice, you can create a <strong>\"Princess Seam\"</strong> and thus design a new style which can be explored further by the choice of fabric selection.&nbsp; We review pattern making techniques to change the shape of your designs.&nbsp; </p><ul><li><p>You'll learn how to use <strong>\"Slash-and-Spread\"</strong> techniques, and add fullness.</p></li><li><p>You'll be using the <strong>1-Dart</strong> and the <strong>2-Dart Bodice</strong>.</p></li><li><p>Using <strong>Yokes</strong> on <strong>Skirts</strong>.</p></li><li><p>You'll learn <strong>Dart Manipulation</strong>: how to take a <strong>Dar</strong>t and turning it into <strong>shirring/gathers</strong>.&nbsp; </p></li><li><p>You'll learn that by adding <strong>Seams</strong> you can develop new ideas/designs.</p></li><li><p>Using <strong>Princess Seams</strong> as a way to create new ideas.</p></li><li><p><strong>Elements of Design</strong> -- what are they and how to use them in the fashion design process.</p></li><li><p>You'll learn <strong>Notches</strong> -- how to use <strong>\"control notches\"</strong>.</p></li><li><p>Passion <strong>vs</strong> Purpose.</p></li></ul><p>Learning Pattern Making can be challenging but you will see that with my video/classes the work will be easily absorbed, integrated, and also inspiring; learning pattern making and learning how a garment/design, is put together, how all the pieces come together in a perfect way, is empowering thus building confidence and courage to motivate you to make your own designs.</p><p>Creating <strong>Yokes</strong> to develop new designs is a fun and creative way to achieve new looks, new ideas, new designs.&nbsp; Experimenting with grainlines also is a way to come up with new ideas. When using stripes, designs get very \"interesting\" because the grainlines will generate some very unique and new ideas.</p><p>Learning how to pin muslin unto a dress form is also important in order to end up with a correct pattern. Using muslin to drape is an art that can be used in very original ways to expand your creative reach. Having a <strong>Dress Form</strong> is very useful and I invite you to purchase one: when it comes to fitting a garment, putting it on a dress form will tell you quickly if you're executing it correctly or not.</p><p>Learning how to modify and \"change\" a pattern by adding fullness for example is very important and therefore learning the use of the <strong>Slash-and Spread</strong> technique is so important, giving you the ability to be crating and innovative.</p><p>You will be working with a 1-Dart and a 2-Dart sloper/pattern.&nbsp; Learn how to work with, and manipulate, darts is essential in Pattern Making. And how to eliminate a dart by turning it into shirring/gathers. </p><p>You will learn how <strong>Princess Seams</strong> are developed and how that technique can be applied to a garment in order to create new and original designs.&nbsp;There are variations of a Princess Seam, (also known as princess line), and you as a fashion designer get to pick your favorite option to create your unique design. </p><p>You will learn how <strong>Notches</strong> become essential when instructing your seamstress how you want a garment sewn; communicating effectively with your seamstress/pattern-maker is fundamental in the execution of a garment.&nbsp; Notches can define a seam allowance or the can instruct a seamstress/factory how you want a specific clothing item to be assembled, kind of like an instruction manual.</p><p>Pattern Making is your vehicle, your tool, to execute your ideas and bring them to life.&nbsp; Learning pattern making is an ongoing learning process and you're always learning new techniques, new skills, which will make you a better designer.&nbsp; Whether you're a beginner or a professional, there is alway something new to learn: this Course will be part of your repertoire as a fashion designer. And you're at the early stages of your learning curve, this Course will empower you, and inspire you, to become an excellent designer.</p><p>Along with Pattern Making comes <strong>Elements of Design</strong>: super important when analyzing a design to determine if a design is \"good\" or \"bad\" and how to judge your objective in the intended design. </p><p>In Fashion Design, knowing what your driving force is, is fundamental in building a solid foundation for a successful Brand. At the end of the Course, I cover Purpose and Vision -- two elements that when combined become fuel for your creativity and drive and success.</p><p>This course is about learning how to be a great fashion designer; whether you are a beginner student or a professional fashion designer, learning skills and techniques in designing is an ongoing process: there’s always something new to learn, even if you know basic fashion design techniques, building on top of that is essential to expand your knowledge of the industry at large.</p><p>Nowadays learning fashion designing online is such an amazing opportunity: you can study and learn fashion in the comfort of your own home, at your own pace, having full lifetime access - wow...that's amazing.&nbsp; Save on the cost of hight tuition, instead learn by watching these high quality videos, which you can rewind and watch over and over again, on your own schedule.</p><p>Learning fashion sketching, fashion draping and pattern making (aka Pattern Drafting) or you want to explore The Business of Fashion, and learn the business side of fashion, or learning how to put a Fashion Collection together and learning the use of Fabrics and the Textile Industry, these Courses are an amazing opportunity to expand your knowledge, elevate you fashion skills, and add to your existing body of work.</p><p>Whether making clothes is a hobby of yours or a financial income generator, these courses empower you to build your confidence and make you a better designer. </p><p>Regardless whether you are putting together your first fashion design portfolio, or build your fashion website, or learn how to market your fashion line, these courses give you the ability to accomplish all that especially because you will be saving on expensive tuition costs.</p>","suitableLearners":["Students interested in expanding and growing their knowledge of Fashion Design."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-09-27T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-09-30T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83339c9b04f3f624d7ac"],"topics":[],"reviews":[],"meta":{"ratingCount":157,"studentCount":1652,"avgRatingScore":4.383106,"contentVideoLength":7751},"basicInfo":{"udemyCourseId":729184,"slug":"how-to-create-a-sloperblock-from-scratch","title":"How to create a Sloper/Block from scratch","subtitle":"Make your own garments using your own bodice block","image":"https://img-b.udemycdn.com/course/240x135/729184_1a47.jpg","price":458570,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["Use their own bodice sloper/block for garment construction ","Draft a custom bodice sloper/block from scratch"],"requirements":["Have basic pattern making equipment ","Have a mannequin or dress form for part of the course "],"description":"<p>What you have been waiting for. A course designed to teach you the fundamentals of making your own bodice sloper/block. I'm excited to deliver this to you.</p><p>This course is designed for:</p><p>- Fashion students.<br>- Industry professionals. <br>- Hobbyists. <br>- Fashion enthusiasts.</p><p>We will cover:<br><br>- Pattern cutting basics. <br>- Sloper construction by flat pattern making.  <br>- Sloper construction by draping on a mannequin/dress form. <br>- Introducing you to blocks and slopers (the tools of the trade). <br>- Basic garment construction. </p><p><span></span>All of the lectures are delivered by video. At the end of the course you will be ready to move forward in your pattern cutting journey.</p><p>See you on the inside. <span></span><br></p>","suitableLearners":["Fashion Students","Industry Professionals","Aspiring home dress makers","Pattern Makers","Pattern Cutters","Fashion lovers"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2016-01-16T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2016-01-19T00:00:00.000Z"},"promotions":{"discountPrice":298220,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83339c9b04f3f624d7ac"],"topics":[],"reviews":[],"meta":{"ratingCount":156,"studentCount":969,"avgRatingScore":4.406617,"contentVideoLength":6958},"basicInfo":{"udemyCourseId":2106106,"slug":"learn-jewelry-designing-from-scratch","title":"Learn Jewelry Designing from Scratch","subtitle":"Jewelry Designing through Sketching","image":"https://img-c.udemycdn.com/course/240x135/2106106_b192_2.jpg","price":1146770,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["Learn Jewelry Designing"],"requirements":["All you need is a pencil, few A4 size papers, a 6-inch scale (ruler), an eraser and a compass, you can also see the details of the same in the introduction video."],"description":"<p>If jewelry is something which interests you, then this course is your first step towards it. <strong>No prerequisite knowledge</strong>.</p><p>This is the first level of jewelry designing.</p><p><strong>All you need is a pencil, few A4 size papers, a 6-inch scale (ruler), an eraser and a compass, you can also see the details of the same in the introduction video.</strong></p><p>Whether you are a total newbie, aspiring to join the jewelry industry, or a jeweler looking to grow or a manufacturer or simply someone who wants to get into jewelry while working in a day job, then this course is your stepping stone to getting to the top in jewelry.</p><p> You don't need to join any expensive institute. This is just the beginning, there will be a plethora of courses coming in future,taking you from designing to manufacturing, will also include diamond grading courses as well.</p><p>As ZIG ZIGLAR said-<strong>“YOU DON’T HAVE TO BE GREAT TO START, BUT YOU HAVE TO START TO BE GREAT.”</strong></p><p>So let us get on with your journey into the beautiful and glittering world of jewelry.</p>","suitableLearners":["Anyone interested in jewelry"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2019-01-22T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2019-01-25T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83339c9b04f3f624d7ac"],"topics":[],"reviews":[],"meta":{"ratingCount":154,"studentCount":1244,"avgRatingScore":4.630827,"contentVideoLength":21092},"basicInfo":{"udemyCourseId":1028348,"slug":"photoshop-for-t-shirt-design-advanced","title":"Photoshop For T-shirt Design: Advanced","subtitle":"Learn Advance techniques on how to use Photoshop to create awesome, Hot Selling T-shirts","image":"https://img-c.udemycdn.com/course/240x135/1028348_2f0f.jpg","price":1146770,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["Create stunning professional Graphic","Start a t-shirt line","Upload and market T-shirt graphics online in places like Teespring & Merch by Amazon"],"requirements":["Students will need a moderate knowledge of Photoshop","Students will need to knw that this is lke no other course on Photoshop"],"description":"<p>This is the advanced Photoshop course that teaches you how to design Killer, Hot Selling, Unique, T-shirts. You will learn how to use the Photoshop and create advanced T-shirts.  T-shirts that are eye catching, sort after &amp; in demand! I have also added a few tips &amp; tricks that I learned over my 20 years as a major brnd graphic designer. This course is like no other course on the internet. I not only tech you advanced techniques and inside info. I give the very POWERFUL information on design theory. Things like what are the hot Niches/genres to get into. I also teach T-shirt design techniques like balance &amp; symmetry. This course will blow you away! So what are you waiting for?! Make it happen &amp; I'll see you on the inside.</p>","suitableLearners":["Anyone looking to take their T-shirt design skills to the next level","Anyone looking to sell T-shirts online and be a part of the multi billion dollar T-shirt industry"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2017-01-10T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2017-01-13T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83339c9b04f3f624d7ac"],"topics":[],"reviews":[],"meta":{"ratingCount":148,"studentCount":1342,"avgRatingScore":4.126149,"contentVideoLength":21142},"basicInfo":{"udemyCourseId":1226318,"slug":"merch-motivated-merch-by-amazon-from-beginner-to-beyond","title":"Merch Motivated - Merch by Amazon from Beginner to Beyond​","subtitle":"This up-to-date Merch by Amazon Masterclass will help you make a success of your Merch by Amazon T Shirt Business","image":"https://img-c.udemycdn.com/course/240x135/1226318_0911_2.jpg","price":1949670,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["LEARN all about the Print On Demand T-Shirt Business","DISCOVER why Merch by Amazon is so different to Teespring","FIND OUT exactly how Amazon Merch works","UNDERSTAND the concept of Tiering Up on Merch","LEARN strategies on how to quickly tier up your Merch T Shirt Business","DISCOVER how to get great ideas for your t-shirt designs","FOLLOW a step-by-step guide on how to upload a t shirt design to Merch","UNDERSTAND the importance of following Amazon’s rules and guidelines"],"requirements":["You should be willing to treat Merch by Amazon as a T-Shirt business","It helps if you are a creative or at least have an eye for a good design"],"description":"<p>The Merch by Amazon masterclass, <strong>Merch Motivated - Merch by Amazon from Beginner to Beyond</strong> will teach you everything you need to know to start earning a substantial income from designing and selling t-shirts online.<br></p>\n\n<p>If you are in any way creative and have not checked out the incredible opportunity that is <strong>Merch by Amazon</strong> then my advice to you would be to stop whatever it is you are doing now and spend the next hour or so watching this course, which will explain just how easy it is to supplement your online income through designing t-shirts for sale on Amazon Merch.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Incredible Opportunity Not To Be Missed</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Merch by Amazon is without doubt one of the best opportunities currently out there for creatives wanting to supplement their online income. And by Creatives, I am not just talking about the Graphic Designers amongst you. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Perhaps like me, you are a writer and so naturally have a talent for coming up with witty slogans for t-shirts. Or maybe you are a web designer and so have a natural eye for a cool design.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The good news is that on the whole the designs that seem to sell best on Merch do not necessarily need the skillset of a trained graphic designer, but rather the skill set of someone who is creative and who is willing to research exactly which designs are going to sell well on the platform.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Why Take This Course? </strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The <strong><strong>Beginner's Guide to Merch by Amazon</strong></strong> will explain everything you need to know to help get you up and running in this incredibly exciting t shirt business.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The course begins by looking at the Print On Demand tshirt business model in general, including other POD companies such as Teespring, and why Amazon Merch in particular Is such an exciting opportunity.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The course then considers exactly how Merch by Amazon works, before looking in detail at the concept of Tiering Up on Merch.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The next part of the course takes a more practical look at how to get ideas for your t-shirt designs as well as a step-by-step look at actually uploading a t shirt design to Merch.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The course then covers the importance of following the rules that have been laid out by Amazon as well as the need for researching trademarks, so as to avoid any chance of your March by Amazon account being closed down.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>And last, but not least, the class looks at what you should do while you are waiting to be accepted into the March by Amazon program.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>So why not join me in this class today and discover just how easy it is to make a significant passive income online through March by Amazon.</strong></p>","suitableLearners":["Anyone who wants to earn a substantial passive income online"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2020-11-11T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2020-11-14T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83339c9b04f3f624d7ac"],"topics":[],"reviews":[],"meta":{"ratingCount":143,"studentCount":911,"avgRatingScore":4.7108126,"contentVideoLength":3435},"basicInfo":{"udemyCourseId":3317852,"slug":"pattern-making-for-fashion-design-part-3-collars-necklines","title":"Pattern Making for Fashion Design -PART 3-Collars, Necklines","subtitle":"How to Draft Collars, Necklines, Facings, Cowl, Mandarin, Button Ext.'s, A-symmetrical Design, Bias-binding, Bias Grain","image":"https://img-b.udemycdn.com/course/240x135/3317852_aa9a.jpg","price":917370,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["You will be creating, designing and drafting Collars and Necklines.","You will be designing Collars such as Mandarin, Convertible, Peter Pan, Sailor, Cowl, etc.","You will learn how to create necklines such as Sweetheart, V-neck, Scooped neck, Boat neck, etc.","You will learn about A-symmetrical necklines: the nature of A-symmetrical designs.","You will learn how to draft Facings and Button Extensions, Buttonholes, Buttons.","You swill learn how to finish the edge of a neckline using Bias-Binding and Piping.","You will learn Facing, Interfacing and Under-stitch."],"requirements":["It would be helpful to have watched my previous Course on Basic Pattern Making (Part 1) and Pattern Making - Part 2, but if you know some basic patternmaking and sewing, that is sufficient."],"description":"<p>This Course is '<strong>PART 3</strong>' of <strong>Pattern Making for Fashion Design</strong>.&nbsp; It shows how to draft <strong>Collars</strong> and <strong>Necklines</strong>.&nbsp; It shows the drafting of <strong>Button Extensions</strong> and <strong>Buttonholes</strong>.&nbsp; It explains the use of <strong>Bias grain lines</strong> as used in the <strong>Cowl Neckline</strong>. And how to finish the edge of a neckline using <strong>Bias-Binding, </strong>and<strong> Piping.&nbsp; </strong>Also <strong>Facings</strong>, <strong>Interfacings</strong>, <strong>Under-stitch</strong>.</p><p>The Course will show you how to draft Collars:</p><ul><li><p>Mandarin collar</p></li><li><p>Peter Pan collar</p></li><li><p>Sailor collar</p></li><li><p>Convertible collar</p></li></ul><p>And: how to draft a:</p><ul><li><p>Cowl neckline</p></li><li><p>Scoop neck and Facing</p></li><li><p>V-neck with Facing</p></li><li><p>Boat neck an facing</p></li><li><p>A-symmetrical necklines</p></li><li><p>Facings</p></li><li><p>Interfacings</p></li><li><p>Under-stitch</p></li><li><p>Bias-Binding</p></li><li><p>Piping</p></li><li><p>Top Collar vs Under Collar</p></li></ul><p>Pattern Drafting is a very important aspect of the fashion design process, it takes years of practice to perfect the craft but with my Pattern Making Courses, you will see how easy it is to grasp the concepts and by watching my demos, you will easily integrate these skills into your current knowledge and add to the body of knowledge that you already have. My video/demos are fun, educational and inspiring.</p><p>If you've taken <strong>PART 1</strong> and <strong>PART 2</strong> and you have some basic pattern drafting/draping knowledge, then this <strong>PART 3</strong> will build on top of that, and will definitely increase your skills necessary to perfect the art of pattern-making. </p><p>Included in this Part 3, there will be some <strong>DRAPING</strong> involved as you will see in the making of the <strong>COWL</strong> neckline, which is very beautiful (if I may say so myself).&nbsp; You will also see, and learn, how to use a <strong>BIAS Grain Line,</strong> which is how we create the Cowl Neckline.</p><p>Working on \"half\" the dress form is standard (and \"normal\") in the industry except when creating <strong>A-symmetrical</strong> designs, in which case we have to work with an \"open\" pattern, meaning including the left side AND the right side of the pattern. Asymmetrical designs are those designs where the left side and the right side (of the garment) are not the same, which makes for a dramatic and unusual design: oftentimes you will see Asymmetrical design on the Hollywood Red Carpet Events.</p><p>You will see me demonstrating techniques using the <strong>Dress Form</strong> and also the White Board and the use of Dotted Paper (Pattern Paper), so you will most definitely learn how to create all these ideas. By doing so, you will get to learn the steps that it takes to create a design, the process of creating new ideas using different means to achieve a result.</p><p>We will cover the drafting of a <strong>Facing</strong>, (what is a Facing) and an <strong>Inter-facing</strong> (why do we use inter-facing). </p><p>I will show you how to use an <strong>Under-stitch</strong> when finishing the edge of a neckline.</p><p>We will review the TOOLS used in Pattern Drafting, such as: Hip Curve and French Curve and Notcher. And of course scissors, pencil, and Dotted Paper for drafting purposes.</p><p>We will review basic techniques such as <strong>Slash-and-Spread</strong> and how to use it when adding fullness to a pattern for example.</p><p>We will be combining what was covered in Pattern Making PART 2, such as YOKES, bringing Yokes back into the picture and adding fullness to a garment an adding a Yoke to it to create a new idea/design.</p><p>Collars encircle the face thus creating a \"frame\" for the face thus presenting many opportunities to get creative for endless design variations. A collar can and should compliment the style of the design.</p><p>You will learn how to draft a <strong>Mandarin Collar</strong>: a very simple draft but essential because it will become the foundation of other Collars.&nbsp; So once you learn how to make the Mandarin Collar, you can use the principle/technique to create other similar designs. The Mandarin collar can also be what is known as the \"stand\" for other collars, such as the convertible collar.</p><p>You will learn how to make a <strong>Peter Pan Collar</strong> and why it's so popular when used in women's dresses or tops. The collar can be kept closed or left open.</p><p>You will learn how to draft a <strong>Sailor Collar</strong>.&nbsp; A Sailor Collar was originally inspired by the sailors' uniforms, it then became very fashionable and stylish when used properly and creatively.</p><p>A <strong>Cowl Neckline</strong> is achieved by letting the fabric fall easily unto the bodice, falling at desired lengths. Cowls look best when draped on a Bias grain line. A Cowl can be used in the front of a dress/top or in the back (but not both at the same time as it would tend to fall off the shoulders).</p><p>These courses/classes are about learning how to be a great fashion designer; whether you are a beginner student or a professional fashion designer, learning skills and techniques in designing is an ongoing process: there’s always something new to learn, even if you know basic fashion design techniques, building on top of that is essential to expand your knowledge of the industry at large.</p><p>Nowadays learning fashion designing online is such an amazing opportunity: you can study fashion, all the different aspects, in the comfort of your own home, at your own pace, having full lifetime access... wow... that's cool.&nbsp; Save on the cost of hight tuition, instead learn by watching these high quality videos, which you can rewind and watch over and over again, on your own schedule.</p><p>Learning fashion sketching, and fashion draping and pattern making (Pattern Drafting) or maybe you want to explore The Business of Fashion, and learn the business side of fashion (so you stay in business), or learning how to put a Fashion Collection together and learning the use of Fabrics and the textile Industry, these Courses are an amazing opportunity to expand your knowledge, elevate you fashion skills, and add to your existing body of work.</p><p>Whether making clothes is a hobby of yours or a financial income generator, these courses empower you to build your confidence and make you a better designer. </p><p>Regardless of whether you are putting together your first fashion design portfolio, or build your fashion website and your online store, or learn how to market your fashion line, these courses/classes give you the ability to accomplish all that ...especially because you will be saving on expensive tuition costs. Enjoy!</p>","suitableLearners":["Fashion Design students eager to learn Pattern Drafting and wanting to expand their knowledge of garment design and construction."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2020-08-03T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2020-08-06T00:00:00.000Z"},"promotions":{"discountPrice":367040,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83339c9b04f3f624d7ac"],"topics":[],"reviews":[],"meta":{"ratingCount":142,"studentCount":880,"avgRatingScore":3.6720102,"contentVideoLength":7722},"basicInfo":{"udemyCourseId":72454,"slug":"celebrity-fashion-stylist-fashion-and-styling-the-famous","title":"Celebrity Fashion Stylist: Fashion and Styling the Famous","subtitle":"Learn how to work as a Fashion Stylist to the stars ","image":"https://img-b.udemycdn.com/course/240x135/72454_2089_8.jpg","price":573270,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["Learn the process of becoming a Stylist","Learn how Stylists select their assistants ","Learn various terms used by stylist and in the fashion world","Learn the Business of working with clients and fashion stores","Learn how to acquire clothes for your clients and build your reputation"],"requirements":["No prerequisites for this course"],"description":"<p style=\"\">Becoming a tremendous stylist takes hard work, social skills, timing, persistence, knowledge, and fabulous resources for clients.&nbsp;This class will take you within the unique world of fashion and style.&nbsp;You will gain the techniques and skills you must have to start and sustain a career as a stylist upon completion of this course.&nbsp;</p><p style=\"\">Industry Expert</p><p style=\"\"><strong style=\"\">Tiffany Dean</strong> <em style=\"\">Celebrity Fashion Stylist</em><p style=\"\">Tiffany began her career as a Retail Merchandising Coordinator&nbsp; for high-end fashion brands DKNY, BCBG, Max Azria, and Guess by Marciano.&nbsp; She has quickly risen within the world of&nbsp; celebrity fashion styling over the last decade with a roster of such clients as&nbsp; Katy Perry, Lindsay Lohan, and Tyrese Gibson.&nbsp;&nbsp; Also, she works with Emmy Award winning shows <em style=\"\">Modern Family</em> and <em style=\"\">Hawaii 5.0</em>,&nbsp; as well as with many high fashion magazines such as <em style=\"\">Elle</em>, <em style=\"\">Vogue</em>, <em style=\"\">Marie Claire</em>, <em style=\"\">Maxim</em>, <em style=\"\">British FHM</em>, and <em style=\"\">Bride and Bloom</em>.<p style=\"\">Featured Expert <strong style=\"\">Angela Dean</strong> <em style=\"\">Celebrity Fashion Designer</em> <p style=\"\">Viewed as an industry pioneer by the fashion community, Angela&nbsp; Dean has served as President of Fashion Institute of Design and Merchandising&nbsp; in Los Angeles, where the exhibit The Era of Entertainment was created to&nbsp; preserve garments she made for Hollywood elite. <p style=\"\">She has created looks that have been worn by an&nbsp; extraordinary list of clients.&nbsp; Among&nbsp; them are Madonna, Halle Berry, Patti Labelle, Priscilla Presley, Monique, Mary&nbsp; J. Blige, Magic Johnson, Paris Hilton, and Oprah Winfrey.&nbsp; Her creations too have graced magazine covers,&nbsp; awards shows, and CD covers such as,&nbsp; the&nbsp; 30th Anniversary <em style=\"\">Essence</em> magazine cover which represented the highest selling issue in the magazine’s history,&nbsp;&nbsp; Natalie Cole’s gown worn on the cover of her&nbsp; Grammy award winning album, <em style=\"\">Unforgettable</em>, and numerous gowns for&nbsp; actress Latonya Richardson’s Academy Awards appearances.</p>  ","suitableLearners":["Aspiring Stylist","Fashion Enthusiast","Those that want to better their own fashion knowledge","Vendors wanting to provide clothing for celebrities"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2015-10-06T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2015-10-09T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83339c9b04f3f624d7ac"],"topics":[],"reviews":[],"meta":{"ratingCount":134,"studentCount":1000,"avgRatingScore":3.9976835,"contentVideoLength":13864},"basicInfo":{"udemyCourseId":2312532,"slug":"advanced-fashion-illustration","title":"Advanced Fashion Illustration","subtitle":"Learn theories and watch demonstration of how to color different fabrics and materials with markers and colored pencils.","image":"https://img-c.udemycdn.com/course/240x135/2312532_a286_2.jpg","price":1146770,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["28 lectures within 4 hours","How to render the skin tone and how to illustrate 10 fashion looks with color pencils and markers.","Theory of light and shade, Color wheel, Color scheme","Basic knowledge of fabrics and materials"],"requirements":["Basic Fashion Illustration","Understand how to draw the 9-head figure."],"description":"<p>Do you want to learn or improve your fashion drawing?</p><p>Do you want to illustrate your inspiration and idea in a stylish way?</p><p><br></p><p>Within 4 hours, this course, Advanced Fashion Illustration, contains many useful information and techniques that will give you the understanding of the shading theory on the model face and figure, color wheel along with color definition and combination, basic information of different kinds of fabrics and materials, and most importantly, the illustration techniques using watercolor pencils &amp; markers to render 10 fashion looks.</p><p><br></p><p>My name is Wanwisa. I have created the 1st course, Basic Fashion Illustration, teaching how to draw the fashion figures and poses. This is my 2nd course, Advanced Fashion Illustration. It is a combination of ideas, information, theories, along with my knowledge &amp; experience in teaching that will enhance your skills in fashion sketches and illustrations.</p><p><br></p><p>It will save your time and money from taking the expensive course. And it is also great for those who need to prepare themselves with knowledge and drawing skills before entering the fashion school.</p><p>You can take this online course anywhere you want, anytime you want, at your own pace. Join me in this course and take your skill to the next level.</p>","suitableLearners":["People who are interested in fashion illustration","Students","Designers","People who prepare for the fashion school"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2019-04-09T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2019-04-12T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83339c9b04f3f624d7ac"],"topics":[],"reviews":[],"meta":{"ratingCount":133,"studentCount":1455,"avgRatingScore":4.2084785,"contentVideoLength":4092},"basicInfo":{"udemyCourseId":419006,"slug":"fashion-style-yourself-flawlessly","title":"Fashion: Style Yourself Flawlessly","subtitle":"Dress yourself with ease and confidence, without a personal stylist.","image":"https://img-c.udemycdn.com/course/240x135/419006_66a7_7.jpg","price":1376170,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["Choose the right wardrobe for your lifestyle","Build your first capsule wardrobe","De-clutter your wardrobe and learn how to keep things organized","Choose colors that work for your mood and your beauty","Wear prints with confidence","Master the art of shape and dressing","Master the art of accessorizing ","Style yourself uniquely ","Shop confidently with easy guidelines"],"requirements":["All you need is a willingness to have fun!"],"description":"<p><strong>Fashion: Style Yourself Flawlessly</strong></p><p><em>Dress yourself with ease and confidence, without a personal stylist.</em></p><p><br></p><p>Be the best dressed woman in the room: Be filled with confidence, personal empowerment, while feeling sexy and feminine and most importantly becoming the best version of you!  </p><p><br></p><p><strong>After taking this course you will:</strong>  </p><ul><li><p>Choose colors that flatter your natural beauty</p></li><li><p>Feel confident dressing according to your shape</p></li><li><p>Organize your space to get most out of your wardrobe</p></li><li><p>Be amazing at accessorizing</p></li><li><p>Think outside the box with styles beyond the trends</p></li><li><p>Dress appropriately for any occasion</p></li><li><p>Become a smarter, more confident shopper</p></li><li><p>Enjoy experimenting with fashion!</p></li></ul><p>There is a lot more to fashion than just picking out an outfit in the morning based on the weather patterns. The latest scientific studies shows that the outfit you choose to wear actually alters the way you interact with the world.  </p><p>This course will help you choose garments that allow you to bring your A-game to both your professional and personal life. Learning how to carefully select items that enhance your best features will give a powerful edge. It might even open the door to new business ventures or better relationships. The image you project to the world through your clothes determines the quality of your connections, as well the relationship you have with yourself.  </p><p>Your closet isn't just a box filled with fabric. Instead it is a doorway to creativity that allows you to express who you are, heighten your performance and quality of life. Ultimately it opens the gateway  for you to become the best version of YOU!  </p><p><br></p><p>Take this course today, and become the best dressed woman in the room!  </p><p><br></p><p><br></p><p><strong>This course comes with a 30 day money back guarantee.</strong></p>","suitableLearners":["Any woman who wants to gain confidence in fashion and styling","Any woman who wants to change or enhance the image they are projecting to the world through their clothes"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2015-02-26T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2015-03-01T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83339c9b04f3f624d7ac"],"topics":[],"reviews":[],"meta":{"ratingCount":127,"studentCount":1046,"avgRatingScore":4.8015924,"contentVideoLength":15435},"basicInfo":{"udemyCourseId":2561198,"slug":"learn-to-draw-fashion-with-adobe-illustrator-cc-advanced","title":"Learn to draw fashion with Adobe Illustrator CC - Advanced","subtitle":"Adobe Illustrator training specifically tailored for fashion designers","image":"https://img-b.udemycdn.com/course/240x135/2561198_5656.jpg","price":1032070,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["Ability to competently apply advanced fabric fill techniques that adapt to the drape of the fabric, making your fashion flats look as realistic as possible","Advanced digital fashion illustration techniques","How to produce professional standard documents to communicate your designs to the wider design/buying/product development teams and supply chain","How to integrate your illustrator drawings into professional standard design and product development workflows to improve efficiency","Tools and techniques to increase your productivity","How to optimise your AI files for integration into other supporting product development systems","Achieve expert fashion design skills in Adobe Illustrator","You will stand out from the thousands of fashion design graduates and make yourself more attractive to potential employers"],"requirements":["You should have Adobe Illustrator installed. The training is designed around the CC version of Illustrator, however you can still follow the training with older versions of Illustrator as many of the techniques will be the same. You should be aware though that there may be some functions featured that will not be available in older versions","You should have completed the beginners and intermediate levels of the Illustrator 4 Fashion course as this course will assume students already have a certain level of Adobe Illustrator competency"],"description":"<p>Learn how to use Adobe Illustrator to draw fashion flats and illustrations. Develop your skills to enable you to produce creative, accurate product designs quickly and to standards required for retail and manufacturing.</p><p><strong>In this advanced level 3 course, you will learn advanced tools and techniques to make your fashion flats as realistic as possible but the main focus of this level will be about implementing your Illustrator drawings into the professional design and development workflow and improving your design efficiency and communication.</strong></p><ul><li><p>For students that already have a reasonable competency in drawing fashion with Adobe Illustrator and are looking to take their work to a professional level or for students that have completed the Level 2 Intermediate Illustrator 4 Fashion course.</p></li><li><p>Introduces new panels to increase your design productivity.</p></li><li><p>Producing fashion flats are only part of the design and development workflow. Your designs need to be communicated to the design and buying teams and the supply chain. We’ll look at how to use Illustrator to produce fashion illustrations, design cards and colourway sheets.</p></li><li><p>You will learn how to optimise your files for integration into other supporting product development systems and how to address compatibility issues with legacy versions of Illustrator.</p></li><li><p>Garment drawing workshops.</p></li></ul><p><strong>Learn essential skills required by the fashion industry</strong></p><p>Having spent over a decade implementing and training software technologies into fashion brands and retailers across the globe, I spent a lot of time working with the designers. Over the years there seemed to be a common theme in the design room - lots of designers were using Illustrator proficiently but many either couldn't use it at all or couldn't use it very well. They also didn't adhere to any drawing standards or best practises so had problems such as not being able to easily edit each other's drawings, create colourways quickly or create reusable components properly, making them inefficient. </p><p>Illustrator 4 Fashion training has been specifically tailored for fashion, with the needs of the industry in mind. The training can be taken by company design employees, freelance designers, fashion design students and anyone else looking to learn or improve their fashion drawing with Adobe Illustrator.</p><p><strong>Course Overview</strong></p><p>Most Adobe Illustrator manuals and online training courses are industry generic with many modules not relevant to fashion drawing. It can be hard to know which features to learn and how to develop techniques to draw professional fashion designs. Illustrator 4 Fashion only teaches you features and techniques relevant to drawing fashion flats, illustrations and garment components. </p><p>The Illustrator 4 Fashion course is split into 3 levels; beginner, intermediate and advanced. This level 3 advanced course is all about design productivity and efficiency and how to successfully communicate designs to the extended supply chain including buying and suppliers. Students will learn the final set of advanced tools and techniques to make fashion flats looks as realistic as possible as well as introducing some new panels to increase productivity in a professional environment. To aid design communication, this level also looks at how to use Illustrator to produce fashion illustrations, including how to utilise the tools to achieve realistic fabric drape over a figure. </p><p>From a professional workflow perspective this level also details how to produce the supporting documentation, such as design cards and colourway sheets, needed to communicate designs to colleagues and suppliers. Finally, students will learn how to optimise Adobe Illustrator files for integration into other supporting product development systems and how to address compatibility issues with legacy versions of Illustrator</p><p>Every lecture includes supporting Illustrator work files so that students can follow the lecture exactly.</p>","suitableLearners":["Suitable for fashion design students","Suitable for freelance fashion designers","Suitable for company fashion design employees","Suitable for anyone looking to learn how to draw fashion using Adobe Illustrator"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2019-12-29T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2020-01-01T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83339c9b04f3f624d7ac"],"topics":[],"reviews":[],"meta":{"ratingCount":122,"studentCount":480,"avgRatingScore":4.664592,"contentVideoLength":3367},"basicInfo":{"udemyCourseId":4284786,"slug":"fabrics-for-fashion-design-essential-learning-for-designers","title":"Fabrics for Fashion Design: Essential Learning for Designers","subtitle":"Learn fundamental Categories, Characteristics, Properties of fabric: Developing a Fashion Collection: Fabric Inspiration","image":"https://img-c.udemycdn.com/course/240x135/4284786_526d_6.jpg","price":917370,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["Learning Categories of Fabric Construction: Wovens vs Knits.","Characteristics and properties of the different types of fabrics: Fiber Content.","Choosing the appropriate fabric for a specific design: Top weight vs Bottom weight.","Creating a design using fabric as inspiration: elevate your creativity by letting the fabric inspire you.","Developing a group or collection using a fabric design: How to use fabric color and patterns to develop a collection.","Establishing a Theme for your collection: What is a Theme?","Learning How to Distress and Tie-dye Denim jeans.","Exploring using layers of fabric to create a \"new\" fabric/look."],"requirements":["No requirements necessary, simply a love for fashion and learning the fabrics/textile aspect of it."],"description":"<p>This Course defines the different types of <strong>Fabrics</strong> and how to use them in developing a design, a group, or a collection. In this Course you learn fabric's <strong>Characteristics</strong> and <strong>Properties</strong> and <strong>Categories</strong> such as <strong>Knits</strong>, <strong>Woven and Non-Woven</strong>; analyzing fibers: <strong>Natural</strong> and <strong>Man-Made </strong>Fibers; <strong>Plan</strong>t-based and <strong>Anima</strong>l-based Fibers; and different types of <strong>Weaves</strong>.&nbsp; </p><p>This Course will not only educate you, but also <strong>inspire</strong> you to approach Fashion Designing from a different perspective: using fabrics as a <strong>source of inspiration</strong> to create your designs and develop a group or collection.</p><p>I will show you<strong> (by draping fabrics on a dress form)</strong>, how different fabrics<strong> \"react/behave\"</strong>.</p><p>This Course includes topics such as:</p><ul><li><p><strong>Fiber</strong> Content</p></li><li><p>Natura vs Man-made Fibers</p></li><li><p>Woven vs Knits</p></li><li><p>Different types of weaves: Oxford, Twill, Herringbone, Flannel, Popeline</p></li><li><p>Grainlines: <strong>Warp and Weft</strong></p></li><li><p>Fabric <strong>Nap</strong> as in fabrics such as: Velvet, Corduroy, Velour, Velveteen</p></li><li><p>\"Life\" and Process of fabric: Greige Goods. Finishing Mills. Converters. Vertical Mills. Distributors. Jobbers.</p></li><li><p><strong>Properties</strong> of Fabric: Weight, Drape, Construction, etc.</p></li><li><p>Sustainable and Organic fabrics for an eco-friendly environment.</p></li><li><p>How different Fabrics \"behave\": Chiffon, Canvas/Taffeta, Organza, Felt, Jersey.</p></li><li><p><strong>Color</strong> and its importance in the context of fabric selection</p></li><li><p>Using Fabric as a Source of Inspiration in Designing</p></li><li><p>Choosing a <strong>Theme</strong> for your Collection: What is a Theme?</p></li><li><p>How to <strong>distress Denim</strong> (jeans); as well as creating a <strong>Tie-dye look</strong></p></li></ul><p>Fabric is one of the most important element in fashion designing and learning the different types of fabric is essential in creating a successful collection.</p><p>You will learn how to <strong>distress fabric</strong> (denim) to create a unique and individual fabric surface design. And you'll learn how to <strong>Tie-dye</strong> jeans.</p><p>You will see how designers use several <strong>layers of fabric</strong> to create a \"new\" fabric/look.</p><p>I will also include a <strong>great website</strong> regarding sustainable eco-friendly fabrics, where you can learn in-depth the environment and how the fashion industry effects its health; </p><p>I will include the name of a terrific <strong>Textbook</strong> that has swatches in it, so that you can actually \"touch/feel\" the fabric.</p><p>Choosing a <strong>Theme</strong> when starting a Fashion Collection is important in focusing on a design direction and establishing a cohesive group.</p><p>You will learn the importance of <strong>color</strong> when choosing fabric in designing a collection; the different \"shades\" of a color, known as \"value\", is something that every fashion designer must be familiar with and train the eye to recognize all the subtle difference in color hues. </p><p>If you have taken any of my other Fashion Design Courses, such as Sketching, Draping, Pattern Making, etc. this Fabric Course will add a new and important element to your proficiency in Fashion Designing. </p><p>Most professional fashion designers start with fabric: selecting and choosing the right fabric(s) for their collection. In most cases, fabric is the first step in designing a fashion collection.</p><p>Fabric and Textile: …2 words that are interchangeable, meaning I will be using them in place of each other (they have similar meaning).</p><p>You will see that the textile industry works way ahead of everybody else…. they know what you will be wearing 2-3 years from now….….they have to create new colors… new fibers, etc…</p><p>You will learn about FIBER Content … (what is) Fiber: is a filament, a thread, a thread-like piece, … and we’ll start by dividing Fibers into 2 categories: Natural Fibers… and… Man-Made Fibers</p><p>Starting with Natural Fibers… they also can be broken down into 2 categories: Plant based … and… Animal based Fibers.</p><p>We also have minor categories called Specialty Yarns or Novelty yarns, where the yarn is irregular… on purpose…, or have a unique quality to it… where the yarns might have loops in the middle of the yarn… etc...</p><p>You will learn that when the fabric has been woven or knitted, …that initial piece, that initial roll of fabric is known as GREIGE Goods……. it is RAW fabric so to speak. </p><p>You will learn the different qualities of fabric, such as: weight, drape, durability, softness, construction, breathability, and the \"hand\" of the fabric.</p><p>As fashion designers, we are all conscious and aware of our planet and its environmental issues. We have a moral obligation to protect the environment and promote sustainable development for future generations. Sustainable fabrics… and eco friendly fashion… what does this all mean? Why is this so important?&nbsp; Because the type of fabric used to make a garment, will affect how much damage it causes on the environment.&nbsp; When it comes to pollution, the fashion industry is one of the largest contributors in the world.&nbsp; </p><p>You will be educated in using eco-friendly fabrics that will not hurt the environment, and empower you to make a positive difference in the lives we live and ultimately making a difference in the health of our planet.</p><p>This course will inspire you to be a better designer and at the same time empower to be more conscious of the designing process.&nbsp; You will learn to use the right fabrics for the right use. You will see, for example, how the use of leather (in the manufacturing process) is different from using fabric. </p><p>You will learn how to let fabric be a source of inspiration, by using fabric and through the process of draping, you can create a new design.</p>","suitableLearners":["Beginners and intermediate fashion designers.","Anyone who wants to learn about fabrics, whether you're a designer or a buyer or simply interested in learning a new area of the fashion industry."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-09-07T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-09-10T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83339c9b04f3f624d7ac"],"topics":[],"reviews":[],"meta":{"ratingCount":112,"studentCount":4074,"avgRatingScore":4.719658,"contentVideoLength":7065},"basicInfo":{"udemyCourseId":3455632,"slug":"jewelry-making-how-to-create-and-make-the-basics-in-design","title":"Jewelry Making: How to Create and Make, The Basics In Design","subtitle":"Create Incredible Boutique Quality Gemstone Jewellery To Sell, Gift or Wear! Perfect For Business, Friends & Family","image":"https://img-c.udemycdn.com/course/240x135/3455632_b2d4_8.jpg","price":802670,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["Jewellery Making: For Beginners","Learn to make unique boutique quality gemstone and pearl jewellery to sell, gift or wear.","Make 3 different types of earrings using wire and gemstones ( or your choice of bead) to wear, gift or sell.","Make 3 different styles of bracelets using 3 different stringing materials: 1 charm, 1 elastic and 1 beaded.","Make 3 different styles of necklace: 1 pendant, 1 floating pendant and 1 bold statement beaded necklace.","Inspiration for designs and secrets on making your jewellery standout.","Learn to create basic jewellery making components and how to use them in a way to create your own designs.s","Learn to make a boutique quality cohesive story of jewellery that sits beautifully together."],"requirements":["Patience to learn and fine tune your new skills","Students will need to buy necessary tools and supplies as outlined in the Tools and Components tutorial."],"description":"<p><strong>Welcome to this fantastic beginners online jewellery making class. Come join me in this class to master these skills so that you are able to unleash your creativity within. Once you start with the basics there is no end to where this could take you, there are truly so many benefits.</strong></p><ul><li><p>Learn to repair jewellery quickly</p></li><li><p>Create beautiful gifts for loved ones</p></li><li><p>Make yourself bespoke pieces in minutes</p></li><li><p>Create a jewellery business and work from home</p></li></ul><p>It is so satisfying when you buy a new outfit and wish you could have a pair of earrings, bracelet or necklace to match or give your outfit that pop it needs. I cannot count the amount of times i have quickly whipped up accessories to wear for a special occasion or night out with friends, it is so satisfying that i have made them. Especially seeing the look on an admirers face when you tell them that it was YOU that made them. That always makes me smile and feel proud of myself.</p><p>Another skill this class will teach you is how to repair jewellery. We all have a few pairs of earrings that are missing a hook or a favourite necklace that just needs a clasp replaced. Well after this class you will be able to do exactly that and you'll be amazed how simple it is once you know how. The only thing is you'll have a queue of friends asking you to fix things!!</p><p>You will also be able to make inexpensive gifts for friends and family with your new skill. I have saved a fortune over the years by making my own gifts for my loved ones. Not only is this more special as it is handmade by you with your time and love, you can also personalise the jewellery too, to match an outfit or make a necklace length perfect for them using their favourite gemstone. It's a great gift to have and to use it to give. It also means that you don't need to fight the masses so much at the shops!! It's a win win.</p><p>I must say though that my favourite part of being able to create your own jewellery is that you can live your love and work from home, whether it be a side hustle or launch it into a full time career. It allows you to chose your own hours of work, be creative, have flexibility with family commitments and to do something you love! Who doesn't want that?</p><p><strong>Jewellery making is a wonderful skill to have, practice and grow with so come with me and have some fun while i take you on a journey towards creative freedom.</strong></p><p><strong>You will learn:</strong></p><ul><li><p><strong>How to master the tools</strong></p></li><li><p><strong>What components are</strong></p></li><li><p><strong>What a cohesive jewellery story is</strong></p></li><li><p><strong>About stringing materials</strong></p></li></ul><p><strong>You will learn how to make:</strong></p><ul><li><p><strong>Simple drop earrings</strong></p></li><li><p><strong>Dome stud drop earrings</strong></p></li><li><p><strong>Hoop drop earrings</strong></p></li><li><p><strong>Chain charm bracelet</strong></p></li><li><p><strong>Elastic bracelet</strong></p></li><li><p><strong>Clasped beaded bracelet</strong></p></li><li><p><strong>Pendant chain necklace</strong></p></li><li><p><strong>Floating pendant necklace</strong></p></li><li><p><strong>Bold statement beaded necklace</strong></p><p><br></p></li></ul>","suitableLearners":["Students wanting to create their own jewellery business from home","Creatives looking for a new skill","People who want to make and wear their own unique jewellery"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-06-03T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-06-06T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83339c9b04f3f624d7ac"],"topics":[],"reviews":[],"meta":{"ratingCount":107,"studentCount":613,"avgRatingScore":4.541866,"contentVideoLength":1935},"basicInfo":{"udemyCourseId":2541858,"slug":"business-of-fashion-how-to-write-a-fashion-business-plan","title":"Business of Fashion: How To Write A Fashion Business Plan","subtitle":"How to Develop the Business Side of a Fashion Brand: A Business Plan. Distribution. Marketing. E-Commerce. Social media.","image":"https://img-c.udemycdn.com/course/240x135/2541858_10a8_9.jpg","price":917370,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["Learn how to develop a Business Plan, Manufacturing and Production Process, Marketing and E-Commerce, Print-on-Demand, Vision and Purpose for your Company.","Learn how to take your Collection/Line/Brand and turn it into a money making machine.","Learn the business side of the fashion industry. Creativity alone is not enough; learn to run a successful brand.","Learn how to focus on: Consumer Research and Product Research: Who is your customer."],"requirements":["No requirements or prerequisites."],"description":"<p>A great fashion collection/line is not enough to succeed. Owning your own Company/Brand is a big responsibility— you need a strong <strong>Business Plan</strong> to avoid failure.&nbsp;This Course empowers the you (the student) to turn your designs/company into a financially successful Brand.&nbsp; This Course covers areas on research and development, and the manufacturing process, and how to create your own <strong>Online Store</strong>.&nbsp; It addresses the importance of <strong>Social Media</strong> and all the different platforms. It also includes elements of planning, topics such as <strong>Vision and Purpose</strong> for your brand/business, and your <strong>core values</strong> for your company.</p><p>In this Course you will:</p><ul><li><p>Develop a <strong>Business Plan</strong>: a 6-part/components Plan.</p></li><li><p>Executive Summary and <strong>Budgets</strong></p></li><li><p>Learn <strong>Consumer Research</strong> and Product Research</p></li><li><p><strong>Manufacturing</strong>: Domestic vs Overseas</p></li><li><p><strong>Production</strong> Process</p></li><li><p><strong>Print-on-Demand</strong></p></li><li><p><strong>E-commerce</strong> — Your own Online Store</p></li><li><p>Distribution and <strong>Marketing</strong> channels</p></li><li><p>Online Presence and <strong>Social Media</strong></p></li><li><p><strong>Shopify</strong> and similar platforms</p></li><li><p>Bloggers and <strong>Influentials</strong></p></li><li><p>Reason/<strong>Purpose</strong> for your business</p></li><li><p>Creating a <strong>VISION</strong> for your Company</p></li><li><p><strong>Core Values</strong></p></li><li><p><strong>Quantum thinking</strong> in fashion design</p></li></ul><p>In this Course you will learn how to develop a 6-Part Business Plan that will support the model necessary to establish a successful business.&nbsp; It discusses the many options available nowadays (thanks to&nbsp; the internet) to start your own company from scratch without much financial investment. </p><p>A solid Business Plan is essential is succeeding in the fast paced world of fashion.&nbsp; You must be aware of all the steps and processes of taking your fashion designs from the runway to the streets.&nbsp; You must know the manufacturing process available to you: should you manufacture domestic or overseas.... Nowadays an online presence is so important for the success of a fashion brand - global visibility is not only available to you but it's a must.&nbsp; </p><p>This Course also address the reason and purpose of why you (the designer) do what you do, what is your motivation and purpose.&nbsp; It also touches on the infinite possibilities available if one is aware of one's thoughts and how to direct them to create what we want to create - the sky is the limit!</p><p>In all fashion brands there are always 2 areas of operation: one is the designing process, the sketching, draping, patternmaking, sewing, etc... and the other is the business aspect of it: budgets, cash flow, paying bills, buying fabric, paying contractors, etc... If you want to be successful as a fashion designer you must be aware and have knowledge of both areas, the creative part and the business part.</p><p>The business of fashion is what keeps the engine running. Knowing the nuts and bolts of running in a company is extremely important in the survival of your brand.&nbsp; </p><p>Your fashion brand must have an online presence, whether be your website, your blog, and all your Media platforms. Social media nowadays plays an extremely important role in the success of a brand.</p><p>Creativity alone is not enough, you must have a solid business side or your company will not succeed. Creativity is only one aspect of the design process, the other aspect, and just as important, is how to run a business and manage a budget and allocating the proper cash flow in order to sustain the ups and downs of the brand one the length of time. </p>","suitableLearners":["Anyone interested in learning the business side of a fashion brand.","Anyone interested in making their designs/company into a financially successful Brand.","Anyone interested in starting their own company."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-09-27T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-09-30T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83339c9b04f3f624d7ac"],"topics":[],"reviews":[],"meta":{"ratingCount":98,"studentCount":10580,"avgRatingScore":2.9248326,"contentVideoLength":4275},"basicInfo":{"udemyCourseId":63024,"slug":"fashion-design-create-your-own-fashion-ideas","title":"Fashion Design - Create Your Own Fashion Ideas","subtitle":"A Downloadable WorkBook Is Included In This Video Course","image":"https://img-b.udemycdn.com/course/240x135/63024_89ad_9.jpg","price":1949670,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["This course will cover the basics of fashion illustration for a beginner you will learn basic design skills using templates very fun and easy","In This course You will learn how to create unique Fashion Trend boards","In this course you will learn how to use software to create fashion design illustrations","In this course you will learn how to sketch for beginners a basic body shape template","A Downloadable Workbook Is Included With This Video Course"],"requirements":["this is an online video course - no photoshop or adobe illustrator required You can use free software found online No need to purchase expensive software for this course","Please have your software already downloaded to complete practice sessions and also for the final course project"],"description":"<p>This is a art class for beginners to learn how to create fashion design illustrations using computer software and also templates. We will cover some offline sketching and also how to put your illustrations to a practical use. Anyone will benefit from the course whether you are a beginner and do not know how to draw or if you are a talented artist who would like to learn how to get your designs on the computer without spending alot on expensive software applications. </p><p>A downloadable fashion sketch illustration workbook is included in this course.</p>","suitableLearners":["This course is for beginners and also for anyone who would like to learn computer aided design techniques","Experienced artists are also welcome if you are interested in learning computer aided design ideas"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2017-12-08T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2017-12-11T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83339c9b04f3f624d7ac"],"topics":[],"reviews":[],"meta":{"ratingCount":91,"studentCount":1621,"avgRatingScore":4.305152,"contentVideoLength":2860},"basicInfo":{"udemyCourseId":155076,"slug":"mens-fashion-ultimate-guide-a-womans-perspective","title":"Men's Fashion Ultimate Guide: A Woman's Perspective","subtitle":"This course will take you from amateur to well-dressed. Coming from a lady, this style course is female friendly.","image":"https://img-b.udemycdn.com/course/240x135/155076_6c34_4.jpg","price":458570,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["By the end of the course, you will know what to wear and how to dress better."],"requirements":["Students don't need any previous knowledge coming into this course","The only thing you need is your computer and note pad to take notes!"],"description":"<p>  \t<strong>*Over 1,000 people have taken this course, join them.*</strong>  </p>\n\n<p>  \t<strong>Want to dress better? Well, us girls want you to. This course will take you from fashion newbie to stylish gentleman.</strong>  </p>\n\n<p>  \t           Hey there, I’m Jordyn. I'm a girl that’s tired of seeing guys poorly dressed. I created this course to provide practical style advice, from a woman’s perspective.  </p>\n\n<p>  \t                  Every guy wants to look and feel his best, but when you have a busy life, it’s easy to brush \"fashion\" to the side. Truth is, learning the basics of men’s style isn’t as time consuming as it seems, and this course will get you on the right track.  </p>\n\n<p>  \t<strong>This course was created with love by a lady to provide perspective and advice. This course ensure you’ll always step out in style.</strong>  </p>\n\n<p>  \t <strong></strong>The course will cover must have items, how to wear them, how they should fit, and where to get them.  </p>\n\n<p>  \t <strong>Is this course for you? This course was created for men that...</strong>  </p>\n\n<p>  \t <strong>Are style novices and want to learn the basics. </strong>Do you dread getting dressed each morning just because you don’t know what looks good? Do you fear the first date because you don’t know what to wear to impress? Do you feel completely lost in a department store? After taking this course, you’ll be armed with the skills and knowledge to navigate the shopping mall and the confidence to own your own style.  </p>\n\n<p>  \t <strong>Have a fashion sense but want to refine their personal style. </strong>You have a general idea of what looks good on you, but you want to go deeper than that. You want to learn about outfit pairings and fit. This course will dig into the nitty gritty details you need to become a style expert. It’s time to level up.  </p>\n\n<p>  \t <strong>Only care about what the ladies think. </strong>You could care less if you like it  - all that matters is if the ladies will. I’m here to tell you what we like, what we don’t, what makes us take a second look, and what to avoid wearing if you want our number.  </p>\n\n<p>  \t <strong>Ready to dig in? Let’s get started. </strong><strong>Sign up now to get lifetime access to this course. With Udemy's 30-day money-back guarantee, it's risk-free.</strong></p>","suitableLearners":["Any man that wants to dress better."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2014-02-07T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2014-02-10T00:00:00.000Z"},"promotions":{"discountPrice":298220,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83339c9b04f3f624d7ac"],"topics":[],"reviews":[],"meta":{"ratingCount":80,"studentCount":490,"avgRatingScore":4.153515,"contentVideoLength":4594},"basicInfo":{"udemyCourseId":454644,"slug":"how-to-create-an-impressive-fashion-design-portfolio","title":"How To Create An Impressive Fashion Design Portfolio","subtitle":"A full guide to creating and presenting your fashion portfolio for entry into university, art college or job interviews.","image":"https://img-c.udemycdn.com/course/240x135/454644_21b7_5.jpg","price":458570,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["How to create a fashion design portfolio to enable you to provide visual evidence of your artistic capabilities and distinguished identity","Understand the importance of your portfolio as a communication tool to positively influence universities and employers","Understand what universities and employers want to see in your portfolio in order to help them understand your artistic flare","Know what elements of your work to include in your portfolio and what to exclude","Assess your fashion portfolio against a checklist of essential elements to make your work stand out","Recognise where your fashion design portfolio needs to improve and how to do it","Learn what mistakes to avoid when submitting your work for review."],"requirements":["You should have a realistic artistic talent in the first place as your portfolio displays this talent"],"description":"<p>Follow this course and learn how to create and present your fashion portfolio, so that it will inspire, impress and show off your unique talents to those that see it during university, college or job applications.</p>\n\n<p><strong>Make sure your fashion design portfolio stands out and demonstrates the artistic skills, talents and visual communication abilities you have.</strong><br></p>\n\n\n\n\n\n\n\n\n\n<p><strong>This course will help:</strong></p>\n\n\n\n\n\n\n\n\n\n<ul><li><strong>Fashion students at all levels</strong></li><li><strong>People going through the application process</strong> for a university or college course in fashion design or a fashion related course</li><li><strong>People applying for a job</strong> in the field of fashion where a portfolio is required as part of the interview process</li><li><strong>Mature students, those on a GAP</strong> <strong>year and people in a job</strong> who want to ensure their portfolio is of the best standard it can be</li></ul>\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n<p><strong>After completing the course:</strong></p>\n\n\n\n\n\n\n\n\n\n<p>By successfully completing this course you can ensure that your portfolio works for you and inspires and impresses those that view it, showing off your unique and real talents. It will increase the chances of you landing your fashion design job or entry into the university or college course you dream of.</p>\n\n\n\n\n\n\n\n\n\n<p><strong>Duration</strong> - the course will take about 1.5 hours to complete.</p>\n\n\n\n\n\n\n\n\n\n<p><strong>Structure</strong> - you'll be guided by a tutor who has both fashion design and teaching experience and is a gifted designer in her own right, able to pass on her experience to you.<strong></strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong>Materials</strong> - you will receive complimentary key learning point sheets, a portfolio check-sheet as well as personal goal plans and action planner for use during and after you have completed the course.<br></p>\n\n\n\n\n\n\n\n\n\n<p><strong>Tutor Support</strong> - your tutor is on hand to call upon for any support you need and to help you to make the most of the course and the time and money you have invested.<br></p>\n\n\n\n\n\n\n\n\n\n<p><strong>Student Discussions</strong> - the course includes an opportunity to join in with other students and discussions relating to the creation of your fashion portfolio.</p>\n\n\n\n\n\n\n\n\n\n<p><strong>Life Time Access</strong> - you have lifetime access to the course so there's no need to feel that you have to complete it within a few days. Start and finish when it suits you knowing that if for any reasons you can't complete it in one go you can always finish it later.<br></p>\n\n\n\n\n\n\n\n\n\n<p><strong> A FINAL NOTE:</strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong></strong>The course will not teach you how to draw so if you have no artistic skills or need to develop your fashion drawing techniques then you should choose one of my other courses.</p>","suitableLearners":["Current fashion students at all levels who wish to re-inforce the quality of their portfolios to ensure they maximize the impact it makes when needed","People applying for a fashion design course with a university or college where a portfolio forms part of the application process","People that are applying for a job in fashion design or a fashion related field and where a portfolio is required as part of the job interview","Mature students, those on a GAP year and people in a job who want to ensure their portfolio is of the best standard it can be"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2016-06-17T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2016-06-20T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83339c9b04f3f624d7ac"],"topics":[],"reviews":[],"meta":{"ratingCount":78,"studentCount":457,"avgRatingScore":4.7814956,"contentVideoLength":16528},"basicInfo":{"udemyCourseId":1583584,"slug":"jewelry-design-video-course-23-step-by-step-lessons","title":"Jewelry Design Video Course: 23 Step-by-Step Lessons","subtitle":"FINALLY get all the answers to your questions about Jewelry Design Process.","image":"https://img-c.udemycdn.com/course/240x135/1583584_c439_2.jpg","price":573270,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["This video course is a blueprint for startup jewelry designers and entrepreneurs offering knowledge of the step by step jewelry making process from IDEA to FINISHED PRODUCT","YOU WILL LEARN: How to design jewelry and sell it, the inside secrets of the jewelry industry, how to avoid unnecessary mistakes and expenses, how to find jewelry suppliers."],"requirements":["No jewelry knowledge is required, only the passion to create successful Jewelry Collection","Learn the inside secrets of the jewelry industry with jewelry mentor Aleksander Chuly"],"description":"<p>Good day designers my name is Aleksander Chuly. <strong>I am a jewelry designer and mentor with over 15 years of experience. </strong>I have successfully established several jewelry brands and have created thousands of jewelry designs. I mentor many jewelry designers and have collaborated with them to create their successful jewelry collections.</p>\n\n<p>After years of working with and mentoring designers, <strong>I have discovered a pattern to their mistakes and questions. </strong>There is a complete lack of information for startup designers. This course will help designers <strong>avoid many mistakes and enjoy the creative process.</strong></p>\n\n\n\n<p>This video course is a blueprint for startup jewelry designers and entrepreneurs offering knowledge of the step by step jewelry making process <strong>from IDEA to FINISHED PRODUCT.</strong> I will guide you on where to go for services and <strong>how to save time and money.</strong> I will advise you on <strong>how to avoid overpaying for services. </strong>And how to make sure your design is completed within your timeframe.</p>\n\n\n\n<p>I have included interviews with owners of some of the most successful polishing and casting houses. The owners give their perspective on jewelry designer’s biggest mistakes.</p>\n\n\n\n<p>This video course gives start up designer’s years of experience thereby greatly accelerating your learning process. <strong>Startup designers will avoid many mistakes, thereby saving time, money and frustration.</strong></p>\n\n\n\n<p><strong><br></strong></p>","suitableLearners":["Must see for people who has jewelry design idea, but don’t know where and how to start","This video course will explain and give you step-by-step instructions.","Also great source for designers who has existing jewelry collection and want to improve the design and production process as well as get inside tips and information on jewelry design and manufacturing."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2018-10-29T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2018-11-01T00:00:00.000Z"},"promotions":{"enabled":false}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83339c9b04f3f624d7ac"],"topics":[],"reviews":[],"meta":{"ratingCount":70,"studentCount":670,"avgRatingScore":4.713531,"contentVideoLength":6038},"basicInfo":{"udemyCourseId":1129926,"slug":"how-to-draft-your-pattern-from-an-existing-garment","title":"How To Draft Your Pattern From An Existing Garment","subtitle":"Have you ever had a favourite dress or that vintage sample that you wish you could copy or replicate? Here's my diverse","image":"https://img-b.udemycdn.com/course/240x135/1129926_73f9.jpg","price":458570,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["Learn the tricks of the trade Learn the techniques of how to take patterns from existing garments Look at how to solve tricky problem areas and variations on specific garments  Experience different ways of how to take patterns both flat and by draping it on the garment on the mannequin"],"requirements":["Have a basic understanding about pattern cutting and making "],"description":"<p>I am super excited to deliver this to you.</p>\n\n<p>This course is designed for:</p>\n\n\n\n\n\n\n\n\n\n<p>- Fashion students.\n- Industry professionals. \n- Hobbyists. \n- Fashion enthusiasts.</p>\n\n\n\n\n\n\n\n\n\n<p>We will cover:\n\n- Taking a pattern of a simple vest top</p>\n\n\n\n\n\n\n\n\n\n<p>- Looking at gathers and tucks from a skirt</p>\n\n\n\n\n\n\n\n\n\n<p>- Looking at how to take a pattern of a dart</p>\n\n\n\n\n\n\n\n\n\n<p>- Taking a pattern of a frill</p>\n\n\n\n\n\n\n\n\n\n<p>- A brief overview of an elasticated waistband</p>\n\n\n\n\n\n\n\n\n\n<p>- Comparing your pattern back to your block</p>\n\n\n\n\n\n\n\n\n\n<p>- Taking the pattern of a simple sleeve</p>\n\n\n\n\n\n\n\n\n\n<p>- Using a fun technique by taking a front bodice pattern of a jacket by draping fabric onto the mannequin </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>All of the lectures are delivered by video. The content is a fabulous introduction to the wonderful world of Pattern Cutting &amp; Making. Which is the key skill in garment making. At the end of the course you will be ready to move forward in your pattern cutting journey.</p>\n\n\n\n\n\n\n\n\n\n<p>If you want to enhance your career in one of the most competitive careers on the planet, then this is the course for you. \n\nSee you on the inside. </p>","suitableLearners":["Fashion Students","Industry Professionals ","Aspiring home dress makers ","Pattern Makers ","Pattern Cutters","Fashion lovers"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2017-03-02T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2017-03-05T00:00:00.000Z"},"promotions":{"discountPrice":298220,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83339c9b04f3f624d7ac"],"topics":[],"reviews":[],"meta":{"ratingCount":63,"studentCount":666,"avgRatingScore":4.381773,"contentVideoLength":3688},"basicInfo":{"udemyCourseId":876950,"slug":"screen-printing-made-easy","title":"Screen Printing Made Easy","subtitle":"Learn how to screen print from home, on the cheap, without the need for a dark room.","image":"https://img-c.udemycdn.com/course/240x135/876950_5947_2.jpg","price":458570,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["Create a screen for screen printing without the use of a dark room","Effectively print a custom design onto fabric or t-shirts.","Learn how to care for screens allowing for continued use","Make screen printed designs washable and permeant on clothing or fabric"],"requirements":["Students will need to purchase and/or collect some supplies before beginning ","Student can purchase a pre-made screen or follow along as I show you the steps to create your own.","Student should be able to create a simple design to be transferred onto the screen"],"description":"<p>Learn the skills needed to create a screen using one of your designs and then print it onto t-shirts or fabric at home, without the need for a dark room.</p>\n\n<p><strong>Master Screen-Printing Techniques and Turn Your Original Designs Into Money Making T-shirts.</strong>\n\n  </p>\n\n\n\n<p>·      Learn how to create a screen for printing\n\n  </p>\n\n\n\n<p>·      Discover best printing practices\n\n  </p>\n\n\n\n<p>·      Make designs permanent and able to withstand washing and regular wear and tear\n\n  </p>\n\n\n\n<p>·      Properly clean and care for your screen so you can use it repeatedly \n\n  </p>\n\n\n\n<p><strong> </strong>\n\n  </p>\n\n\n\n<p><strong>Discover How Fast and Easy it is to Print Single-Color Images.</strong>\n\n  </p>\n\n\n\n<p>Learning how to screen print from home gives you the opportunity to create custom clothing for your friends and family or even to start your own business selling t-shirts with your clever and cute designs on sites like Etsy.  \n\n  </p>\n\n\n\n<p>Anyone interested in printmaking, fashion or textile design and the fiber arts will benefit greatly from having screen-printing skills in their arsenal of techniques.  It's a versatile skill that develops a little more each time you move dye across the screen.  With a little practice you will be confident to tackle intricate designs.\n\n  </p>\n\n\n\n\n\n<p><strong>Overview</strong>\n\n  </p>\n\n\n\n<p>Suitable for the beginner, through this course of 12 lectures and an hour of video content, you’ll learn everything you need to print single-color images onto t-shirts or fabric.  \n\n  </p>\n\n\n\n<p>First, I’ll show you the supplies you’ll need to get started and then how to create a padded work surface to attach your fabric or t-shirts to.  Once our workspace is ready to go, I’ll take you through everything you’ll need to know to create a screen using one of your original designs.  I’ll show you how to stretch the screen-printing fabric, attach it the frame and make it waterproof.  Then I’ll demonstrate how to transfer the design and use drawing fluid to block out the areas of the screen that the dye will penetrate, before finally filling the rest of the screen with screen filler—so dye doesn’t end up where it shouldn’t. \n\n  Once you complete this course you will have the know how to create almost any design onto a screen and the confidence to experiment with other print techniques </p>","suitableLearners":["This course is meant for beginners with no prior knowledge about screen printing","Anyone interested in fashion, textile or the fiber arts will benefit from the technique offered in this course","Great for anyone who wants screen print from home","This course is not for someone looking to learn advanced screen printing techniques like, photo emulsion"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2016-06-21T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2016-06-24T00:00:00.000Z"},"promotions":{"discountPrice":298220,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}}]