[{"status":"active","categories":["625e82a09c9b04f3f624d732","625e830f9c9b04f3f624d797"],"topics":[],"reviews":[],"meta":{"ratingCount":7460,"studentCount":63124,"avgRatingScore":4.0899887,"contentVideoLength":305487},"basicInfo":{"udemyCourseId":526534,"slug":"become-a-game-designer-the-complete-series-coding-to-design","title":"Become a Game Designer the Complete Series Coding to Design","subtitle":"Master Unity, 3D game design, 2D game design, coding, C#, game development, 3D animation, programming, level design...","image":"https://img-c.udemycdn.com/course/240x135/526534_04bb_4.jpg","price":1949670,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["Create advanced 2D/3D games and applications","Develop for Nintendo, Xbox, PS4, PC, Mac, iPhone, Android","Have an expert understanding of the Unity game engine","Have an expert understanding of Maya, 3DS MAX and Mudbox","Have an expert understanding of digital painting in Photoshop","Work in game design, film, or software development","Build and publish your own games and apps"],"requirements":["General computer skills","A 3 button mouse will be usefull for moving around 3D space but is not required."],"description":"<p>If you are serious about becoming a game designer, then you already know that you need the most current and complete game design training possible. To succeed in this competitive industry it is essential to have an expert knowledge of the entire game development pipeline. Whether it's your goal to work for a major game studio, or to develop and publish your own indie games, one thing is clear, you will need to be well trained as both a programmer and an artist.<br><br><br>Throughout this extensive training series you will learn beginner to expert level techniques in the areas of 3D game development (Unity), computer animation, digital painting, and programming.</p><p><br><br>You will be learning expert techniques and workflows from veterans who have been working in the game industry for over 15 years and have a passion for making great games.<br><br><br>You will be extensively trained on programs like <strong>Unity</strong>, <strong>Maya</strong>, <strong>3DS Max</strong>, <strong>Mudbox</strong>, and <strong>Photoshop</strong>. Learning powerful tools like these are made easy with fun projects that are designed to take the fear out of learning such advanced software like Unity3D.<br><br><br>Your training will start with Unity, which is a powerful game engine that has been used by countless studios and indie developers all over the world to build some amazing games. Unity's intuitive and user friendly interface is an excellent place to start your path to becoming a game designer. You will start by learning the fundamentals of Unity, giving you a great foundation for you to get excited and confident to move on to more advanced Unity projects which will have you building incredible worlds. In addition to mastering the Unity interface you will be learning how to code in the c# programming language, letting you create any 2D or 3D your imagination can come up with.</p><p><br><br>After you have mastered the Unity game engine it is time to move on and learn how to create your own game assets.</p><p><br><br>You will be using programs like Maya and 3DS Max to model, texture, animate, and render complex 3D models and scenes. And once again you will start of with the basics learning how to create simple low poly models before moving on to advanced digital sculpting techniques in programs like Mudbox. You will then learn how to transfer your 3D models and animations into Unity for game assembly.</p><p><br><br>Finally, you will be moving on to the digital painting section of this master series, where you learn how to digitally paint fantasy worlds, creatures, and characters. And just like all of our previous sections in this master series, you will start off by learning the basics with fun project based lessons, before moving on to more intermediate and advanced digital painting. Even if you feel you don't possess any kind of drawing skills, you need not to fear as this digital painting portion of your training is designed to once again take you from absolute beginner all the way to an advanced level.</p><p><br><br>You have a lot of exciting things to start learning and we are excited to be your guides along the way!<br></p>","suitableLearners":["All skill levels","People interested in working in the game design industy","Please who want to create and publish their own games"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-01-13T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-01-16T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e830f9c9b04f3f624d797"],"topics":[],"reviews":[],"meta":{"ratingCount":6159,"studentCount":32822,"avgRatingScore":4.672147,"contentVideoLength":59089},"basicInfo":{"udemyCourseId":1772094,"slug":"pixel-art-master-course-beginner-to-professionalfreelance","title":"Pixel Art Master Course - Beginner to Professional/Freelance","subtitle":"Learn ALL about pixel art in an always growing course! Get access to basic and pro techniques with daily feedbacks!","image":"https://img-b.udemycdn.com/course/240x135/1772094_5669_4.jpg","price":1949670,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["Learn how to create both SIMPLE and COMPLEX pixel art! Objects, characters, environment, animations - ALL of it!","Build your own game art with prototypes!","Where to find clients, how to talk to them and how much to charge for your work!","You will learn to design and animate pixel art for all game genres (e.g. RPG, Platformer, Top-down)","Get access to Discord server where you can work on real projects with other people"],"requirements":["You need a working PC, preferably with a mouse and a keyboard."],"description":"<p>This course teaches everything about pixel art for video games. From&nbsp;the very&nbsp;basics to the advanced techniques. Students will learn about lines,&nbsp;shapes, color theory and harmony, creating a color&nbsp;palette, designing characters, backgrounds, items, making animation and even how to start freelancing. You will also learn a lot about game design principles. </p><p>If you are new to art or pixel art and want to <strong>create better art for your indie games</strong> then this course is for you.</p><p>This course is <strong>always growing</strong> with <strong>﻿new lessons </strong>(you can check the future planned lessons in a document available on the Discord server). If there is a topic that you would like me to cover, you can message me and I will make it. I am on Udemy and Discord server every day so you can easily get into contact with me. <br></p><p><strong>Discord (2000+ members) </strong>also provides certain <strong>benefits </strong>once you reach a certain role on the server such as getting<strong> access to exclusive channels</strong>. The <strong>wonderful community</strong> there also provides a place for you to share your work, get feedback or even just hang out and chill with people of similar interest!<strong><br>Connect </strong>and work <strong>with other people </strong>on game jams (if you want).<strong> </strong>Yes, even if you want to find <strong>game coders</strong> and <strong>music compositors</strong> (or if you're one who's looking for an artist)!&nbsp;There are also <strong>indie devs</strong> who code and do the art themselves.</p><p><br></p><p>This course will strengthen your foundations in art and pixel art. It will build your confidence in your art and give you the information you need to continue improving your pixel art and <strong>start making money</strong>.&nbsp;</p><p>By the time you finish the course, you will already have a portfolio for different game genres with practical game&nbsp;design.&nbsp;<br></p><p>This course has 3 big parts: beginner [B], intermediate [I]&nbsp;and advanced [A]. Each section is marked with a letter inside square brackets&nbsp;at the end of it's title with corresponding difficulty.</p><p><strong>I am available on Udemy</strong> and Discord<strong> every day</strong> - to give you feedback, to help you overcome your limits, to help you become a better artist in fun and relaxing way. I'm here for you every step of the way if you need me. </p><p>Languages and subtitles: entire course is available in multiple languages. English subtitles have been manually reviewed, fixed and they work properly. Please note that other languages for subtitles have been auto-translated from english language. While I'm aware it's not a perfect solution, it should be of great use. </p>","suitableLearners":["Game developer that wants to learn simple pixel art for games","Beginner pixel artist that wants to become an expert","Experienced pixel artist that wants to expand existing knowledge and learn new skills","Game artist that wants to learn new field of art","Anyone that wants to learn how to communicate in game industry and how to earn money","If you want to join exclusive pixel art community"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-01-08T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-01-11T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e830f9c9b04f3f624d797"],"topics":[],"reviews":[],"meta":{"ratingCount":5069,"studentCount":65617,"avgRatingScore":4.3875866,"contentVideoLength":6215},"basicInfo":{"udemyCourseId":65306,"slug":"adobe-illustrator-mastering-the-fundamentals","title":"Adobe Illustrator: Mastering the Fundamentals","subtitle":"Learn powerful illustration techniques in Adobe Illustrator master digital painting and graphic design with new skills!","image":"https://img-c.udemycdn.com/course/240x135/65306_a9c7_5.jpg","price":1261470,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["To learn Adobe Illustrator from scratch","To learn only the tools and techniques you will actually use"],"requirements":["Adobe Illustrator (free trial or student version are fine)"],"description":"<p>\nThroughout each of the many lessons in this series titled, <em>Illustrator: Mastering The Fundamentals</em>, students are introduced to this powerful vector image creation program, which is a staple for professional designers everywhere. After becoming familiar with the Illustrator's user interface, students will go on to learn step-by-step how simple it is to create complex vector shapes using the powerful tools available within Illustrator.\n </p><p>The team here at School of Game Design have been working in the 3D industry for over 15 years. We have worked for major 3D companies such as Pixologic and have taught classes at major film and game studios like Industrial Light and Magic and Ubisoft. We have a passion for sharing our knowledge of the digital arts with others, and have created hundreds of hours of online training. We have Autodesk and Pixologic certified instructors and self-admittedly are always a student themselves as we never stop learning the latest tools and techniques. </p>","suitableLearners":["Graphic designers","Aspiring graphic designers","Artists","Entrepreneurs"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2018-11-27T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2018-11-30T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e830f9c9b04f3f624d797"],"topics":[],"reviews":[],"meta":{"ratingCount":3299,"studentCount":33267,"avgRatingScore":4.54856,"contentVideoLength":19906},"basicInfo":{"udemyCourseId":1325264,"slug":"ultimate-guide-to-digital-sketching-beginner-to-advanced","title":"Ultimate Guide to Digital Sketching: Beginner to Advanced","subtitle":"Learn to digitally draw like a pro!","image":"https://img-b.udemycdn.com/course/240x135/1325264_6025_3.jpg","price":2064370,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["Digitally sketch from life","Digitally sketch objects and scenes from your imagination","Improve your sketches using digital techniques"],"requirements":["A digital drawing tablet of some sort","A basic understanding of the drawing software of your choice such as Photoshop, or Procreate"],"description":"<p>Join the course and begin drawing today!</p>\n\n<p>Do you want to learn how to digitally sketch images for games and film like an industry pro? Or maybe you’re wanting to branch out and try working digitally? In any case you’ve come to the right place.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>The 'The Ultimate Guide to Digital Sketching: Beginner to Advanced' course will show you how to digitally sketch and draw skilled images that will stand up as professional work. The techniques taught in this course can be translated into any program from Photoshop to Procreate. This course will enhance or give you skills in digital drawing, or your money back!</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>This course is your track to building a solid portfolio of digital art and concept art! Whether for your own portfolio or for client work.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>This course will take you from having little knowledge in how to draw and sketch to creating professional drawings in as little as one week.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>So what else is in it for you?</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>You’ll be taken from basic sketches to creative ideas and drawings, from beginner to expert</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>You’ll gain instant access to all of the course. You can follow along and recreate my drawings or use it as inspiration to draw your own masterpiece.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>The course is setup to quickly take you through step by step, the process of creating digital sketches. It will equip you with the knowledge to create stunning images and concept art!</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>This all comes under one convenient easy to use platform. Plus you will get fast, friendly, responsive support on the Udemy Q&amp;A section of the course or direct message.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>I will be here for you every step of the way!</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>So what are you waiting for? Sign up now to </strong><strong>start creating today!</strong></p>","suitableLearners":["Anyone who wants to sketch and draw better","anyone who wants to learn what brushes to learn when drawing","anyone who wants to learn how to draw digitally","anyone who wants to learn digital techniques to improve your sketches"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2019-11-26T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2019-11-29T00:00:00.000Z"},"promotions":{"discountPrice":298220,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e830f9c9b04f3f624d797"],"topics":[],"reviews":[],"meta":{"ratingCount":3073,"studentCount":21000,"avgRatingScore":4.480272,"contentVideoLength":41732},"basicInfo":{"udemyCourseId":397936,"slug":"pixel-art-for-video-games","title":"Pixel art for Video games","subtitle":"The essential course for creating stunning pixel art graphics for video-games or stylish illustrations and designs","image":"https://img-c.udemycdn.com/course/240x135/397936_513f_3.jpg","price":1605570,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":[" Learn the fundations for creating anything in pixel art","Create solid line work and stunning shading","Learn how to build video-game mockups for your games"," Create create characters and animated them in minutes","Create tiles in the top down RPG style","Drawing pixel art in Isometric view, like an RTS game"],"requirements":["basic Photoshop knowledge is a plus"],"description":"<p>  \t<strong>Imagine how cool your game would look in pixel art!</strong> Stop imagining!  </p>\n\n<p><strong>==== UPDATED 26th of December==== *NEW SECTION* - Color theory</strong></p><p><strong>This section was added by popular demand as something that was missing from the course. Thank you for you patience, I wanted to make sure everything was as good as I could make it. Enjoy!<br></strong></p>\n\n\n\n<p>In this course I'll use my 10+ years of experience to teach you all you need to know to start making your  own pixel art. You'll go from zero to full speed in no time with  simple exercises that will teach you the foundations as  well as advanced concepts that help give your pixel art creations that professional look.  </p>\n\n\n\n<p>  \t                    Featuring <strong>over </strong><strong>6 hours </strong>of footage, you'll be able to follow step by step as I take you through the creation of some really cool pixel art!  </p>\n\n\n\n<p>  \t<strong>You'll learn:</strong>  </p>\n\n\n\n<ul>  \t<li>Configuring Photoshop to draw in pixel art</li>  \t<li>Drawing lines and smooth shapes, such as circles</li>  \t<li>Shading and texture</li>  \t<li>The use of outlines</li>  </ul>\n\n\n\n<p>  \t<strong>And once you get these concepts settled, you'll learn: </strong>  </p>\n\n\n\n<ul>  \t<li>Creating tiles and adding detail to tilled images</li><li>Creating sprites while using a tile grid</li><li>Creating tiles in the style of top-down RPG games</li><li>Creating characters in top-down perspective</li><li>Creating some medieval style hud elements</li><li>Working in isometric perspective</li></ul>\n\n\n\n<p>  \t<em><strong>You'll also:</strong></em>  </p>\n\n\n\n<ul>  \t<li><strong><em>create a CHARACTER   \t</em></strong></li>  \t<li><em><strong></strong></em><em>and </em><strong><em>ANIMATE</em></strong><em><strong> it within minutes!</strong></em></li><li>Learn about color theory<em></em></li>  </ul>\n\n<p>As a bonus round you'll get a chance to create a unity project and actually see your character move and jump around on the screen just like if it was in your video-game </p>\n\n<p>  \t<strong><em>Take this course now and you will see your pixel art skill skyrocket!  </em></strong>  </p>","suitableLearners":["Programmers who want to create art for their video-games","Artists and Designers who love the style of pixel art","Game artists looking to expand their toolset with pixel art"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2018-08-29T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2018-09-01T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e830f9c9b04f3f624d797"],"topics":[],"reviews":[],"meta":{"ratingCount":2419,"studentCount":69797,"avgRatingScore":4.753563,"contentVideoLength":16576},"basicInfo":{"udemyCourseId":867204,"slug":"learn-professional-pixel-art-animation-for-games","title":"Learn Professional Pixel Art & Animation for Games","subtitle":"Become an exquisite pixel artist and animator.","image":"https://img-c.udemycdn.com/course/240x135/867204_c929.jpg","price":1490870,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["Design and build professional pixel art ","Animate your art for games ","Understand shape, color, and value in pixel art"],"requirements":["Photoshop ( you can get the free trial version)","Computer and mouse"],"description":"<p>\nThis\ncourse was last updated on 11/10/16</p>\n\n<p>\nJoin\nthe course and begin designing pixel art games and animation today!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\nDo\nyou want to learn how to create pixel art and animations? Or maybe\nyou’re on a quest to start making money as a game graphic designer?\nIn any case you’ve come to the right place.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\nThe\nLearn Professional Pixel Art &amp; Animation for Games course will\nshow you how to create high quality stylized pixel art and animation\nthat will stand up as professional work. The techniques taught in\nthis course can be translated into just about any asset creation for\ngames. This course will enhance or give you skills in the world of\ndigital art creation - or your money back!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\nThe\ncourse is your track to building amazing attractive pixel art games!\nWhether for your own games or for other peoples projects.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\nThis\ncourse will take you from having little knowledge in Photoshop to\ncreating professional pixel characters, animations, backgrounds, and\nmaps in as little as 1 week.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\nSo\nwhat else is in it for you?</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\n<strong><strong>You’ll\ncreate five different projects in this course that will take you from\nbeginner to expert</strong></strong><strong><strong>!</strong></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\nYou’ll\ngain instant access to all six sections of the course. You’ll also\ngain access to all of my Photoshop files and sprite sheets that I\ncreate though out the course for you to use how ever you like. These\nassets can be used in your own games or just to study and trace over.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\nThe\ncourse is setup to quickly take you through step by step, the process\nof creating pixel art and animating it in Photoshop. It will equip\nyou with the knowledge to create stunning designs and animations for\npixel games!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\n<strong><strong>Don’t\nbelieve me? I offer you a full money back guarantee within the first\n30 days of purchasing the course.</strong></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\nHere’s\nwhat you get with the course:</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\nYou’ll\nget access to the six sections of the course that will show you how\nto design, create, and animate pixel art from the ground up. The\ncourse is supported with over 4.5 hours of clear content that I walk\nyou through each step of the way.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\nAll\nat your fingers tips instantly.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul>\n\t<li>\n<p>\n\tThe\n\tcourse starts with the basics. For those of you that have never used\n\tPhotoshop I’ll walk you through the basic tools we’ll be using\n\tand show you how to set up the program for pixel art creation.</p>\n\t</li><li>\n<p>\n\tNext\n\tyou’ll learn the basics of pixel art, shape, value, and color.</p>\n\t</li><li>\n<p>\n\tOnce\n\tyou’ve learned the basics of pixel art you will build your first\n\ttwo pixel art assets. A wooden crate and a red ruby that you will\n\tthen animate to rotate and sparkle.</p>\n\t</li><li>\n<p>\n\tAt\n\tthis point you’ll be ready to design your first pixel art character\n\tand animate them. You’ll animate three animation cycles. The hover\n\tcycle, run cycle, and jump cycle.</p>\n\t</li><li>\n<p>\n\tNext\n\tyou’ll design and build a background for your character. The\n\tbackground will have multiple levels and also some animated water\n\tfalls.</p>\n\t</li><li>\n<p>\n\tLastly\n\tyou will learn how to build a game map with reusable sprite tiles\n\tand assets. These tiles and assets can be used to create an map you\n\twant.</p>\n</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\nOver\nthe 6 chapters you will learn:</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul>\n\t<li>\n<p>\n\tPhotoshop\n\tbasics</p>\n\t</li><li>\n<p>\n\tThe\n\tpixel art design process</p>\n\t</li><li>\n<p>\n\tValue\n\tand color theory</p>\n\t</li><li>\n<p>\n\thow\n\tto build game props from scratch and animate them \n\t</p>\n\t</li><li>\n<p>\n\tSprite\n\tsheet creation</p>\n\t</li><li>\n<p>\n\tPixel\n\tcharacter design</p>\n\t</li><li>\n<p>\n\tAnimation\n\tCycles</p>\n\t</li><li>\n<p>\n\tBackground\n\tdesign, creation, and animation \n\t</p>\n\t</li><li>\n<p>\n\tGame\n\tmap design and creation \n\t</p>\n</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\nWhat\nelse will you get?</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\n-\nPersonal contact with me, the course tutor</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\n-\nLifetime access to course materials</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\n-\nUnderstanding of how professional pixel artwork is designed, created,\nand organized layer by layer to create a master piece</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\n-\nAll project files created for the course \n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\nThis\nall comes under one convenient easy to use platform. Plus you will\nget fast, friendly, responsive support on the Udemy Q&amp;A section\nof the course or direct message.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\nI\nwill be here for you every step of the way!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\n<strong><strong>So\nwhat are you waiting for? Sign up now to </strong></strong><strong><strong>start\nbuilding your pixel world!</strong></strong></p>","suitableLearners":["Students looking to learn how to create amazing pixel art and animation ","Students ready to put in a couple of hours learning how to do this","Students willing to take action and start creating pixel art","Students wanting to add a new skill to their tool belt"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2016-11-14T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2016-11-17T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e830f9c9b04f3f624d797"],"topics":[],"reviews":[],"meta":{"ratingCount":2242,"studentCount":12955,"avgRatingScore":4.7081795,"contentVideoLength":21292},"basicInfo":{"udemyCourseId":1318732,"slug":"visual-effects-for-games-in-unity-beginner-to-intermediate","title":"Visual Effects for Games in Unity - Beginner To Intermediate","subtitle":"By the end of this course you will have started your own portfolio as a Triple-A Visual Effects artist for Games.","image":"https://img-c.udemycdn.com/course/240x135/1318732_86ee_3.jpg","price":1949670,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["Learn how to create effects for games with Unity.","Fundamental concepts about Visual Effects.","Creating Textures, Meshes and Shaders for Game VFX.","How to structure AAA Visual Effects."],"requirements":["Unity: Basic","Photoshop: Basic","Blender: Basic","Graphic Tablet Helps","Unity 2019.1 Preferably"],"description":"<p>This course is about the creation of VFX for Games with Unity. You'll start learning how to create Magic Spells, Fireballs, Special Skills and more effects for games. It will take you from a Beginner standpoint to an Intermediate level in Game VFX. It contains the theory, the practice and the creative liberty you will need in your future Visual Effects career.</p>","suitableLearners":["VFX Beginner","Unity Beginners","Unreal Beginners","Programmers","Illustrators","3D Generalists","Artists in General","Game Designers"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2019-12-01T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2019-12-04T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e830f9c9b04f3f624d797"],"topics":[],"reviews":[],"meta":{"ratingCount":2118,"studentCount":62395,"avgRatingScore":4.701808,"contentVideoLength":22609},"basicInfo":{"udemyCourseId":707876,"slug":"learn-professional-2d-game-graphic-design-in-photoshop","title":"Learn Professional 2D Game Graphic Design in Photoshop","subtitle":"Learn how you can create your own professional game graphics quickly in Photoshop!","image":"https://img-c.udemycdn.com/course/240x135/707876_9e82_4.jpg","price":1949670,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["Build professional stylized backgrounds from scratch in Photoshop ","Make Money from your new skills","Create your own game graphics"],"requirements":["Photoshop (you can get a free 30 day trial)","Drawing tablet (this makes the process of drawing much easier but is not 100% vital. You can use a mouse)","Basic drawing skills ","Basic understanding of Photoshop"],"description":"<p>This course was last updated on 10/19/16</p>\n\n<p>Join over 10,500 learning students and begin designing game graphics today!</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Looking to make\nextra money as a game graphic designer? Or maybe you’re on a quest\nto create graphics for your own games? In any case you’ve come to\nthe right place.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br>\n\n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The 2D Game\nBackground Creation Course will show you how to create quick high\nquality stylized backgrounds for games and animations that will stand up as professional work. The techniques\ntaught in this course can be translated into prop and character\ncreation. This course will enhance or give you skills in the world of\ndigital art creation - or your money back!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br>\n\n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The course is your\ntrack to building amazing attractive backgrounds and ultimately -\nmake you money! Whether for your own games or for other peoples\nprojects.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br>\n\n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This course will\ntake you from having little knowledge in Photoshop to creating\nprofessional backgrounds in as little as 1 week. \n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br>\n\n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>So what else is in\nit for you?</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br>\n\n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>You’ll gain\ninstant access to all five sections of the course including the bonus\nsection where I show you where and how to find jobs creating digital\nart work that you can do from anywhere in the world.  You’ll also\ngain access to 50 assets I’ve created for your personal and\ncommercial use. These assets can be used over and over again in your\nown games or can be used to help you make money with other peoples\ngames!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br>\n\n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The course is setup\nto quickly take you through step by step, the process of creating a\ndigital background in Photoshop. It will equip you with the knowledge\nto create stunning backgrounds for games and animations. \n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br>\n\n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Don’t believe me?\nI offer you a full money back guarantee within the first 30 days of\npurchasing the course.</strong> \n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br>\n\n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Here’s what you\nget with the course:</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br>\n\n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>You’ll get access\nto the five sections of the course that will show you how I create\nprofessional digital backgrounds and also teaches you where you can\nfind clients. The course is supported with over 2.5 hours of clear\ncontent that I walk you through each step of the way. \n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br>\n\n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>All at your fingers\ntips instantly.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br>\n\n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><ul><li>The course starts\nwith the basics. For those of you that have never used Photoshop I’ll\nwalk you through the basic tools we’ll be using.</li><li>Next I’ll show\nyou how I create my thumbnails and where I go for inspiration.</li><li>Once you’ve\nchosen a thumbnail we’ll design each individual aspect of the\nbackground.</li><li>After you design\neach piece of your background I’ll show you how to stitch them\ntogether to complete the final design.</li><li>At this point\nyou’ll be ready to dive right in and start building the individual\ncomponents that will make up your background! I’ll go over every\nthing from how to create clouds, to building architectural\nstructures.</li></ul></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br>\n\n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Over the 5 chapters\nyou will learn:</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><ul><li> How to use the 50\nassets included in this course</li><li> Photoshop basics</li><li> The design process</li><li> Building your\nassets</li><li> how to find jobs\ncreating digital artwork</li></ul></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br>\n\n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>What else will you\nget?</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br>\n\n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>- Personal contact\nwith me, the course tutor</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>- Lifetime access to\ncourse materials</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>- Understanding of\nhow professional digital artwork is designed, created, and organized\nlayer by layer</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>- 50 free assets for\nyour use</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br>\n\n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This all comes under\none convenient easy to use platform. Plus you will get fast,\nfriendly, responsive support on the Udemy forms and through email.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br>\n\n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I will be here for\nyou every step of the way!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br>\n\n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>So what are you\nwaiting for?  Sign up now to get your 50 free assets and start\nbuilding to day!  </strong></p>","suitableLearners":["Students looking to learn how to create professional 2D game and animation backgrounds in Photoshop.","Students that are thirsty for knowledge about digital artwork creation and are willing to work hard to master there skills.","Students who are ready to grind it out and become a graphic artist. "],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2017-02-09T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2017-02-12T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e830f9c9b04f3f624d797"],"topics":[],"reviews":[],"meta":{"ratingCount":2053,"studentCount":31523,"avgRatingScore":4.490849,"contentVideoLength":19577},"basicInfo":{"udemyCourseId":1239574,"slug":"photorealistic-digital-painting-from-beginner-to-advanced","title":"Photorealistic Digital Painting From Beginner To Advanced.","subtitle":"Bring your imagination to life!","image":"https://img-c.udemycdn.com/course/240x135/1239574_6e76.jpg","price":2064370,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["Students will be able to paint photorealistic digital images."],"requirements":["Have a basic familiarity with a painting software such as Procreate or Photoshop.","Have some basic drawing skills."],"description":"<p>Join the course and begin digitally painting today!</p>\n\n<p>Do you want to learn how to digitally paint images for games and film like an industry pro? Or maybe you’re wanting to branch out and try a new painting style? In any case you’ve come to the right place.</p>\n\n\n\n\n\n\n\n<p>The 'Photorealistic Digital Painting' course will show you how to create photoreal and extremely detailed paintings that will stand up as professional work. The techniques taught in this course can be translated into any program from Photoshop to Procreate. This course will enhance or give you skills in the world of digital painting - or your money back!</p>\n\n\n\n\n\n\n\n<p>This course is your track to building a solid portfolio of realistic digital paintings and concept art! Whether for your own portfolio or for client work.</p>\n\n\n\n\n\n\n\n<p>This course will take you from having little knowledge in how to paint realistically to creating professional paintings in as little as one week.</p>\n\n\n\n\n\n\n\n<p>So what else is in it for you?</p>\n\n\n\n\n\n\n\n<p><strong>You’ll be taken from basic sketches to believable and detailed paintings, from beginner to expert</strong></p>\n\n\n\n\n\n\n\n<p>You’ll gain instant access to all of the course. You can follow along and recreate my painting or use it as inspiration to paint your own masterpiece.</p>\n\n\n\n\n\n\n\n<p>The course is setup to quickly take you through step by step, the process of creating realistic paintings. It will equip you with the knowledge to create stunning images and concept art!</p>\n\n\n\n\n\n\n\n<p>This all comes under one convenient easy to use platform. Plus you will get fast, friendly, responsive support on the Udemy Q&amp;A section of the course or direct message.</p>\n\n\n\n\n\n\n\n<p>I will be here for you every step of the way!</p>\n\n\n\n\n\n\n\n<p><strong>So what are you waiting for? Sign up now to </strong><strong>start creating today!</strong></p>","suitableLearners":["Anyone who wants to learn to digitally paint and render their images in a photorealistic manner.","Anyone who is ready to take their digital paintings to the next level!"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2019-11-26T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2019-11-29T00:00:00.000Z"},"promotions":{"discountPrice":298220,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e830f9c9b04f3f624d797"],"topics":[],"reviews":[],"meta":{"ratingCount":1787,"studentCount":66901,"avgRatingScore":4.643756,"contentVideoLength":27361},"basicInfo":{"udemyCourseId":867218,"slug":"learn-professional-2d-game-asset-graphic-design-in-photoshop","title":"Learn Professional 2D Game Asset Graphic Design in Photoshop","subtitle":"Become an exquisite game designer and start creating game art today!","image":"https://img-c.udemycdn.com/course/240x135/867218_0f53.jpg","price":1949670,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["Design and build professional game assets ","Understand the basics of drawing ","Choose colors for your game art","Digital paint"],"requirements":["Photoshop ( you can get the free trial version)","Computer and mouse (Paper, pencil, and camera will be needed for this)","Drawing tablet (Not required for course)"],"description":"<p>\nThis\ncourse was last updated on 12/17/16</p>\n\n<p>\nJoin\nthe course and begin designing game art assets today!</p>\n\n\n\n\n\n\n\n\n\n<p>\nDo\nyou want to learn how to create game graphics? Or maybe you’re on a\nquest to start making money as a game graphic designer? In any case\nyou’ve come to the right place.</p>\n\n\n\n\n\n\n\n\n\n<p>\nThe\nLearn Professional 2D Game Asset Graphic Design in Photoshop course\nwill show you how to create high quality stylized game graphics that\nwill stand up as professional work. The techniques taught in this\ncourse can be translated into just about any asset creation for\ngames. This course will enhance or give you skills in the world of\ndigital art creation - or your money back!</p>\n\n\n\n\n\n\n\n\n\n<p>\nThe\ncourse is your track to building amazing attractive game assets!\nWhether for your own games or for other peoples projects.</p>\n\n\n\n\n\n\n\n\n\n<p>\nThis\ncourse will take you from having little knowledge in Photoshop to\ncreating professional game design in as little as 1 week.</p>\n\n\n\n\n\n\n\n\n\n<p>\nSo\nwhat else is in it for you?</p>\n\n\n\n\n\n\n\n\n\n<p>\n<strong><strong>You’ll\ncreate </strong></strong><strong><strong>9</strong></strong><strong><strong>\ndifferent projects in this course that will take you from beginner to\nexpert!</strong></strong></p>\n\n\n\n\n\n\n\n\n\n<p>\nYou’ll\ngain instant access to all 7 sections of the course.</p>\n\n\n\n\n\n\n\n\n\n<p>\nThe\ncourse is setup to quickly take you through step by step, the process\nof creating game art in Photoshop. It will equip you with the\nknowledge to create stunning designs and animations for mobile app or\nHTML games!</p>\n\n\n\n\n\n\n\n\n\n<p>\n<strong><strong>Don’t\nbelieve me? I offer you a full money back guarantee within the first\n30 days of purchasing the course.</strong></strong></p>\n\n\n\n\n\n\n\n\n\n<p>\nHere’s\nwhat you get with the course:</p>\n\n\n\n\n\n\n\n\n\n<p>\nYou’ll\nget access to the 7 sections of the course that will show you how\nto design, create, and paint game art from the ground up. The course\nis supported with over 7 hours of clear content that I walk you\nthrough each step of the way.</p>\n\n\n\n\n\n\n\n\n\n<p>\nAll\nat your fingers tips instantly.</p>\n\n\n\n\n\n\n\n\n\n<ul>\n\t<li>\n<p>\n\tThe\n\tcourse starts with the basics. For those of you that have never used\n\tPhotoshop I’ll walk you through the basic tools we’ll be using\n\tand show you how to navigate the interface using hotkeys.</p>\n\t</li><li>\n<p>\n\tNext\n\tyou’ll learn the basics of drawing, shape, perspective, value, and\n\tcolor.</p>\n\t</li><li>\n<p>\n\tOnce\n\tyou’ve learned the basics of asset art you will build your first\n\ttwo assets, a wooden crate. You will be creating two different\n\ttextures for the crate that will teach you two completely different\n\tstyles.</p>\n\t</li><li>\n<p>\n\tAt\n\tthis point you’ll be ready to start replicating artwork from hit\n\tgames such as Rayman and Crossy Road.</p>\n\t</li><li>\n<p>\n\tNext\n\tyou’ll design your own sword and gem buttons that you will digitally\n\tpaint.</p>\n\t</li><li>\n<p>\n\tLastly\n\tyou will get access to the bonus section of the course where you\n\twill learn how to animate a play button in Photoshop.</p>\n</li></ul>\n\n\n\n\n\n\n\n\n\n<p>\nOver\nthe 7 chapters you will learn:</p>\n\n\n\n\n\n\n\n\n\n<ul>\n\t<li>\n<p>\n\tPhotoshop\n\tbasics</p>\n\t</li><li>\n<p>\n\tThe\n\tbasics of drawing</p>\n\t</li><li>\n<p>\n\tValue\n\tand color theory</p>\n\t</li><li>\n<p>\n\tHow\n\tto build game props from scratch \n\t</p>\n\t</li><li>\n<p>\n\tHow\n\tto digital paint</p>\n\t</li><li>\n<p>\n\tHow\n\tto create 6 different styles of game art</p>\n\t</li><li>\n<p>\n\tSprite\n\tsheet creation</p>\n\t</li><li>\n<p>\n\tPhotoshop’s\n\tanimation tool</p>\n</li></ul>\n\n\n\n\n\n\n\n\n\n<p>\nWhat\nelse will you get?</p>\n\n\n\n\n\n\n\n\n\n<p>\n-\nPersonal contact with me, the course tutor</p>\n\n\n\n\n\n\n\n\n\n<p>\n-\nLifetime access to course materials</p>\n\n\n\n\n\n\n\n\n\n<p>\n-\nUnderstanding of how professional mobile app game artwork is\ndesigned, created, and organized layer by layer to create a master\npiece</p>\n\n\n\n\n\n\n\n\n\n<p>\n-\nQuizzes and exercise work sheets</p>\n\n\n\n\n\n\n\n\n\n<p>\nThis\nall comes under one convenient easy to use platform. Plus you will\nget fast, friendly, responsive support on the Udemy Q&amp;A section\nof the course or direct message.</p>\n\n\n\n\n\n\n\n\n\n<p>\nI\nwill be here for you every step of the way!</p>\n\n\n\n\n\n\n\n\n\n<p>\n<strong><strong>So\nwhat are you waiting for? Sign up now to start building your\n</strong></strong><strong><strong>game\n</strong></strong><strong><strong>world!</strong></strong></p>","suitableLearners":["Students looking to learn how to create amazing game art","Students ready to put in a couple of hours learning how to do this","Students willing to take action and start creating game art","Students wanting to add a new skill to their tool belt"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2017-02-28T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2017-03-03T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e830f9c9b04f3f624d797"],"topics":[],"reviews":[],"meta":{"ratingCount":1773,"studentCount":26410,"avgRatingScore":4.57661,"contentVideoLength":18914},"basicInfo":{"udemyCourseId":1208228,"slug":"digitally-painting-light-and-color-amateur-to-master","title":"Digitally Painting Light and Color: Amateur to Master","subtitle":"Learn the fundamentals of light and color and take your art to the next level.","image":"https://img-c.udemycdn.com/course/240x135/1208228_d61c_4.jpg","price":1949670,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["learn how to paint realistic lighting and color schemes.","learn how to paint various lighting conditions.","learn how to understand and interpret real life lighting situations"],"requirements":["you should have a basic understanding of drawing.","Having a digital painting software like photoshop or procreate is useful but not necessary"],"description":"<p><strong>Join the course and begin digitally painting today!</strong></p>\n\n<p>Do you want to learn how to digitally paint beautiful, accurate, and interestingly lit paintings? Or maybe you’re wanting to brush up on what you already know? Perhaps you're a complete beginner and are looking for someplace to start. In any case you’ve come to the right place.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The 'Digitally Painting Light and Color: Amateur to Master' course will show you how to create beautiful and believable paintings that will stand up as professional work. The techniques taught in this course can be translated into any program from Photoshop to Procreate. This course will teach you how to understand and accurately paint light and keep you from getting muddy and dull color palettes. - or your money back!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This course is your track to building a solid portfolio of realistic digital paintings and concept art! Whether for your own portfolio or for client work.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This course will take you from having little knowledge in how to interpret light and apply it to your painting in as little as one week.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>So what else is in it for you?</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>You’ll be taken from basic fundamentals to believable and beautifully lit paintings, from beginner to expert</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>You’ll gain instant access to all of the course and you'll be able to view it for life. You can follow along and view each lecture or use it as a guide book to refer too when you need to brush up on a specific topic.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The course is setup to quickly take you through step by step, the process of creating beautiful colors palettes and accurate lighting. It will equip you with the knowledge to create stunning images and concept art!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This all comes under one convenient easy to use platform. Plus you will get fast, friendly, responsive support on the Udemy Q&amp;A section of the course or direct message. Plus there are over 5 hours of content with 20 downloadable files! You could say this course is pretty lit (pun intended).</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I will be here for you every step of the way!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>So what are you waiting for? Sign up now to </strong><strong>start creating today!</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><br></strong></p>","suitableLearners":["Anyone who wants to master light and color in their paintings.","Anyone who struggles with muddy and unappealing colors.","Anyone who wants to bring life and realism to their art","Anyone who struggles with getting \"gud shading\""],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2019-11-26T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2019-11-29T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e830f9c9b04f3f624d797"],"topics":[],"reviews":[],"meta":{"ratingCount":1728,"studentCount":12327,"avgRatingScore":4.5625405,"contentVideoLength":42048},"basicInfo":{"udemyCourseId":625846,"slug":"learn-blender-3d-modeling-for-unity-video-game-development","title":"Learn Blender 3D Modeling for Unity Video Game Development","subtitle":"Learn to Create or Edit Props, Design Levels, Apply Material and Simple Animations using Blender 3D for Unity Developers","image":"https://img-c.udemycdn.com/course/240x135/625846_e25b.jpg","price":1032070,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["Create your own Unity props with confidence using Blender 3D","Make adjustments to Unity Assets by editing them in Blender","Learn how to make a variety of low-poly models for your video game projects","Learn about applying Materials, Textures & UVs","Basic Animation Techniques for both Unity and Blender","Learn the Blender Features that appeal to video game developers specifically"],"requirements":["Students must have some working knowledge of video game development using Unity.","Student has a respectable background in personal computing.","Student has a drive to want to learn quickly.","The course is taught on a PC/Windows computer, and requires the use of a standard keyboard with numeric keypad, a 3-button mouse with mousewheel and some knowledge of working with game development props, animations, scripts, and graphics.","Students need to exercise some common sense.. for example; download and install Blender without a guide, and without being asked to do so. (The instructor assumes if you can develop video games, you can figure these things out on your own)","Students should expect to watch one lecture at a time and then follow the lecture with a session in Blender."],"description":"<p>This course was designed for Unity developers who want to extend their capabilities to include 3D modeling in Blender. Whether you're interested in designing unique 3D props for your games, building awesome levels, or tweaking your existing Unity Assets, this course can help you get through the learning curve and put you in the driver's seat. You'll learn to Blend like a pro with a good working knowledge of all of the most common tools for editing video game props and level design. We cover all the basic terms, keyboard shortcuts, best practices, time-saving tips, basic animation, assigning uvs, applying materials, textures and more.<br></p>","suitableLearners":["This course is intended for video game developers who want to learn Blender for 3D modeling, texture mapping and simple animations. No previous modeling experience is required. The course is directed towards Unity game developers specifically, but a student could learn what they need from this course for any video game development platform. This is not a course to improve your skills as a programmer or game designer. This course skips over areas of Blender that do not pertain to video game development, and narrows in on just the stuff you want to learn!"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-01-05T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-01-08T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e830f9c9b04f3f624d797"],"topics":[],"reviews":[],"meta":{"ratingCount":1527,"studentCount":7380,"avgRatingScore":4.784582,"contentVideoLength":32636},"basicInfo":{"udemyCourseId":2292199,"slug":"blender-28-game-character-creation","title":"Blender 2.8 Game Character Creation","subtitle":"Learn to Create Game Characters with Blender 2.8 and Unity","image":"https://img-c.udemycdn.com/course/240x135/2292199_5617_3.jpg","price":573270,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["3D Modeling in Blender 2.8","UV Mapping","Texturing and Sculpting","Baking a Normal Map","Rigging a Character in Blender 2.8","Animating a 2D Face with Grease Pencil","Creating Animation Cycles for a Video Game","Exporting a Character and Animations from Blender 2.8 to Unity","Creating a C# Script in Unity to Control a Game Character"],"requirements":["You should have at least a little experience with Blender and Unity","We use all free software in this course: Blender 2.8, the free version of Texture Packer, and the Personal Edition of Unity","The instructor uses a graphics tablet in the texture painting and sculpting sections of the course"],"description":"<p>In this course we’ll create a game character using Blender 2.8, and we'll export it to Unity and configure it so we can control it in the game engine. </p><p>Throughout the course, you will learn:</p><ul><li><p>3D Modeling in Blender 2.8</p></li><li><p>UV Mapping </p></li><li><p>Texturing and Sculpting</p></li><li><p>Baking a Normal Map </p></li><li><p>Rigging a Character in Blender 2.8</p></li><li><p>Animating a 2D Face with Grease Pencil</p></li><li><p>Creating Animation Cycles for a Video Game</p></li><li><p>Exporting a Character and Animations from Blender 2.8 to Unity</p></li><li><p>Creating a C# Script in Unity to Control a Game Character </p></li></ul><p>Beginning with the modeling, we’ll use Blender 2.8 to build all the individual pieces of a Lego character. And then you’ll learn how to UV map each of the parts, and then create an efficient, unified UV map of the entire character. We will use Blender’s texture painting tools to create the clothes of the character, and we’ll use the sculpt tools to create the high res details of the hair. You’ll then learn how to bake a normal map in Blender and apply the textures to the character model.</p><p>Next, we’ll work on rigging the character. We will begin with a single bone, and create the rig manually, so you can see how a character rig is built from the ground up. You’ll learn how to create a Foot Roll Rig and how to use Blender 2.8’s new process for creating Custom Shapes to control the character.</p><p>Once the rig is done, I’ll show you a cool technique, using Blender 2.8’s new Grease Pencil tools, to animate both a 2D drawn face and a 3D body at the same time. With this technique, we will create the character’s Idle, Run, and Jump animations, ready to be used in a game engine.</p><p>You will then learn how to export the character, animations, and textures out of Blender and bring them into the Unity game engine. And here you will learn how to set-up the character in the game and even how to retarget third-party animations onto our character, using Unity’s Humanoid Rig system.</p><p>Finally, we will write a simple C# script to incorporate our 2D and 3D animations, and get the character running around the level.</p><p>If you’ve ever wanted to create a game character, and are interested in getting up to speed in Blender 2.8, then this course is for you. So join me as we create a game character in Blender 2.8.</p>","suitableLearners":["Anyone who would like to create a game character using Blender 2.8 and Unity"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2019-04-24T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2019-04-27T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e830f9c9b04f3f624d797"],"topics":[],"reviews":[],"meta":{"ratingCount":952,"studentCount":18527,"avgRatingScore":4.8399963,"contentVideoLength":48365},"basicInfo":{"udemyCourseId":1934486,"slug":"the-ultimate-guide-to-digitally-painting-everything","title":"The Ultimate Guide to Digitally Painting Everything","subtitle":"A beginners guide to painting anything you can think of","image":"https://img-b.udemycdn.com/course/240x135/1934486_f685_3.jpg","price":2523170,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["Be able to paint dozens of different materials and textures","Be able to paint various lighting situations","Be able to paint various subjects","Be able to solve problems when painting things in the future"],"requirements":["Basic understanding of preferred painting software such as Photoshop, Krita, or Procreate","Basic drawing skills","Painting tablet of some sort such as a a wacom or iPad Pro.","Pressure sensitive stylus","A desire to learn how to paint anything"],"description":"<p><strong>You’ll learn how to paint over 50 different things with new lectures being added every month!</strong><br></p><p>The Ultimate Guide to Digitally Painting Everything will show you how to paint everything from metal, to water and from fur to feathers. This course will enhance or give you skills in the world of digital painting - or your money back</p><p>The course is your track to obtaining digital painting skills like you always knew you should have! Whether for your own projects or to create art as a professional.</p><p>It will take you from having little knowledge in digital painting to painting all manner of subjects textures and materials to work into your finished masterpiece.</p><p>So what else is in it for you?</p><p>You’ll gain instant access to all 7 sections of the course.</p><p>The course is setup to quickly take you through step by step, the process of digital painting dozens of different subjects with easy to follow demos with a downloadable worksheet for each one.</p><p><strong>Don’t believe me? I offer you a full money back guarantee within the first 30 days of purchasing the course.</strong></p><p>Here’s what you get with the course:</p><p>You’ll get access to the 7 sections of the course that will teach you the fundamentals of digital painting from the ground up. The course is supported with over 13 hours of clear content ,with more added every month, that I walk you through each step of the way. Each lecture has a layered paint file for you to use as you follow along with over 50 downloadable resources.</p><p>All at your fingers tips instantly.</p><ul><li><p>The course starts with the basics. You will get a basic understanding of the fundamentals of digital painting. Fundamentals are the most important part of creating professional art. You will learn the basics of lighting, form, color, and edge control.</p></li><li><p>Next you’ll learn how to paint different materials and objects including different types of metal, snow, water, stone, trees, plants and much more!.</p></li><li><p>After that you'll learn how to handle and paint different lighting situations including, underwater lighting and glowing objects.</p></li><li><p>the next section covers how to paint different aspects of animals such as fur, feathers, and shells.</p></li><li><p>Lastly you will learn how to paint the various aspects of humans such as hands, feet, hair, and noses.</p><p><br></p></li></ul><p>What else will you get?</p><p>- Personal contact with me, the course tutor</p><p>- Lifetime access to course materials</p><p>- Understanding of how professional art is created</p><p>- Over 50 exercises and work sheets</p><p>- Access to a private facebook group for students only</p><p>- Exclusive access to all future lectures added monthly covering even more topics</p><p>This all comes under one convenient easy to use platform. Plus you will get fast, friendly, responsive support on the Udemy Q&amp;A section of the course or direct message.</p><p>I will be here for you every step of the way!</p><p><strong>So what are you waiting for? Sign up now and change your art world today!</strong></p>","suitableLearners":["Beginner level digital artists with a basic understanding of their preferred software","Anyone wanting to better their skills as a digital painter","Anyone trying to master painting difficult textures and materials"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2019-11-26T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2019-11-29T00:00:00.000Z"},"promotions":{"discountPrice":367040,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e830f9c9b04f3f624d797"],"topics":[],"reviews":[],"meta":{"ratingCount":941,"studentCount":8391,"avgRatingScore":4.1700077,"contentVideoLength":56511},"basicInfo":{"udemyCourseId":863150,"slug":"unreal-engine-4-learn-to-make-a-game-prototype-in-ue4","title":"Unreal Engine 4 - Learn to Make a Game Prototype in UE4","subtitle":"A complete guide that takes you through every step of building a professional and polished SHMUP game using UE4.","image":"https://img-c.udemycdn.com/course/240x135/863150_a826_3.jpg","price":1949670,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["Gain an understanding of Unreal Engine.","Learn simple - intermediate uses of Blueprints.","Develop an understanding for some preferred game development pipelines.","Build a polished prototype to flesh out into a full game.","Learn to navigate UE4 interface with hands on experience.","An introduction to particle systems.","Applying Audio to a game.","Creating your own Game Mode to manage the game logic.","Programming a player controlled character.","programming different enemies and projectile types.","Programming a simple boss.","A dynamic wave spawning system.","The use of inheritance to help streamline development.","Simple art concepts.","Importing content into the game from various sources.","Learn to use source control.","Implement a save / load system."],"requirements":["An understanding of navigating computer interfaces.","How to install any utilised software."],"description":"<p>This course teaches students how to build a template for a side scrolling&nbsp;shooter (shmup) game and then further build on this by adding a level of polish to the finished template. Students will learn to utilise Blueprints with Unreal Engine 4 as well as some important concepts which have started being referred to&nbsp;as “Game Feel” or “Juice”.<br></p><p>If you have an interest in using UE4 to develop games, learn to program using Blueprints, take a look at a classic arcade style game and learn some important techniques and theories behind making your game stand out from the rest then this course is for you.&nbsp;</p><p>I’ve attempted to structure this course in a way that will allow someone who’s never used UE4 to follow along and learn to navigate the interface as we progress, thus better using&nbsp;your time by avoiding interface specific lectures and allowing&nbsp;the knowledge to&nbsp;become more quickly ingrained via the practical use of everything you learn. </p><p>After covering some of the beginner level content and the interface is familiar the course will progress to cover some more in depth concepts behind Blueprinting and programming such as the powerful benefits inheritance can provide, randomisation and simple procedural generation. </p><p>By the end of this course you’ll have obtained an understanding of the entire development pipeline required to begin prototyping your own ideas. We start from an empty project and cover aspects including&nbsp;some of the ways you can import and adapt assets such as models and textures, techniques to pull content from other UE4 projects and how to implement audio and particle effects to your game.</p>","suitableLearners":["Anyone interested in learning to use UE4.","Beginner to intermediate users of UE4.","People looking to get into game development"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-02-12T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-02-15T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e830f9c9b04f3f624d797"],"topics":[],"reviews":[],"meta":{"ratingCount":890,"studentCount":8325,"avgRatingScore":4.7065783,"contentVideoLength":56811},"basicInfo":{"udemyCourseId":2480224,"slug":"unreal-engine-open-world-landscapes","title":"Unreal Engine:  Open World Landscapes","subtitle":"Master Unreal Engine's Landscape editing tools to create massive environments like in \"Breath of the Wild\"","image":"https://img-c.udemycdn.com/course/240x135/2480224_8e79_4.jpg","price":1949670,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["How to download, install, and setup a project using the Unreal Engine","How to create new landscapes","How to import existing (real world!) landscapes","How to stitch together multiple landscapes to create massive open worlds","How to sculpt mountains, valleys, plateaus, and caves","How to paint a terrain with mud, grass, rock, or snow textures","How to spawn different visual and audio effects based on the surface type a character is traveling upon","How to populate a landscape with grass, flower, bush, and tree foliage","How to populate a landscape with road, fence, and river splines","How to create a day / night cycle","How to add God rays and fog","How to visually profile and debug your landscape's performance"],"requirements":["SUGGESTED: Basic computer knowledge","SUGGESTED: Desktop PC with Windows 7 (or later) 64-bit - OR - a Mac with Mac OS X 10.9.2 or later","SUGGESTED: 8 GB RAM","SUGGESTED: Quad-core Intel or AMD processor","SUGGESTED: DirectX 11 compatible video card","SUGGESTED: Unreal Engine version 4.23 or later"],"description":"<p>In this game design&nbsp;course,&nbsp;<strong>you'll learn how to use Unreal Engine's Landscape and Foliage Editing tools so that YOU&nbsp;can build open world environments like seen in \"Legend of Zelda:&nbsp; Breath of the Wild.\"&nbsp; </strong>Knowing how to use these tools is a critical skill for those aspiring to be Level Designers or Environment Artists!</p><p>This&nbsp;course contains over <strong>110</strong>&nbsp;fun-to-follow&nbsp;video lessons. &nbsp;You'll learn how to:</p><ul><li><p>Download, install, and setup a project in the Unreal Engine</p></li><li><p>Create a new landscape</p></li><li><p>Import existing (real world!) landscapes</p></li><li><p>Stitch together multiple landscapes to create massive open worlds</p></li><li><p>Sculpt mountains, valleys, plateaus, and caves</p></li><li><p>Create a landscape material</p></li><li><p>Paint landscape surfaces with mud, grass, rock, or snow textures</p></li><li><p>Utilize Blueprint Brushes to sculpt and paint a landscape</p></li><li><p>Spawn different visual and audio effects based on the surface type a character is traveling upon</p></li><li><p>Populate a landscape with grass, flower, bush, or tree foliage</p></li><li><p>Populate a landscape with road, fence, and river splines</p></li><li><p>Use numerous Sculpting and Foliage tools within Unreal (including Procedural Foliage tools!)</p></li><li><p>Create a day / night cycle</p></li><li><p>Add fog &amp; God rays</p></li><li><p>Stream sections of your Open World in and out</p></li><li><p>Visually profile and debug your landscape's performance</p></li><li><p>And more!</p></li></ul><p><strong>With the knowledge gained in these video lessons, you will have the necessary&nbsp;skills to&nbsp;start&nbsp;building your OWN open world environments!</strong></p>","suitableLearners":["Beginner Game Designers interested in creating open world games","Beginner Level Artists interested in crafting realistic outdoor environments","Beginners looking to expand their knowledge of Level Design","Beginners looking to expand their knowledge of Unreal Engine's tool sets (Landscape & Foliage Tools especially)"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-11-04T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-11-07T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e830f9c9b04f3f624d797"],"topics":[],"reviews":[],"meta":{"ratingCount":857,"studentCount":2477,"avgRatingScore":4.557171,"contentVideoLength":9786},"basicInfo":{"udemyCourseId":66200,"slug":"introduction-to-game-localization","title":"Introduction to Game Localization","subtitle":"Become a translator, tester or project manager specialized in gamelocalization and get paid for your gaming passion","image":"https://img-c.udemycdn.com/course/240x135/66200_2b89_8.jpg","price":1949670,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["Examine the challenges you’ll face in each stage of the game localization process and choose where you’d like to work","Compare the pros and cons of working in-house or as a freelancer and select your ideal lifestyle","Learn how to spend more time translating and less worrying about technical issues","Improve your creativity and let your words take players on a rollercoaster of emotions","Learn to write professional bug reports and how to polish a translation until it’s perfect"],"requirements":["Some language skills in a language other than English","Microsoft Excel (any version) or any other spreadsheet software for exercises"],"description":"<p>  \t<strong style=\"\">If you play localized games, this probably sounds familiar&hellip;</strong>  </p>  <p>  \t          You&rsquo;re playing your favorite game on a rainy winter afternoon. &ldquo;Cool graphics! Amazing playability! Killer music! Stunning action! Wait a minute&hellip; What&rsquo;s with all the spelling mistakes? That text doesn&rsquo;t make sense! Who on earth translated this game!? I could&rsquo;ve done a better job myself!&rdquo;  </p>  <p>  \t<strong style=\"\">Engage players in the game story</strong>  </p>  <p>  \t          Learn the basic concepts behind game localization and specialize as a <strong style=\"\">game translator, linguistic tester </strong>or <strong style=\"\">game localization project manager</strong>.  </p>  <br style=\"\"/>  <p>  \t          Here&rsquo;s what you&rsquo;ll learn:  </p>  <ul style=\"\">  \t<li><strong style=\"\">Stages of the game localization process<br style=\"\">  \t</strong>Introduction to game internationalization, the game translation process, different review methods, the importance of linguistic testing.<strong style=\"\"> </strong>Examine the challenges you&rsquo;ll face in each stage and decide which part of the process you&rsquo;d like to work on!<br style=\"\">  \t <br style=\"\">  \t</li>  \t<li><strong style=\"\"></strong><strong style=\"\">Differences between working in-house and as a freelancer<br style=\"\">  \t</strong>Learn how to get acquainted with the game you&rsquo;ll be translating, what reference material looks like, how to report queries, and examine general rates and salaries before you establish your own. Compare pros and cons, and select your ideal lifestyle!<br style=\"\">  \t<br style=\"\">  \t</li>  \t<li><strong style=\"\"></strong><strong style=\"\">The technical aspects<br style=\"\">  \t</strong>Get a handle on translating texts with codes, conquer those dreaded variables and learn how not to exceed character limitations. All with real examples and plenty of practical exercises! Spend more time translating and less worrying about technical issues!<br style=\"\">  \t<br style=\"\">  \t</li>  \t<li><strong style=\"\"></strong><strong style=\"\">Translation and transcreation<br style=\"\">  \t</strong>Translating a game is nothing like translating software, laws or contracts. It&rsquo;s actually great fun! (That&rsquo;s the brotherhood&rsquo;s best kept secret: you&rsquo;ll get paid for doing something fascinating!). You&rsquo;ll have a blast learning how to define characters by how they speak, and translating names, character descriptions and even songs and poems! Improve your creativity and let your words take players on a rollercoaster of emotions!<br style=\"\">  \t<br style=\"\">  \t</li>  \t<li><strong style=\"\">Game localization testing<br style=\"\">  \t</strong>You&rsquo;d be amazed by the amount of errors that appear when the translated text is implemented in the game. This module teaches you to identify the main types of linguistic bugs and to write straightforward, useful and professional reports. Contribute to a successful translation by reporting bugs and improvements to polish the text until it&rsquo;s perfect!</li>  </ul>  <p>  \t          Are you ready to become a game localization professional? Then insert coin and&hellip; Let&rsquo;s rock!  </p>","suitableLearners":["Translators looking to specialize in game localization","Project managers looking to expand their game localization knowledge","Developers looking to improve their internationalization processes and localize games","People who love games and languages","Anyone with an interest in the game industry looking to expand their job options "],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-07-30T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-08-02T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e830f9c9b04f3f624d797"],"topics":[],"reviews":[],"meta":{"ratingCount":675,"studentCount":4580,"avgRatingScore":4.112476,"contentVideoLength":48562},"basicInfo":{"udemyCourseId":1906034,"slug":"introduction-to-unreal-engine-4-ability-system-ue4","title":"Introduction to Unreal Engine 4 Ability System - UE4","subtitle":"How to create 5 comprehensive game play abilities","image":"https://img-c.udemycdn.com/course/240x135/1906034_aa3a_2.jpg","price":1376170,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["Create Comprehensive and Manageable Gameplay Abilities in Unreal Engine 4","Gain Medium Level Understanding of UE4's C++ and Date Types.","Gain Medium Level Understanding of UE4's Animation System","Gian Basic Understanding of UI setup in UE4"],"requirements":["Basic Understanding of Unreal Engine 4","Basic Skill in C++","Will Power to Create Games"],"description":"<p>In this course, we will walk you thought the process of using UE4's ability system to create 5 fully featured abilities. we will start with simple concept and gradually go to more and more complicated setups. Animation, UI, AI, will all be introduced through the process.</p><p><strong>Covered Topics:</strong></p><ul><li><p>Unreal Engine Ability Sytem</p></li><li><p>Animation Blueprint</p></li><li><p>UI Widget Blueprint</p></li><li><p>Cascade</p></li><li><p>AI Behavior Tree</p></li><li><p>UE4 C++</p></li></ul><p><strong><em>UE4 Version: 4.20</em></strong></p>","suitableLearners":["Game Developer, Students or hobbyist"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2019-06-20T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2019-06-23T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e830f9c9b04f3f624d797"],"topics":[],"reviews":[],"meta":{"ratingCount":643,"studentCount":4194,"avgRatingScore":4.4728765,"contentVideoLength":84697},"basicInfo":{"udemyCourseId":1656244,"slug":"character-modeling-texturing-for-game-complete-pipeline","title":"Character Modeling & Texturing For Game - Complete Pipeline","subtitle":"Learn to sculpt, retopo & texture an animation ready character for game in Zbrush, Maya, Topogun and Substance Painter.","image":"https://img-c.udemycdn.com/course/240x135/1656244_15f7_10.jpg","price":1949670,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["Character Modeling & Sculpting in Zbrush","Retopology in Maya, Topogun & Zbrush","UV Unwrapping in Maya","Baking Maps in Substance painter","Texturing in Substance painter","Rendering in Substance Painter"],"requirements":["This course is for beginners so there isn't any prior knowledge required. you can start from scratch.","You need to install Zbrush, Maya, Topogun and Substance painter for follow along.","You need to have a pen tablet for sculpting.","You need to have a strong desire and patients to learn these topics because it's a 23 hour's long course."],"description":"<p><strong>                                                                                                          STUDENT REVIEWS</strong></p><ul><li><p>Stratis<strong> </strong>: <strong><em>One character course to rule them all... Finally someone to take us from A to Z , from concepting to a textured animation ready model. This is answering many hobbyist questions on the professional pipeline sequence (and doesn`t shy away from the most overlooked topic of them all: topology) Well done!  </em></strong></p><p><br></p></li><li><p>Edgar Y : <strong><em>Amazing course. The essentials are in-depth, well covered &amp; will enable you to create production-ready portfolio characters. Looking forward to more of your courses you'll be making in the future &amp; keep up the excellent work.  </em></strong></p><p><br></p></li><li><p>John T. Meredith<strong> </strong>: <strong><em>This is an excellent course. Learned things I had not seen any where else. Very clear and point by point step by step. Superior.</em></strong></p><p><br></p></li><li><p>Alexandre MEAUX<strong> </strong> :<strong> <em>Incredible course ! This course provide ALL the possible ways to create something. It's absolutely not frustrating and you really feel the progress along the course. The Q&amp;R is really helpful and satisfying. Loving this really ! Don't hesitate  </em></strong></p><p><br></p></li><li><p>Jeff Thorne : <strong><em>This is a fantastic course! Nalini takes you from beginning to end of a great project. He shows you multiple ways of modeling to help you make your own choice. A great instructor. I will purchase all of his courses on Maya/Zbrush. Thanks Nalini for a great course.  </em></strong></p></li></ul><p>                                                                                                     <strong>MORE REVIEWS LIKE THIS</strong></p><p><br></p><p><strong>COURSE DESCRIPTION :</strong></p><p>Hi, Welcome to Character Modeling &amp; Texturing For Game - Complete Pipeline Course.</p><p>In this course you will Learn to sculpt, retopo &amp; texture an animation ready character for game in Zbrush, Maya, Topogun and Substance Painter.    </p><p><strong>Do you want to learn the full process to make a character for game ? if so then this is the course for you.</strong></p><p><br></p><p><strong>Welcome and Instructor Intro </strong></p><p>My name is Nalin, I am a 3d Modelling and Texturing Artist and Educator.</p><p> I have been teaching since 2008 at various Institution such as ZICA, Reliance Education and Arena Animation. I have also worked as a Character Modelling and Texturing Artist at Lakshya Digital and Dhruva Interactive.<br></p><p><strong><br></strong></p><p><strong>Benefits</strong></p><p>At the end of the course, you will be able to create beautiful looking characters for game using Zbrush, Maya, Topogun and Substance Painter.</p><p><strong> </strong></p><p><strong>List of Major Components</strong></p><ul><li><p>Modeling and Sculpting Characters Using Zbrush</p></li><li><p>Retopology using Maya, Topogun &amp; Zbrush</p></li><li><p>UV Unwrapping in Maya</p></li><li><p>Texturing Characters and Props Using Substance Painter</p></li><li><p>Baking Maps</p></li><li><p>Rendering in Substance Painter</p></li></ul><p>Let’s see how the course is designed and what’s there for you. There would be 13 modules.<br></p><p><strong>1st module -</strong> you will learn Zbrush from scratch,  Sculpting and poly painting basics by working on a small stylized head project.</p><p><strong>2nd module - </strong>I am going to start the main character project and you will learn how to start and block in the character from scratch using dynamesh and zsphere.</p><p><strong>3rd module - </strong>you will learn how to block in the clothing of the character using different method I use in production.</p><p><strong>4th module - </strong>you will learn how to define the face features and  making it look beautiful.</p><p><strong>5th module -</strong> you will learn how to sculpt stylized hair using zmodeler and some specific brush.</p><p><strong>6th module -</strong> I will show you how to sculpt stylized clothing wrinkles.</p><p><strong>7th module -</strong> you will learn all about modelling and sculpting hard surface object zmodeler, dynamesh and some other Technics</p><p><strong>8th module -</strong> you will learn Maya Basics and this module is for absolute beginners.</p><p><strong>9th module -</strong> I will do the character retopology in Maya, Topogun and Zbrush. We are going to start with Maya retopo and here you will learn how to use Quad draw tool for retopology. And then I am going to switch to Topogun a specialized retopo software, and you are going to learn it’s magical tools to retopo your character with speed. Then we are going to see how we can also use Zbrush to create low poly    </p><p><strong>10th module -</strong> you are going to learn character UV unwrapping using Maya 2018 new tool set. Here I am going to show you various ways to unwrap and some new powerful tools. And finally we are going to create the UV layout.</p><p><strong>11th module -</strong> , I am going to start baking various maps such as Normal, Ambient occlusion, Curvature, position, thickness and Color ID map using Substance painter. I am also going to show you how to eliminates any errors in those maps.</p><p><strong>12th module -</strong> we are going texture the character inside substance painter. First I am going to start with the very basics of the software and then I am going to texture the clothing, you are going to learn how to create leather jackets. Later I am going to make the character look a little dirty by adding a dirt layer. then I am going to work on the skin and the make up on the face and we are going to paint the eyes next. Then I will put some metal materials on the hard surface parts. Then you will learn how to create glowing emmisive parts. And finaly we are going to render our character with iray.</p><p><strong>13th module -</strong> then in the final module, I am going to conclude and wrap up the course.\n  </p><p><strong><br></strong></p><p><strong>Ideal Students </strong></p><p>I have designed this course keeping beginners in mind but it can be very useful for intermediate to advance character artist and students who wants to create their own characters from start to finish but struggles with it because they lack step by step guidance.</p><p><strong><br></strong></p><p><strong>Thank you</strong></p><p>Feel free to check out the course outline below to see everything that is included in this course.\n\n  </p><p>There is a 30 days money back guaranty. Which means if you aren’t satisfied with the course then you can refund it within 30 days. So literally there isn’t any risk at all, so go ahead and click on the enroll button. I can’t wait to see you creating 3d characters for game.</p><p>This is Nalin, I thank you for enrolling to the course and I will see you in the first lecture. </p><p><br></p><p>Regards,</p><p>Nalini kanta jena</p><p><br></p>","suitableLearners":["Beginner to intermediate level 3d students and artists who wants to learn the full pipeline to create characters for game."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2018-08-05T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2018-08-08T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e830f9c9b04f3f624d797"],"topics":[],"reviews":[],"meta":{"ratingCount":597,"studentCount":12591,"avgRatingScore":4.7541275,"contentVideoLength":51068},"basicInfo":{"udemyCourseId":1490022,"slug":"the-complete-environment-painting-super-course","title":"The Complete Environment Painting Super Course","subtitle":"Learn to Draw and Paint Environments from Imagination","image":"https://img-c.udemycdn.com/course/240x135/1490022_ea3b_3.jpg","price":573270,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["Drawing in, and understanding perspective","Rendering objects realistically and methodically","Color theory and Lighting fundamentals","Painting full detail landscapes step by step from start to finish","drawing environments and painting from imagination"],"requirements":["Photoshop OR Drawing Software","Wacom Drawing Tablet OR iPad Pro (with apple pencle) OR equivalent equipment","Basic Knowledge of how your drawing software works (i.e. work layers, change brushes, undo, change brush size etc)"],"description":"<p>The Complete Environment Painting Super Course will give you a total introduction to digital painting landscapes and environments. Or your money back.</p><p><br></p><p>Throughout this course, you’ll be taught the art and design skills you always wanted to learn. Whether you’re just learning as a hobbyist, or you plan on becoming a professional digital illustrator or concept artist. This is the perfect course for you.</p><p><br></p><p>Throughout this course you’ll be going through over 13 hours of live narrated content, over 30 lectures, and 55 downloadable resources. First I’ll be bringing you through the very basics of perspective, then shading and rendering, and finally drawing and painting your very own beautiful scenes and backgrounds from scratch.</p><p>Here’s what you’ll get in this course:</p><ul><li><p><strong>Instant</strong> access to all 30 lectures, in 7 sections.</p></li><li><p><strong>over 13 hours</strong> of live, narrated content where I’ll be bringing you through every step in real time.</p></li><li><p>Full money back guarantee within 30 days of purchasing the course!</p></li></ul><p><br></p><p>The course is laid out in an easy to understand format:</p><ul><li><p>First I’ll be teaching you the fundamentals of perspective. We’ll go through 1 and 2 point perspective, offering the same assignments that I had when I was a student in some of the top design schools.</p></li><li><p>After that, I’ll be teaching you the importance of lighting and how to shade and render the basic elements that create everything. Spheres, Cubes, Cones, and Cylinders. These are the elements that make up almost everything around us.</p></li><li><p>Next you’ll be learning about color theory and which colors to choose for your shadows and lights. Color is an essential part of establishing the mood in a painting.</p></li><li><p>After this you’ll be combining the basic forms in order to bring what we’ve learned so far together and make some recognizable scenes.</p></li><li><p>Next we move on to jumping straight into building our first scene. You’ll start by drawing out a line work and setting up the perspective exactly how I taught you in the perspective lessons. We’ll focus on composition and object placement to make the most of the space in our canvas. Focusing heavily on setting up our image to achieve a feeling of depth, which is one of the most important things in environment painting.</p></li><li><p>After this we refine the sketch to further enhance the idea. Redrawing it and making sure all of our elements are in place before painting.</p></li><li><p>Next we’ll begin by roughly painting the main colors in. Figuring out what color everything is as well as how things change color the further they get away. Applying what we learned earlier in the color theory into some real painting situations.</p></li><li><p>Lastly after we get the main elements of our painting established. Our colors in place, and everything set up. We’ll start detailing the painting and adding all the little elements that bring the painting to life. Painting grass, wood, fencing and trees.</p></li><li><p>In the next session we’ll do another line work. Starting rough and working cleaner. I’ll teach you to draw on top of a 3 point perspective grid.</p></li><li><p>This painting will be started by first finding all of our shadows before we start with colors. It’s important to know our shadows and lighting before we start adding details.</p></li><li><p>After this the next few hours are spent adding tons and tons of detail. I’ll be explaining how high detail images are really just a series of decisions made over and over and is actually quite simple. By the end of this section you’ll be a master of detail!</p></li></ul><p><br></p><p><br></p><p>Throughout this entire course you’ll be learning:</p><ul><li><p>How to use perspective and understand it</p></li><li><p>How to choose great and lively colors</p></li><li><p>How to render and shade objects realistically</p></li><li><p>Starting a sketch</p></li><li><p>Finishing a sketch</p></li><li><p>Starting a painting</p></li><li><p>finishing a painting</p></li><li><p>adding lots of details</p></li><li><p>tips and tricks on painting, drawing, environments, etc</p></li><li><p>tons of live narrated drawing</p></li><li><p><strong>over 50 downloadable resources</strong>!</p></li><li><p><br></p></li></ul><p><br></p><p>Other Benefits:</p><ul><li><p>You’ll also be getting access to the Q&amp;A section</p></li><li><p>Lifetime access to all the course material.</p></li><li><p>Contact with me, your instructor</p></li></ul><p><strong>Sign up today and take the next step to growing as an artist!</strong></p>","suitableLearners":["Anyone who wants to learn how to draw and paint! Especially those who have an interest in drawing from imagination","Anyone who wants to up their drawing and painting level."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2020-06-15T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2020-06-18T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}}]