[{
        "status": "active",
        "categories": [
            "625e82a09c9b04f3f624d732",
            "625e82bb9c9b04f3f624d746"
        ],
        "topics": [],
        "reviews": [],
        "meta": {
            "ratingCount": 38356,
            "studentCount": 146133,
            "avgRatingScore": 4.675529,
            "contentVideoLength": 101773
        },
        "basicInfo": {
            "udemyCourseId": 1643044,
            "slug": "graphic-design-masterclass-learn-great-design",
            "title": "Graphic Design Masterclass - Learn GREAT Design",
            "subtitle": "The Ultimate Graphic Design Course Which Covers Photoshop, Illustrator, InDesign,Design Theory, Branding and Logo Design",
            "image": "https://img-b.udemycdn.com/course/240x135/1643044_e281.jpg",
            "price": 1949670,
            "lan": "en",
            "level": "all",
            "currency": "vnd",
            "isFree": false
        },
        "details": {
            "objectives": [
                "Have a deep understanding of typography, color theory, photos, layout, blocking and other design theory and skills",
                "Understand and learn the essential tools and capabilities of Adobe Photoshop, Illustrator and InDesign",
                "Create logos and branding packages for potential clients",
                "Learn photo editing and manipulation in Adobe Photoshop",
                "Master the pen tool, shape builder tool and other essential vector design tools in Adobe Illustrator.",
                "How to create editorial spreads and magazine layouts using Adobe InDesign",
                "Understand solid logo design and ad design principles to create compelling campaigns and logos",
                "Work through the entire package design process",
                "Learn non-destructive editing techniques in Adobe Photoshop",
                "Work through an event flyer design to understand strong type hierarchy, balance and overall design layout",
                "Learn a few of the upcoming design trends for 2022 and how to create them!",
                "Learn the history of fonts and typefaces and how to pair fonts",
                "Learn the basics of Affinity Designer and learn the difference between Adobe Illustrator and Affinity Designer",
                "Work through a 7 page vector tracing worksheet and feel confident creating a complex vector illustration by the end of this worksheet",
                "NEW! Learn how to work with multiple page layouts in Adobe InDesign and create a cookbook cover and book",
                "NEW! Learn the step-by-step process to becoming a graphic designer",
                "NEW! Learn how to work with Photoshop Mockups to create great presentations",
                "NEW! Learn word mapping and brainstorming techniques to increase your creativity in logo design and branding projects",
                "NEW! Learn the Double Exposure Effect in Adobe Photoshop",
                "NEW! Create Vector Art in Adobe Illustrator",
                "NEW! Learn How to Encourage and Spark Creativity",
                "NEW! How to create YouTube thumbnails and social media graphics",
                "NEW! How to properly give and receive critiques and feedback",
                "NEW! Understand how to create 3d objects and typography in Adobe Illustrator",
                "NEW! Discover the latest 2022 updates to the Adobe software and understand the new artificial intelligence filters and tools",
                "NEW! Learn how to predict future design trends and complete projects that use the most up to date trends"
            ],
            "requirements": [
                "Access to Adobe Photoshop, Illustrator & InDesign (Or Affinity Designer, Affinity Photo, Affinity Publisher as an Alternative).  I will be using the Adobe Creative Cloud versions, but those with older version can still get a lot out of this class. Those wanting to take the course with Affinity products will find some tools and names do differ so Adobe is preferred.",
                "If you use Adobe products, I highly suggest using versions CS6 or higher to have a more smooth experience with the course, but not a requirement.",
                "Software not Included"
            ],
            "description": "<p><em>As you can see, this course is updated</em><strong><em> frequently</em></strong><em> with new lessons, projects and resources!</em></p><p><em>January 2022 - </em><strong><em>NEW Section! </em></strong>Design&nbsp;Trends 2022!<strong><em>&nbsp;</em></strong>We will figure out how to predict future design trends and create three projects! &nbsp;<em><br>November 2021 - </em><strong><em>NEW Sections! </em></strong>Adobe Photoshop and Illustrator 2022 update lessons and Adobe Illustrator 3D class Project!&nbsp;<em><br>June 2021 - </em><strong><em>NEW Lesson! </em></strong>How to properly give and receive critiques and feedback <em><br>April 2021 -</em><strong><em>&nbsp;NEW!</em></strong> Section on how to create&nbsp;YouTube Thumbnails!&nbsp;<em><br>March 2021 -</em><strong><em>&nbsp;NEW!</em></strong> Video on How to Encourage and Spark Creativity<em><br>March 2021 - </em><strong><em>NEW!&nbsp;</em></strong> Section on&nbsp;The Double Exposure&nbsp;Effect in&nbsp;Adobe Photoshop 2021!<br><em>March 2021 - </em><strong><em>NEW!&nbsp;</em></strong> Section creating vector art in&nbsp;Adobe Illustrator 2021 using the new repeat tool and the blend tool. <br><em>February 2021 - </em><strong><em>NEW!&nbsp;</em></strong> Detailed section on Adobe Photoshop Photo editing basics - New projects added!&nbsp;<em><br>January 2021 - </em><strong><em>NEW!&nbsp;</em></strong> 2021 Design&nbsp;Trends Section with three new student projects!&nbsp;<br><em>November 2020 - </em><strong><em>NEW!&nbsp;</em></strong> 16 page History of Typography Guide, 16 Page Color Theory Guide and 8 Page Font&nbsp;Pairing&nbsp;Guide!<em><br>October 2020 - </em><strong><em>Updated Lessons!&nbsp;</em></strong> Photoshop 2021 Neural Filter and Liquify Tools <em><br>August 2020 - </em><strong><em>Updated Lessons!&nbsp; </em></strong>Logo Design and Branding Project <em><br>July 2020 - </em><strong><em>NEW!&nbsp; </em></strong>How to work with Photoshop&nbsp;Mockups!&nbsp;<em><br>June 2020 - </em><strong><em>NEW!&nbsp; </em></strong>How to&nbsp;Become a Graphic&nbsp;Designer 14 page Resource Guide and&nbsp;Lessons!&nbsp;&nbsp;<br><em>May 2020 - </em><strong><em>NEW!&nbsp; </em></strong>InDesign&nbsp;Portfolio&nbsp;Builder&nbsp;Template!&nbsp;&nbsp;<em><br>April 2020 - </em><strong><em>NEW!&nbsp; </em></strong>Entirely new Adobe InDesign&nbsp;Section including a cookbook project<em><br>April 2020 - </em><strong><em>NEW!&nbsp; </em></strong>Color Theory - Exploring Color Palettes Section<br><em>March 2020 - </em><strong><em>NEW! </em></strong><em>A Guide to My Favorite Fonts and Where to&nbsp;Download Them <br>Jan 2020 - </em><strong><em>NEW! </em></strong><em>Lessons:&nbsp;2020 Design&nbsp;Trends: and how to create them<br>Nov 2019 - </em><strong><em>NEW!</em></strong><em> - </em><strong><em>Adobe Illustrator introduction and tools section </em></strong><em>(vector tracing worksheet)<br>Nov 2019 - </em><strong><em>NEW!</em></strong><em> - </em><strong><em>Photoshop section and Projects </em></strong><em>(including a new youtube thumbnail and book cover project)<br>Oct 2019 - </em><strong><em>NEW!&nbsp; </em></strong>11 page downloadable resource - The Guide to Grids <em><br>Oct 2019 - </em><strong><em>NEW!&nbsp; </em></strong>Color Theory and Color Harmony Lessons +&nbsp;new Downloadable Resources<em><br>July 2019 - </em><strong><em>NEW!&nbsp; </em></strong>Affinity Designer&nbsp;Section! Learn The Basic Tools and Differences Between Adobe Illustrator And Affinity Designer<em><br>May 2019 - </em><strong><em>NEW! </em></strong><em>Downloadable Resources -&nbsp;the Anatomy of Typography poster and the Psychology of Color graphic!&nbsp;<br>April 2019 - </em><strong><em>NEW </em></strong><em>Lessons: </em>Finding Your Graphic Design Niche and Focus!</p><p><strong>Graphic Design Master Class - Learn GREAT Design</strong></p><p>Do you want to learn all the skills and techniques you need to create incredible designs?&nbsp;</p><p>Do you want to know the process of creating <strong>logos</strong> and<strong> branding packages?</strong>&nbsp;</p><p>Are you intimidated by learning <strong>photoshop, illustrator or InDesign</strong> and want to learn through practical <strong>real world&nbsp;projects?</strong> Than This class will be for you!&nbsp;</p><p>We will extensively review <strong>Typography, color theory, layout and composition, how to use photos in design, photo manipulations and editing and magazine layout design</strong>,&nbsp;<strong>branding and logo design</strong>&nbsp;just to name a few.&nbsp;</p><p>We also learn the basics of <strong>Adobe Photoshop, illustrator and InDesign </strong>and do projects with real world applications. Every designer needs to know and master these programs and this course makes sure you know the essential tools to power through amazing projects.&nbsp;</p><p>In <strong>Adobe Photoshop,</strong> we will review photo editing and manipulation techniques like how to cut objects out, duotones, changing color on objects, the liquify tool and we will create a compelling YouTube thumbnail with our newly learned photoshop skills as well as an entire book cover design project.&nbsp;</p><p>In <strong>Adobe Illustrator</strong>, we will master the pen tool by hand tracing simple and complex shapes. We will explore the power of the shape builder tool and In the end of this section, we will design a<strong> complete logo design</strong>. There is an entirely new introduction and tools section that has been added where we work through a<strong> 7 page vector tracing worksheet</strong> and in the end create a complex vector illustration using our newly learned illustrator vector tools. Lastly, we will put together an <strong>event flyer </strong>to practice our layout skills, and even work through the<strong> branding process and create a logo</strong>, business card and letterhead for a business. </p><p>We will will&nbsp;create a magazine layout in <strong>InDesign</strong> and learn the master pages tool to drastically speed up your design workflow when working with multiple paged layouts.&nbsp;</p><p><strong>We will talk about branding basics, what makes a good logo? How do you extend your logo or brand to other marketing materials?&nbsp;</strong></p><p>I designed this extensive course to be gentle enough for new comers to design but detailed enough for everyone to get a <strong>TON </strong>out of this course.</p><p><br><strong>New Mini-Course Added!&nbsp; <br>Discover Your&nbsp;Design&nbsp;Niche!&nbsp;</strong><br><br><strong>Do you want to find out what design niche you should concentrate on?</strong> This is an exploratory mini-class added to the&nbsp;Graphic Design&nbsp;Masterclass course on&nbsp;Udemy (Section 15)&nbsp;that helps you find your next focus and explore many wonderful options for budding and established designers.</p><p>We are going to review some main core design categories and talk about what types of projects you will do and also what you will need to learn to leap into those design niches. <br><br>There are always more niches to discover but we will focus on the following in this mini-class:<br><br><strong>Logo Design<br>Print &amp; Editorial Design<br>Pattern Design and Illustration<br>Package Design<br>Branding Design<br>UX/UI Design<br>Social Media/Digital Graphic Designer</strong></p><p>By the end of this class you will have a solid grasp of what each design niche entails. You will have confidence in choosing your top three focal niches to<strong> kickstart or enhance your design offerings and know what to learn next.</strong></p>",
            "suitableLearners": [
                "Anyone interested in creating compelling and GREAT design.",
                "Those interested in learning Photoshop, Illustrator and InDesign (Affinity Designer Too!)",
                "Those wanting to understand graphic design basics and theory paired with real world projects and applications",
                "Those looking to learn logo design and branding techniques and execution",
                "Anyone wanting to become a graphic designer part-time or full-time, or those who need design skills to elevate their current careers.",
                "Those looking for a solid graphic design foundations course with the depth of an intermediate level course",
                "Those wanting to learn the basics of Affinity Designer and learn the difference between Adobe Illustrator and Affinity Designer"
            ],
            "sections": []
        },
        "messages": {
            "welcome": "",
            "congratulations": ""
        },
        "history": {
            "createdAt": "2022-02-10T00:00:00.000Z",
            "createdBy": "622c1f382e96f2828a7dae2d",
            "publishedAt": "2022-02-13T00:00:00.000Z"
        },
        "promotions": {
            "discountPrice": 275280,
            "startAt": "2022-01-31T17:00:00.000Z",
            "endAt": "2023-01-31T17:00:00.000Z",
            "enabled": true
        }
    },
    {
        "status": "active",
        "categories": [
            "625e82a09c9b04f3f624d732",
            "625e82bb9c9b04f3f624d746"
        ],
        "topics": [],
        "reviews": [],
        "meta": {
            "ratingCount": 31150,
            "studentCount": 141422,
            "avgRatingScore": 4.580099,
            "contentVideoLength": 48192
        },
        "basicInfo": {
            "udemyCourseId": 1197206,
            "slug": "illustrator-2022-masterclass",
            "title": "Illustrator 2022 MasterClass",
            "subtitle": "Master Adobe Illustrator with this in-depth training for all levels.",
            "image": "https://img-c.udemycdn.com/course/240x135/1197206_7201_4.jpg",
            "price": 2293770,
            "lan": "en",
            "level": "all",
            "currency": "vnd",
            "isFree": false
        },
        "details": {
            "objectives": [
                "Designing logos",
                "Creating vector illustrations",
                "Turning photographs into vector artwork",
                "Vectorizing and colorizing traced hand drawings",
                "Preparing graphics for web and print",
                "Designing infographics",
                "Working with type in creative ways",
                "Mastering advanced Illustrator tools and techniques",
                "Learn useful keyboard shortcuts and best practices",
                "Practice everything you learn with provided Exercise Files",
                "Test your knowledge with quizzes at the end of each chapter",
                "Learn Illustrator from the start the way a professional would use it"
            ],
            "requirements": [
                "Any version of Adobe Illustrator, preferably not older than Illustrator CS6. Ideally Illustrator CC (Creative Cloud).",
                "Prior knowledge is not needed",
                "Exercise Files and Study Guides are provided"
            ],
            "description": "<p><strong>Udemy’s best-selling Illustrator course</strong> – by one of the Top 10 Adobe Instructors in the world – teaches you to use this industry-leading vector graphic application as a creative professional. The whole course content, including examples, techniques, exercises and quizzes have been carefully selected and refined to offer the most efficient and enjoyable way to master Adobe Illustrator.</p><p>This course has been purposely designed for users of all experiences, from complete beginners to existing Illustrator users, who want to take their skills to the next level. Being able to confidently work in Illustrator is an essential skill for any Graphic Designer or Illustrator, but it is an equally useful tool for Product Designers, Fashion Designers, UI/UX designers and various other areas within and outside of the creative industry.<br></p><p><em>“The course has great content, well explained and having you feeling confident with the software at the end.”<br>James Pope<br></em></p><p><strong>More about Adobe Illustrator: </strong></p><ul><li><p>Illustrator is the industry-standard vector graphics application that lets you create logos, icons, sketches, typography and complex illustrations for print, web, interactive, video and mobile devices. </p></li><li><p>Its time saving features allow users to create work quickly and efficiently at the highest professional standard. &nbsp;</p></li></ul><p><br></p><p><strong>A closer look at what you will learn: </strong></p><ul><li><p>We will start with the basics, so you feel totally at ease with the interface, preferences, setting up new documents. We will also cover fundamental principles like the difference between vector and pixel graphics.</p></li><li><p>The next two chapters will teach you everything you need to know about working with objects in Illustrator. These are the buildings blocks of all vector graphics so these initial lessons will help you to understand and work with more complex tools later on.</p></li><li><p>Next up, in the drawing section of the course, master drawing modes, the Pen tool, Curvature tool and all the different ways you can draw and manipulate paths.</p></li><li><p>Next learn about the different types of Brushes and how to make the most of their unique features. You will also learn how to create your own custom brushes.</p></li><li><p>In the next chapters you will learn about tracing photographs with a powerful feature called Image Trace and everything you need to know about adding type to your illustrations.</p></li><li><p>Once you are comfortable with all of that you can move onto the Advanced Techniques section, which will introduce more complex features like Symbols, Graphs, Gradient Meshes, Perspective Drawing, Recolor Artwork and workflows like Masking.</p></li><li><p>Finally, discover how to correctly export your work for print and screen, and ways to share and archive your projects.</p></li></ul><p><br></p><p><em>“An outstanding course! I've taken many Udemy courses where the instructor just rambles on, or circles around the same point several times. But here, every word uttered is part of the lesson. No fluff, no uhms, no nonsense. With that level of focus, it's very easy to follow, learn and remember.”&nbsp; Laurie Knapp</em></p><p><br></p><p><strong>This course includes:</strong></p><ul><li><p>94 Videos (12 hours of total playtime)</p></li><li><p>Interactive quizzes testing what you learnt in each chapter</p></li><li><p>Downloadable working files</p></li><li><p>Course content updated with the latest 2022 new features</p></li><li><p>All future updates to Illustrator will be included in this course for no extra payment</p></li><li><p>Estimated finish time: 25 hours (including finishing all exercises and quizzes)</p></li><li><p>Preparation guide for the official Adobe Certified Associate exam: Graphic Design &amp; Illustration using Adobe Illustrator</p></li><li><p>Completion certificate upon finishing the entire course</p></li></ul><p><br></p><p><strong>Martin is an Adobe Certified Instructor </strong>–<strong> </strong>voted as one of the Top 10 Adobe instructors in the world – with years of experience teaching in classrooms, seminars and webinars. He also worked professionally in the creative industry for over 10 years on a wide range of projects for clients such as Disney, Accenture, Mattel, etc.</p><p><br></p><p><em>“This course includes really great and useful practical exercises for each chapter. I also enjoyed the quiz at the end of each chapter as you learn the things explained in more depth. Seriously, there's nothing I would've wanted to change about this course. A great masterclass for beginners to learn fast and start being a graphic designer.”<br><br>Jessica Mueller</em></p><p><br></p><p><strong>Who will find it useful:</strong></p><ul><li><p>Perfect for anyone looking to start or develop their career in the creative industry.</p></li><li><p>Complete beginners will be able to master the software from the very beginning to the most advanced features. </p></li><li><p>Self-taught users and existing professionals can use the course to take their skills and knowledge to the next level, refine their workflows and learn to do everything the right way!</p></li><li><p>Existing and more experienced users of Illustrator may also discover hidden gems and workflows or catch up with all the new features released in 2022.</p></li></ul><p><br></p><p><strong>Skills you will gain:</strong></p><ul><li><p>Producing vector graphics for print and screen</p></li><li><p>Using all the time-saving features of Illustrator and work efficiently</p></li><li><p>Designing logos and brand identities for clients</p></li><li><p>Creating vector illustrations, infographics and icons</p></li><li><p>Tracing scanned drawings and sketches and turning them into scalable vector graphics</p></li><li><p>Producing repeatable patterns for product packaging, apparels and stationaries.</p></li></ul><p><br></p><p>Ready to master and create brand new work with confidence in Adobe Illustrator? Enroll on this course and let’s get started.</p><p><br></p>",
            "suitableLearners": [
                "This course is aimed at anyone who wants to get into the creative industry and gain a rock solid foundation of Illustrator.",
                "Although it is providing a beginner to intermediate level learning experience it can be useful for experienced Illustrator users too as there are many self-taught users who are missing out on a lot of techniques and features."
            ],
            "sections": []
        },
        "messages": {
            "welcome": "",
            "congratulations": ""
        },
        "history": {
            "createdAt": "2021-10-27T00:00:00.000Z",
            "createdBy": "622c1f382e96f2828a7dae2d",
            "publishedAt": "2021-10-30T00:00:00.000Z"
        },
        "promotions": {
            "discountPrice": 321160,
            "startAt": "2022-01-31T17:00:00.000Z",
            "endAt": "2023-01-31T17:00:00.000Z",
            "enabled": true
        }
    },
    {
        "status": "active",
        "categories": [
            "625e82a09c9b04f3f624d732",
            "625e82bb9c9b04f3f624d746"
        ],
        "topics": [],
        "reviews": [],
        "meta": {
            "ratingCount": 26076,
            "studentCount": 149730,
            "avgRatingScore": 4.674048,
            "contentVideoLength": 55212
        },
        "basicInfo": {
            "udemyCourseId": 1046722,
            "slug": "ultimate-adobe-photoshop-training-from-beginner-to-pro-2022",
            "title": "Ultimate Adobe Photoshop Training: From Beginner to Pro 2022",
            "subtitle": "Master Adobe Photoshop CC 2022 without any previous knowledge with this easy-to-follow course",
            "image": "https://img-c.udemycdn.com/course/240x135/1046722_cbd7_6.jpg",
            "price": 1949670,
            "lan": "en",
            "level": "beginner",
            "currency": "vnd",
            "isFree": false
        },
        "details": {
            "objectives": [
                "Design icons, business cards, illustrations, and characters",
                "Clean up face imperfections, improve and repair photos",
                "Use creative effects to design stunning text styles",
                "Remove people or objects from photos",
                "Cut away a person from their background",
                "Master selections, layers, and working with the layers panel"
            ],
            "requirements": [
                "No previous knowledge of Photoshop required.",
                "If you have Photoshop installed, that's great. If not, I'll teach you how to get it on your computer."
            ],
            "description": "<p><strong>- MASSIVE GIVEAWAY:&nbsp;OVER 300 PREMIUM PSD FILES FOR MY STUDENTS!</strong><br>- NEW: cheat sheets for every single lecture so you can easily review the information;<br>- the course is mostly version independent so you don't have to use Photoshop CC&nbsp;2022, but <strong>it is recommended!</strong>;<br>This is the ultimate Photoshop training course that will take you from&nbsp;absolute beginner&nbsp;to&nbsp;proficient Photoshop user&nbsp;in no time at all.</p><p><strong>Learn how to use Photoshop with ease while having fun!</strong> &nbsp; </p><p>My approach is simple: we focus on real world cases and I present the best techniques that require minimal effort yet produce maximum results. All the lessons are focused on getting the job done in the least amount of time possible. I'll be using the latest version of the program -&nbsp;<strong>Photoshop CC 2022</strong>, but I explain my workflow for all users,&nbsp;<strong>no matter what version you have installed</strong>. </p><p><strong>What will you learn?</strong>&nbsp; &nbsp; </p><ul><li><p><strong>Customize the program to best suit you</strong>&nbsp; &nbsp;</p></li><li><p><strong>Get the best Photoshop version</strong></p></li><li><p><strong>Create new projects and share your work</strong>&nbsp; &nbsp;</p></li><li><p><strong>Master layers and the layers panel</strong>&nbsp; &nbsp;</p></li><li><p><strong>Move, select, and edit layers</strong>&nbsp; &nbsp;</p></li><li><p><strong>Work with the Pen Tool like a pro</strong> &nbsp; </p></li><li><p><strong>Create and modify shapes</strong> &nbsp; </p></li><li><p><strong>Design flat illustrations</strong>&nbsp; &nbsp;</p></li><li><p><strong>Create and animate emojis</strong> &nbsp; </p></li><li><p><strong>Remove skin issues and retouch portraits</strong>&nbsp; &nbsp;</p></li><li><p><strong>Design&nbsp;business cards</strong> &nbsp; </p></li><li><p><strong>Create app icons</strong> &nbsp; </p></li><li><p><strong>Design&nbsp;cute characters</strong>&nbsp; &nbsp;</p></li><li><p><strong>Manipulate and repair photos in creative ways</strong>&nbsp; &nbsp;</p></li><li><p>… and so much more!&nbsp; &nbsp;</p></li></ul><p>The most important thing about this course: it's the foundation to any designer. After you finish it, you can decide if you want to specialize in: web design, app design, graphic design, retouching, photo manipulation, and so on. You'll have a lot of possibilities, it's up to you to choose what you like the most.</p><p><strong>Why is this course different?</strong>&nbsp; &nbsp;</p><ul><li><p>Progressive difficulty: we start slow and we build our way up &nbsp; </p></li><li><p>Tons of activities, exercises, and challenges &nbsp; </p></li><li><p>Cheat sheets you can review to refresh your memory&nbsp; &nbsp;</p></li><li><p>Impeccable sound and video quality&nbsp; &nbsp;</p></li><li><p>Quality instructor support: I respond to most questions in under 12 hours&nbsp; &nbsp;</p></li><li><p>All lectures are straight to the point - minimal effort, maximum results &nbsp; </p></li><li><p>Learn by working, not by memorizing!&nbsp; &nbsp;</p></li></ul><p>By the end of this course you will be able to use the program with ease. You'll feel in control as you pursue and complete more ambitious projects. Whether you are contemplating a career change, considering freelancing opportunities, or developing a personal hobby, get started today on your Photoshop journey! </p>",
            "suitableLearners": [
                "This course is perfect for beginner-level Photoshop users.",
                "If you’re an intermediate or advanced user, please check out my curriculum especially the practice activities and assignments to see if this course is a good fit for you.",
                "This course is not for students who want to learn about one particular topic in depth, for example, painting with brushes in Photoshop. Instead, this is a comprehensive course that gives you a solid foundation on all the major topics in Photoshop."
            ],
            "sections": []
        },
        "messages": {
            "welcome": "",
            "congratulations": ""
        },
        "history": {
            "createdAt": "2022-03-27T00:00:00.000Z",
            "createdBy": "622c1f382e96f2828a7dae2d",
            "publishedAt": "2022-03-30T00:00:00.000Z"
        },
        "promotions": {
            "discountPrice": 275280,
            "startAt": "2022-01-31T17:00:00.000Z",
            "endAt": "2023-01-31T17:00:00.000Z",
            "enabled": true
        }
    },
    {
        "status": "active",
        "categories": [
            "625e82a09c9b04f3f624d732",
            "625e82bb9c9b04f3f624d746"
        ],
        "topics": [],
        "reviews": [],
        "meta": {
            "ratingCount": 25480,
            "studentCount": 97790,
            "avgRatingScore": 4.7450533,
            "contentVideoLength": 40187
        },
        "basicInfo": {
            "udemyCourseId": 1747782,
            "slug": "adobe-photoshop-cc-essentials-training-course",
            "title": "Adobe Photoshop CC – Essentials Training Course",
            "subtitle": "This Adobe Photoshop Essentials course will teach you Photoshop Retouching as well as Photoshop for graphic design.",
            "image": "https://img-c.udemycdn.com/course/240x135/1747782_399b_3.jpg",
            "price": 1949670,
            "lan": "en",
            "level": "all",
            "currency": "vnd",
            "isFree": false
        },
        "details": {
            "objectives": [
                "You will be able to start earning money from your Photoshop Skills.",
                "You will be able to add Photoshop to your CV",
                "You will have over 20 of your own projects to add to your portfolio.",
                "You will create social media post images for Facebook, Instagram, Twitter, Pintrest & Youtube.",
                "You will be able to mask anything… including the dreaded hair!",
                "Clearcut images.",
                "Create amazing typography.",
                "You will create popular visual styles.",
                "You will create distorted images.",
                "You will create graphics from scratch.",
                "You will retouch photographs like a professional.",
                "You will create a postcard.",
                "Create posters.",
                "Create advertising.",
                "Resize Images.",
                "Build a flyer.",
                "Change the color or images.",
                "Fix the colors in photographs",
                "You will change eye & hair colors.",
                "You will combine 2 photographs to create amazing compositions.",
                "You will put a storm in a tea cup.",
                "You will create text that looks like stone.",
                "You will build a logo with type that wraps around it like a badge.",
                "You will create text that wraps around a woman.",
                "You will build a multipage banner advertising project.",
                "You will create more background in an image from thin air.",
                "You will remove people from images.",
                "You will remove graffiti from a wall.",
                "You will clear cut images of people, shoes & other products.",
                "You will create realistic shadows",
                "You will create text the wraps around colored smoke.",
                "You will build duotone images like the Spotify effect",
                "You will create images with an anaglyph effect",
                "You'll turn your images into realistic oil paintings",
                "You'll know how to add halftone effects to your images.",
                "You will bend images to reveal background images.",
                "You will distort a logo to bend around real life photographs and objects.",
                "You retouch an overweight person to make the appear slim.",
                "You'll build spray paint style graffiti using brushes.",
                "You'll make a galaxy appear out of a mans head.",
                "Create paper cut effects inside of a font.",
                "Build text with 3D paint dripping from it.",
                "You'll retouch a face to move pimples & freckles.",
                "You'll remove dust & scratches from an old photograph.",
                "Change yellow teeth to white teeth.",
                "You'll build a fantasy image where you put an island, ocean & clouds inside a small bottle."
            ],
            "requirements": [
                "Adobe Photoshop, preferably the latest CC (Creative Cloud) version.",
                "No prior knowledge or experience with Photoshop is required"
            ],
            "description": "<p>Hi there, my name is Dan Scott. I am an Adobe Certified Instructor (ACI) for Photoshop. </p><p>Are you struggling to learn Photoshop on your own? This course will allow you to use Photoshop professionally. You will be able to add Photoshop to your CV &amp; start getting paid for your Photoshop skills. </p><p>In this course I will teach you everything you need to know about getting started with Photoshop. You'll learn how to use Photoshop for use in Graphic Design &amp; for Photoshop Retouching. You will create lots of your own projects that you can add to your own portfolio to help your employment. </p><ul><li><p><strong><em>David: </em></strong><em>\"AMAZING course Dan! Thank you so much for sharing your skills with us!! Your teaching style is very professional and easy to understand. I feel comfortable with the skill set you've given me to handle small projects now. I've already purchased your Advanced Training Course in Photoshop and can't wait to dive in!! Thanks again!</em></p></li></ul><p>This course is for beginners. You do not need any previous knowledge of Photoshop, photography or design. We will start right at the beginning and work our way through step by step. </p><p>You will learn the Photoshop 'secret sauce' whereby we will magically enhance our background and when necessary completely remove people from images.</p><p>There are exercise files available to download so that you can follow along with me in the videos. There are lots of assignments I will set so that you can practice the skills you have learned. </p><ul><li><p><strong><em>Simon: </em></strong><em>\"I just finished the Adobe Photoshop Essentials Training Course and I want to say I totally loved it! For me, a person who had zero experience in using Photoshop this course was very helpful to get into the graphic design area with a lot of interest and fun. This course is very good structured - from easy to hard topics. Also it has a lot of detailed explanations and really fun practical tasks. I've got all I needed for starting to work on my own first graphic design projects. And again, Daniel is just a great teacher! His teaching style is awesome and I am really glad I picked his courses for learning my new profession. With Daniel it's really fun and interesting journey.\"</em></p></li></ul><p>If you have never opened Photoshop before or you have already opened Photoshop and are struggling with the basics, follow me and together we will learn how to make beautiful images using Photoshop.</p>",
            "suitableLearners": [
                "Anyone who wants to start using Photoshop in their career & get paid for their Photoshop skills.",
                "Newbie's, amateurs, graphic designers, motion graphics artists, Illustrator users, and any creatives who want to design their own graphics and edit their own photos from scratch"
            ],
            "sections": []
        },
        "messages": {
            "welcome": "",
            "congratulations": ""
        },
        "history": {
            "createdAt": "2021-11-15T00:00:00.000Z",
            "createdBy": "622c1f382e96f2828a7dae2d",
            "publishedAt": "2021-11-18T00:00:00.000Z"
        },
        "promotions": {
            "discountPrice": 275280,
            "startAt": "2022-01-31T17:00:00.000Z",
            "endAt": "2023-01-31T17:00:00.000Z",
            "enabled": true
        }
    },
    {
        "status": "active",
        "categories": [
            "625e82a09c9b04f3f624d732",
            "625e82bb9c9b04f3f624d746"
        ],
        "topics": [],
        "reviews": [],
        "meta": {
            "ratingCount": 20420,
            "studentCount": 81331,
            "avgRatingScore": 4.7371297,
            "contentVideoLength": 34305
        },
        "basicInfo": {
            "udemyCourseId": 1514258,
            "slug": "adobe-illustrator-cc-essentials-training-course",
            "title": "Adobe Illustrator CC - Essentials Training Course",
            "subtitle": "Learn Adobe Illustrator CC graphic design, logo design, and more with this in-depth, practical, easy-to-follow course!",
            "image": "https://img-c.udemycdn.com/course/240x135/1514258_3768_3.jpg",
            "price": 1949670,
            "lan": "en",
            "level": "expert",
            "currency": "vnd",
            "isFree": false
        },
        "details": {
            "objectives": [
                "You will be able to add Illustrator to your CV",
                "You will be able to start earning money from your Illustrator Skills.",
                "You will have over 30 of your own projects to add to your portfolio.",
                "Feel comfortable using Adobe Illustrator to design your own graphics from scratch.",
                "Navigate Adobe Illustrator CC like a pro.",
                "Design your own graphics, without any experience.",
                "Draw beginner to advanced shapes and icons.",
                "Learn all of the key skills of Illustrator: shapes, text, masking, effects, and exporting.",
                "Master advanced Illustrator tools and techniques.",
                "Export your projects for print, web, or other design projects.",
                "Make your ideas come to life.",
                "Create your own logos.",
                "Draw existing famous logos.",
                "Illustrate animals.",
                "Draw with paint brushes.",
                "Draw with pens & pencils.",
                "Create custom typography.",
                "Take hand drawings and recreate them using Illustrator.",
                "Create a logo badge with text that wraps around.",
                "Create type that follows a curving line.",
                "Put images inside of text for cool effects.",
                "Create beautiful gradients and apply them to icons, text & illustrations.",
                "Find the secrets to choosing color combinations for your work.",
                "Create a paper cut effect.",
                "Pull, push & cut text to make interesting styles.",
                "Repeat patterns to create vector flowers.",
                "You will redraw yourself as an illustration.",
                "Create many different icons styles.",
                "Build a repeating pattern to be used as wallpaper or fabric designs.",
                "Find many templates for posters, stationery & UI designs to save you time.",
                "You'll build create assets like colors, patterns & drawings using the Illustrator mobile app."
            ],
            "requirements": [
                "Any version of Adobe Illustrator, preferably the CC (Creative Cloud) version.",
                "No prior knowledge or experience with Illustrator is required"
            ],
            "description": "<p><strong>Are you frustrated trying to teach yourself Adobe Illustrator?! This course will quickly allow you to start getting paid for your Illustrator skills. </strong></p><p>Whether you're brand new to Illustrator, or have played around with it but need more guidance, this course will help you feel confident and comfortable using the industry-standard vector-based graphic application.</p><ul><li><p><strong><em>Jane: </em></strong><em>\"It's just a GREAT course! I LOVE IT! And I will advise this course to everyone who wants to learn Adobe Illustrator! Daniel is a great teacher... no! Daniel is the perfect teacher! Thank you, Daniel, for this awesome course!\"</em></p></li></ul><p><strong>Create logo design, icons, characters, textures, text-based graphics, illustrations &amp; full graphic design skills in Adobe Illustrator CC!</strong></p><p>This course was designed for the complete beginner, with practice files and fun projects to get you taking action. Throughout this Illustrator CC course, you'll be designing your own real-world projects that are professional and inspire you to do even more!<br></p><ul><li><p><strong><em>Keith:</em></strong><em> \"This course is outstanding! I stayed away from Illustrator for many years because I was intimidated by it. Now, I am excited by it and what it can do and am finding the lessons to be very informative and educational. Am definitely looking forward to finishing this course and seeing where I can go from here...\"</em></p></li></ul><p><strong>What will you learn in this Adobe Illustrator CC course?</strong></p><ul><li><p>Start by understanding the Adobe Illustrator workspace and tools</p></li><li><p>Dive into creating your own shapes &amp; lines</p></li><li><p>Use the pen &amp; curvature tool to improve your designs</p></li><li><p>Advance your graphics with strokes, pencils &amp; brushes</p></li><li><p>Speed up your workflow with the shape builder tool</p></li><li><p>Align and distribute objects to create amazing backgrounds and textures</p></li><li><p>Add and stylize text to your projects</p></li><li><p>Create beautiful graphics with masks and compound shapes</p></li><li><p>Get creative with effects and advanced techniques</p></li><li><p>Understand color and how to use it like a pro</p></li><li><p>Save &amp; export your projects for any kind of project</p></li></ul><p><strong>Real World Skills + Fun Illustrator Projects</strong></p><p>Design your own amazing graphics while learning new skills. This Adobe Illustrator CC course is jam-packed with projects and project files for you to follow along with.</p><p><strong>Become a Professional Graphic Designer using Adobe Illustrator CC</strong></p><p>With the skills learned in this course, you'll have a highly-desired skill that can help you get jobs and make money as a graphic designer. </p><p>Adobe Illustrator is the industry-standard application when it comes to graphic design, so it's important for you to learn it if you want to be a professional designer.</p><ul><li><p><strong><em>Christopher: </em></strong><em>\"I just finished this course. I had ZERO experience with a Ai and I feel that this would have been the best path to get familiar with the software. Not only was I new to Ai I was also new to the Mac I purchased specifically for this software. The explanations were spot on especially when explaining the command differences between Mac and PC.\"</em></p></li></ul><p><strong>Why learn Adobe Illustrator CC from us?</strong></p><p>This course is a collaboration between Phil Ebiner &amp; Daniel Walter Scott who have worked together to design a course that you'll love. These top-rated instructors have taught hundreds of thousands of students around the world, and can't wait to serve you.</p><p>We promise to help you learn Adobe Illustrator CC, no matter what it takes. If you ever get stuck, just post a message to the course dashboard and we'll be there to support you.</p><p><strong>Our Happiness Guarantee</strong></p><p>If you aren't happy with your purchase, we have a 30-day 100% money back guarantee. There's literally no reason to hesitate!<br></p><p><strong>Enroll now, and we'll see you inside the course!</strong></p>",
            "suitableLearners": [
                "Anyone who wants to start using Illustrator in their career & get paid for their Illustrator skills.",
                "Newbies, amateurs, graphic designers, motion graphics artists and any creatives who want to design their own graphics from scratch."
            ],
            "sections": []
        },
        "messages": {
            "welcome": "",
            "congratulations": ""
        },
        "history": {
            "createdAt": "2021-11-15T00:00:00.000Z",
            "createdBy": "622c1f382e96f2828a7dae2d",
            "publishedAt": "2021-11-18T00:00:00.000Z"
        },
        "promotions": {
            "discountPrice": 275280,
            "startAt": "2022-01-31T17:00:00.000Z",
            "endAt": "2023-01-31T17:00:00.000Z",
            "enabled": true
        }
    },
    {
        "status": "active",
        "categories": [
            "625e82a09c9b04f3f624d732",
            "625e82bb9c9b04f3f624d746"
        ],
        "topics": [],
        "reviews": [],
        "meta": {
            "ratingCount": 15446,
            "studentCount": 112700,
            "avgRatingScore": 4.420796,
            "contentVideoLength": 56044
        },
        "basicInfo": {
            "udemyCourseId": 749542,
            "slug": "graphic-design-bootcamp-photoshop-illustrator-indesign",
            "title": "Graphic Design Bootcamp: Photoshop, Illustrator, InDesign",
            "subtitle": "Bestselling Beginner Course! Use Photoshop, Illustrator, & InDesign for logo design, web design, poster design, and more",
            "image": "https://img-c.udemycdn.com/course/240x135/749542_4762_3.jpg",
            "price": 1949670,
            "lan": "en",
            "level": "intermediate",
            "currency": "vnd",
            "isFree": false
        },
        "details": {
            "objectives": [
                "Gain a clear understanding of how to work with BOTH print and web projects in Photoshop, Illustrator, and InDesign.",
                "Develop the skills and confidence to create common graphic design projects.",
                "Build a skill set that can set you up to be employable in the creative industry as a graphic designer.",
                "Begin to understand the basics of logo design, including typography and color usage.",
                "Learn how to make and refine selections using Photoshop.",
                "Learn how to make composite images using Photoshop.",
                "Work with typography, shapes, colors, and more in Illustrator.",
                "Learn how to efficiently package and export files.",
                "Learn how to lay out graphics and text while designing an eBook with InDesign.",
                "Discover how to export your finished portfolio projects directly from the Adobe CC into Behance.",
                "Learn how to mask shapes and work with Font Awesome icons.",
                "Learn how to set up a logo mood board and how to present your work to clients.",
                "Work with the type tools in Adobe Illustrator."
            ],
            "requirements": [
                "Have access to the Adobe Creative Suite, including Photoshop, Illustrator, and InDesign. I will be using a Mac, but you can just as easily follow along with a Windows machine since the principles will be the same and the apps work on either platform.",
                "Be proficient with using a computer, although prior knowledge of any of the Adobe apps is not necessary. However, this is not an “A to Z” course for every bell and whistle that each app provides, but rather a roadmap for how to make awesome projects that people are willing to pay for or that employers are looking for you to have skills with creating.",
                "Some creative skills (drawing, photography, etc.) are helpful and will definitely give you a better chance at becoming successful as a designer, but not required.",
                "A desire to learn design, whether for a job or for a hobby - design is for everyone!"
            ],
            "description": "<p><strong><em>UPDATED! Now featuring over 15 hours of on-demand content, including getting your design portfolio up and running online using&nbsp; Adobe Portfolio and Behance!</em></strong></p><p><br></p><p><strong>Welcome to the Graphic Design Bootcamp! This course has over 6,000 5-star reviews, and has been a Udemy bestseller for more than a year!</strong></p><p><em>Do you like to learn in a project-based environment?</em></p><p><em>Do you want to learn the basics of Adobe Photoshop, Illustrator, and InDesign?</em></p><p><em>Do you want to tackle BOTH print and web design projects?</em></p><p>You’re in the right place! This course is for anyone who is interested in becoming a graphic designer, and <strong>especially geared towards beginners</strong>. When you enroll in this course, you will have access to over <strong>15 hours of on-demand content</strong>, as well as the opportunity to join a private Facebook group with over 13,000 members.</p><p>I move quickly through the content, since many students enjoy a quick learning pace. Prefer a more laid-back pace? Many students find that re-watching lectures or pausing the lectures during key learning points is a helpful way to digest the information.</p><p>I also make use of shortcuts – something that all great designers learn how to do to increase their productivity and maximize their workflow – so once you enroll, <strong>be sure to download the course shortcut hotsheet: a PDF listing many of the most-used shortcut codes</strong> so that you can follow along easily and get ahead quickly.</p><p>In this course I'll also show you how to make some of the most popular projects in the industry, like:</p><p>· custom logos</p><p>· business cards</p><p>· brochures</p><p>· flyers</p><p>· web graphics</p><p>· and more.</p><p><br></p><p><strong><em>What Students Are Saying About This Course:</em></strong></p><p>· \"I have used Adobe CC for a few years now, but everything I've learned I've learned from doing. While some of this has been basic as I'm already familiar with the tools, there are tricks and advice that I would have never known that make life MUCH easier (the \"content-aware\" fill is a game changer) and I really enjoy the pacing and manner in which he explains the tools, techniques and theory!\" - Nikki Tetreault</p><p>· \"This course is good. The tutor is really nice and clear (US accent is alien to me so I sometimes find it difficult to understand - the tutor here is great, doesn't speak too fast &amp; is clear, without too many colloquialisms). Enjoying the classes. Feel prepared enough for the purpose I took the course. Would definitely recommend and also do other courses by this tutor\" - Alvira Kiss</p><p>· \"I started this course with little experience and thankfully I have learnt a lot throughout this course. I can't wait to learn more about this industry and make my mark on the world and its all thanks to this course which has kickstarted my journey!\" - Charles Vaughn</p><p>· \"So far it's been great. I'm a student that struggles largely in traditional school settings, the ability to pause, take notes, rewind, and move back and forth as I need has been great. The instructor has been clear and precise, and has given plenty to think about as we're creating files.\" - Samantha Finn</p><p>· \"For a guy whove been working with photoshop for nearly 10 years Im still learning from this course.\" - Aryne Neil Cabatan</p><p><br></p><p><strong><em>What to Expect:</em></strong></p><p>We will be using Photoshop, InDesign, and Illustrator; the industry-standard applications for graphic design. I'll also review relevant terms and design practices to help you create pixel-perfect projects for print and web, with the goal to get you up and running as soon as possible so you can start your new and exciting career as a graphic designer.</p><p>If you aren't looking to learn design for a job, don't worry - this is a great course for you too! Many of my students are moms looking to make fun cards or invitations, or students looking to spice up their resumes and social media graphics, and teachers looking to add some creative elements to their homework materials - the list goes on and on. <strong><em>Design is for everyone! And this course is, too!</em></strong></p><p>There is also a private Facebook group with over 13,000 students and counting, which is an awesome resource for you to take advantage of while you go through the course. The group is an excellent place to post projects, get insightful critiques, and network with other like-minded students and working professionals all over the world.</p><p><strong>All project files are included as a free download at the beginning of each section, and you are welcome to use the files however you want, or simply to follow along with the projects as you move through the lessons.</strong></p><p>As mentioned before, I cover a lot of program shortcuts in this course as well!</p><p>For the most part, all of the principles you will learn in this course transcend the tools you actually use - There are students using Adobe versions from CS3 up to CC 2019, and there are even students using apps like Sketch and Pixelmator to make some of the projects in this course.</p><p>If you see anything in any of the lectures that no longer apply with the software update, please let me know! I’m doing my best to keep this course up to date and continue to add value for you.</p><p><br></p><p><strong><em>Instructor Qualifications and Background:</em></strong></p><p>Derrick has spent his entire career in the creative arts and marketing sector. Starting back as early as high school where he turned homework into paying gigs, his love for all things art and technology driven has continued to grow. Working with brands such as MTV, Nintendo, and Netflix while employed as an intern for Seven 2 Interactive catapulted his career. His branding work and graphic design has been included in international publications for the design industry and regularly featured on trending websites.</p><p>Derrick is the owner of a small design agency, Mitchell's Garage | Creative Media Chop Shop, located in the heart of downtown Kalispell, Montana. Mitchell's Garage has been successful in reaching and working with clients all over the world, including Washington D.C., New York, California, Calgary, Austria, Australia, Washington, Colorado, and of course, throughout Montana.</p><p><br></p><p><br></p>",
            "suitableLearners": [
                "Employees or Employers that need to gain skills in graphic design so you can produce graphics and print materials for your company.",
                "Beginners that want to start a career as a graphic designer.",
                "Entrepreneurs that plan to start their own business or become a freelancer.",
                "Anyone that wants to learn how to take their creative ideas and put them into a print or digital format."
            ],
            "sections": []
        },
        "messages": {
            "welcome": "",
            "congratulations": ""
        },
        "history": {
            "createdAt": "2020-11-22T00:00:00.000Z",
            "createdBy": "622c1f382e96f2828a7dae2d",
            "publishedAt": "2020-11-25T00:00:00.000Z"
        },
        "promotions": {
            "discountPrice": 275280,
            "startAt": "2022-01-31T17:00:00.000Z",
            "endAt": "2023-01-31T17:00:00.000Z",
            "enabled": true
        }
    },
    {
        "status": "active",
        "categories": [
            "625e82a09c9b04f3f624d732",
            "625e82bb9c9b04f3f624d746"
        ],
        "topics": [],
        "reviews": [],
        "meta": {
            "ratingCount": 13655,
            "studentCount": 52090,
            "avgRatingScore": 4.7204294,
            "contentVideoLength": 26113
        },
        "basicInfo": {
            "udemyCourseId": 1316728,
            "slug": "adobe-indesign-cc-essentials-training-course",
            "title": "Adobe InDesign CC - Essentials Training Course",
            "subtitle": "Build company newsletters, brochures, annual reports. Learn typography, color theory & graphic design skills in InDesign",
            "image": "https://img-c.udemycdn.com/course/240x135/1316728_26f9_6.jpg",
            "price": 1949670,
            "lan": "en",
            "level": "beginner",
            "currency": "vnd",
            "isFree": false
        },
        "details": {
            "objectives": [
                "You will be able to add InDesign to your CV",
                "You will be able to start earning money from your InDesign Skills.",
                "You will have over 5 of your own projects to add to your portfolio.",
                "You will build a flyer in InDesign.",
                "You will create a postcard design.",
                "You will build a company brochure.",
                "You will create a magazine layout.",
                "You will create a company newsletter.",
                "You will create your own business card.",
                "You will build stationery for a business including letterhead & comp slip.",
                "You will build a longer annual report document.",
                "You will create & use corporate colors.",
                "You will create your own colors to use in your designs.",
                "You will learn how to pick complimentary fonts for you design.",
                "You will resize, rotate & crop images.",
                "76 lectures 5+ hours of well structured content.",
                "Learn how to create PDF files ready for printing.",
                "You will get the finished files so you never fall behind.",
                "Downloadable exercise files & cheat sheet.",
                "Forum support from me and the rest of the BYOL crew.",
                "Techniques used by professional graphic designers.",
                "Professional workflows and shortcuts.",
                "A wealth of other resources and websites to help your new career path."
            ],
            "requirements": [
                "You will need a copy of Adobe InDesign CC.",
                "No previous design skills are needed.",
                "No previous InDesign skills are needed."
            ],
            "description": "<p>Are you scared to learn InDesign on your own? Does it look intimidating? Don't worry, I promise by the end of the first few videos you will realize InDesign is actually a simple to use program. </p><ul><li><p><strong><em>Kara:</em></strong> <em>\"This course definitely exceeded my expectations. I've stayed far away from InDesign because I THOUGHT it was difficult. Daniel explains things in a way that it's not frustrating and boring. If you're on the fence about Daniel's class, don't hesitate to purchase it. I've bought 2 courses from other people on here and his was the most straight-to-the-point course and it wasn't boring. I had fun learning InDesign and this course is worth so much more than you pay on Udemy. Thank you!\"</em></p></li></ul><p>Hi there, my name is  Dan. I am a graphic designer and Adobe Certified Instructor (ACI) for Adobe InDesign CC.</p><p>Together we will work through real life projects starting with a simple company flyer, then a brochure &amp; a company newsletter. We’ll make business cards &amp; take control of a really long annual report. You'll learn essential typographic, color theory &amp; graphic design principals. </p><p>We will work with colour, picking your own and also using corporate colours. You will explore how to choose &amp; use fonts like a professional. We will find, resize &amp; crop images for your documents.</p><ul><li><p><strong><em>Margie:</em></strong><em> </em>\"This course has been a life changing experience for me! I’ve been unmotivated the past 2 years because of the fear of failure in my business endeavours. I realize now I was more afraid of not being able to comprehend what the instructor was teaching....now I’m eagerly waiting to enjoy the next course. Learning has been a positive uplifting journey for me now!\"</p></li></ul><p>There are projects for you to complete, so you can practise your skills &amp; use these for your creative portfolio.</p><p>In this course I supply exercise files so you can play along. I will also save my files as I go through each video so that you can compare yours to mine - handy if something goes wrong.</p><p>Know that I will be around to help - if you get lost you can drop a post on the video 'Questions and Answers' below each video and I'll be sure to get back to you.</p><ul><li><p><strong><em>Damayanti: </em></strong><em>\"So thankful for this! it's my first time learning this program, but I can confidentially say that Daniel is a great choice as an instructor. What I really love is that you guys are really teaching each and everything that new comers like me need to learn to become a pro. Zero to Hero is the right slogan you guys used! Glad I get to learn through here!\"</em></p></li></ul><p>I will share every design trick I have learnt in the last 15 years of designing. My goal is for you to finish this course with all the necessary skills to start making beautiful documents using Adobe InDesign CC.</p>",
            "suitableLearners": [
                "Anyone who wants to start using InDesign in their career & get paid for their design skills.",
                "This course is for people completely new to InDesign. No previous design or publishing experienced is necessary.",
                "This is a relaxed, well paced introduction that will enable you to produce most common publications. Only basic computing skills are necessary - If you can send emails and surf the internet then you will cope well with our course."
            ],
            "sections": []
        },
        "messages": {
            "welcome": "",
            "congratulations": ""
        },
        "history": {
            "createdAt": "2021-11-15T00:00:00.000Z",
            "createdBy": "622c1f382e96f2828a7dae2d",
            "publishedAt": "2021-11-18T00:00:00.000Z"
        },
        "promotions": {
            "discountPrice": 275280,
            "startAt": "2022-01-31T17:00:00.000Z",
            "endAt": "2023-01-31T17:00:00.000Z",
            "enabled": true
        }
    },
    {
        "status": "active",
        "categories": [
            "625e82a09c9b04f3f624d732",
            "625e82bb9c9b04f3f624d746"
        ],
        "topics": [],
        "reviews": [],
        "meta": {
            "ratingCount": 12602,
            "studentCount": 51514,
            "avgRatingScore": 4.564442,
            "contentVideoLength": 36581
        },
        "basicInfo": {
            "udemyCourseId": 1864390,
            "slug": "the-complete-graphic-design-theory-for-beginners-course",
            "title": "The Complete Graphic Design Theory for Beginners Course",
            "subtitle": "Learn Graphic Design Theory and the Basic Principles of Color Theory, Typography, Branding, Logo Design, Layout & More!",
            "image": "https://img-c.udemycdn.com/course/240x135/1864390_96a5_2.jpg",
            "price": 2293770,
            "lan": "en",
            "level": "beginner",
            "currency": "vnd",
            "isFree": false
        },
        "details": {
            "objectives": [
                "You will have intermediate to expert level knowledge of graphic design theory that you will immediately be able to apply to your career, job, hobby, or company.",
                "You will be given a major overview of the most common graphic design practices and the thought process behind these principles.",
                "You will be given real-world, applicable projects that you can follow along with and practice.",
                "You will achieve the experience and knowledge to take graphic design fundamentals and apply them in your everyday life.",
                "You will learn color theory and how it applies to the world around us, from products and art to branding and advertising.",
                "You will learn typography theory and how type plays a major role in both print mediums and digital media.",
                "You will learn photography composition and how it interacts with graphic design elements to create stunning looking artwork.",
                "You will learn layout, user interface and experience design, and composition to understand how to control what you want the viewer to see.",
                "You will learn about logo design and branding, and the way that you or your company can use these ideas to get in the eyes of more people.",
                "You will learn about past and current design trends that you can use as a source for creating your own original work.",
                "You will learn about the legal side of design and how you can take safe measures to make sure you are following the proper laws of copyright and trademarks.",
                "Learn the Step-By-Step process to becoming a graphic designer",
                "NEW! Learn some 2021 design trends to look out for with three new student projects"
            ],
            "requirements": [
                "This course is for beginners to graphic design theory and for anyone who wants to learn the basic principles of color theory, typography, layout design, photography, logo design, branding, and more as it relates to graphic design.",
                "You will learn intermediate and advanced terminology that you can use to incorporate in graphic design, user interfaces, mobile app design, logo design, t-shirt design, and other digital or print mediums.",
                "Though programs like Adobe Photoshop CC and Canva are used throughout this course, you will not need them unless you would like to follow along. The principles outlined in this course are transfereable to many applications, both digital and physical.",
                "Project files and resources can be found in available lessons located directly in this course."
            ],
            "description": "<p><strong>NEW&nbsp;SECTION! 2022 Design&nbsp;Trends and Practical Projects added!&nbsp;<br><br>Learn Graphic Design Theory in this New Course!</strong></p><p>Many people want to become designers but don't know the basic fundamentals of design at all.</p><p>It can takes years to piece together different ideas to truly begin to understand how it even works.</p><p><em>but it doesn't have to be like that.</em></p><p>By understanding the foundations of color, typography, layout, composition, branding, and other fields of study in the graphic design realm, you can propel yourself from a <strong>beginner to an expert</strong>, <em>just by having the right education</em>.</p><p>You have found the perfect course for learning graphic design. It doesn't matter if you have no experience at all, this course was designed to teach you design theory in the most effective means necessary.&nbsp; </p><p>With&nbsp;<strong>over 4.5+ hours </strong>(and counting) <strong>of video</strong>&nbsp;and&nbsp;<strong>practical projects to follow along with</strong>, this course is<strong> JAM&nbsp;PACKED</strong>&nbsp;with information to help you learn this graphic design theory!</p><p>The videos build on one another so that as you work through this course, you will understand more and more!</p><p><strong>Pretty sweet, huh?&nbsp; :)</strong></p><p>Not only that, but this course is also designed so that if you already know some design theory and just need help with a specific principle,&nbsp;<em>you can skip directly to that topic!&nbsp; </em></p><p><strong>So who can benefit from learning graphic design theory?</strong></p><p>The fundamentals of design are useful for a lot of careers, industries, and hobbies. It doesn't matter if it's logo design, web design, social media, user interface design, advertising, product design, printing, or t-shirts.&nbsp;<strong>This course will cover ideas that can be used in any niche!</strong></p><p>Each section goes into specific detail of the main principle being taught so that you get in-depth knowledge of that theory.</p><p><strong>This course will cover:</strong></p><ul><li><p>The Basics of Graphic Design</p></li><li><p>Color Theory</p></li><li><p>Typography</p></li><li><p>Layout</p></li><li><p>Composition</p></li><li><p>User Experience </p></li><li><p>Branding</p></li><li><p>Logo Design</p></li><li><p>Photography in Graphic Design</p></li><li><p>Modern&nbsp;Trends and Themes</p></li><li><p>The Legal Side of Graphic Design</p></li><li><p>and much, much more!</p></li></ul><p><strong>Other great stuff you might want to know..</strong></p><p>Not only will you get over<strong> 5+ hours of video content</strong> (and counting) and lessons, project files, and a new life skill, you will also have direct communication with the instructors to help you along.</p><p>This includes direct messages, discussions, and specialized projects in the course that will allow you to interact with the instructors and others. There is even a <strong>facebook group </strong>to connect with Lindsay and I and other students to ask questions, get feedback and participate in&nbsp;design challenges. </p><p><em>Feeling lost?</em>&nbsp; Don't worry,&nbsp;<strong>we are here for you!</strong></p><p>As they say, \"Come for the course, stay for the community.\"</p><p><br></p><p><strong>What else is there to know?</strong></p><p>Well there is that little&nbsp;<strong>30 day money back guarantee</strong>&nbsp;thing.</p><p>That basically means that if you don't enjoy this course for any reason at all, you can get a&nbsp;<em>full refund</em>&nbsp;up to thirty days since the time you purchase it.</p><p>It's a&nbsp;<strong>win-win situation!</strong></p><p>and we applaud winners.</p><p><strong>So what are you waiting for?!</strong></p><p>The time is now to stop procrastinating and begin learning graphic design theory so that you can take full advantage of everything that it has to offer!</p><p><strong>Enroll now in this course and get started!</strong></p>",
            "suitableLearners": [
                "This course is specifically design for beginners interested in graphic design theory. Philosophies and practical projects are given so that you not only understand the reasoning behind the theory, but you also get a chance to practice it to.",
                "This course is great for:",
                "- Graphic Designers",
                "- Website Designers",
                "- Logo Designers",
                "- UI / UX Designers",
                "- Product Designers",
                "- T-Shirt Designers",
                "- Businesses",
                "- Marketers",
                "- Social Media Experts",
                "any anyone else interested in learning the fundamentals of graphic design theory!"
            ],
            "sections": []
        },
        "messages": {
            "welcome": "",
            "congratulations": ""
        },
        "history": {
            "createdAt": "2022-02-05T00:00:00.000Z",
            "createdBy": "622c1f382e96f2828a7dae2d",
            "publishedAt": "2022-02-08T00:00:00.000Z"
        },
        "promotions": {
            "discountPrice": 321160,
            "startAt": "2022-01-31T17:00:00.000Z",
            "endAt": "2023-01-31T17:00:00.000Z",
            "enabled": true
        }
    },
    {
        "status": "active",
        "categories": [
            "625e82a09c9b04f3f624d732",
            "625e82bb9c9b04f3f624d746"
        ],
        "topics": [],
        "reviews": [],
        "meta": {
            "ratingCount": 12543,
            "studentCount": 77226,
            "avgRatingScore": 4.471106,
            "contentVideoLength": 97660
        },
        "basicInfo": {
            "udemyCourseId": 869812,
            "slug": "the-ultimate-digital-painting-course-beginner-to-advanced",
            "title": "The Ultimate Digital Painting Course - Beginner to Advanced",
            "subtitle": "Everything from drawing fundamentals to professional painting techniques",
            "image": "https://img-b.udemycdn.com/course/240x135/869812_1fc8_3.jpg",
            "price": 1949670,
            "lan": "en",
            "level": "intermediate",
            "currency": "vnd",
            "isFree": false
        },
        "details": {
            "objectives": [
                "Digital painting techniques",
                "Drawing Fundamentals",
                "How to create concept art",
                "Color theory",
                "Character design",
                "Photo realistic painting",
                "Perspective"
            ],
            "requirements": [
                "Drawing Tablet with Stylus",
                "Digital Painting Software",
                "Motivation to learn!"
            ],
            "description": "<p>Join over 16,000&nbsp;learning students and start gaining the art skills you've always wanted. </p><p>The Ultimate Digital Painting Course will show you how to create advanced art that will stand up as professional work. This course will enhance or give you skills in the world of Digital Painting - or your money back</p><p>The course is your track to obtaining digital drawing &amp; painting skills like you always knew you should have! Whether for your own projects or to paint for clients.</p><p>This course will take you from having little knowledge in digital painting and drawing to creating advanced art and having a deep understanding of drawing fundamentals.&nbsp; </p><p>So what else is in it for you?</p><p><strong>You’ll create&nbsp;over 60&nbsp;different projects in this course that will take you from beginner to expert!</strong></p><p>You’ll gain instant access to all 18 sections of the course.</p><p>The course is setup to quickly take you through step by step, the process of digital drawing and painting in many different styles. It will equip you with the knowledge to create stunning designs and illustration!</p><p> <strong>Don’t believe me? I offer you a full money back guarantee within the first 30 days of purchasing the course.</strong></p><p> Here’s what you get with the course:</p><p> You’ll get access to the 18&nbsp;sections of the course that will teach you the fundamentals of drawing&nbsp; and digital painting from the ground up. The course is supported with over 20 hours of clear content that we walk you through each step of the way.</p><p> All at your fingers tips instantly:</p><ul><li><p>The course starts with the basics. We will cover how to use the most essential tool in digital painting, the brush.</p></li><li><p>Next, you will get an in depth understanding of the fundamentals of drawing. Fundamentals are the most important part of creating professional art. You will learn \teverything from line fundamentals all the way to 3D form.&nbsp; \t</p></li><li><p>Once you've learned the drawing fundamentals you are going to learn how perspective works and how to incorporate it into \tyour art. You will be learning 1, 2, and 3 point perspective. We will also be covering many other aspects that go into perspective.</p></li><li><p>Then you are going to learn how light and color work together. In this section you will learn how to choose realistic colors for your highlights and shadows. You will also learn how light interacts with different surfaces.</p></li><li><p>At this point you will be ready to star painting full still life paintings. Painting still life's is a key ingredient of becoming a great artist and its fun! </p></li><li><p>Next you are going to learn about color theory and how to chose beautiful color pallets. Color choice can be a very difficult part of digital painting since you have millions of choices, but we will teach you tricks that simplify the whole process. </p></li><li><p>Once you've mastered color theory you will learn how to control you brush and blend colors together through a series of fun projects. </p></li><li><p>Next you will learn how to paint different textures and materials. Everything from rough textures to translucent materials.</p></li><li><p>Then you will learn how to paint people. We will cover everything from the eyes, nose, mouth, ears, and even entire portraits.</p></li><li><p>At This point you will be ready to start painting landscapes. You will learn how to paint landscapes from life as well as from your imagination. </p></li><li><p>Next you will learn how to colorize a black and white painting. We will walk you through every step of sketching, painting, and adding color to a black and white painting.</p></li><li><p>We also added 2 whole bonus sections that will teach you how to paint photo realistic paintings and character design. Don't worry, we didn't skimp on these sections. They are just as long and packed with just as much information as the rest of the course!</p></li><li><p>Lastly you will learn how to paint from your imagination. This section includes how to get out of creative ruts and fight creative block. This section is not just theory. You will get to do several creative exercise projects.&nbsp; </p></li><li><p>But we wanted throw one more thing in! So we included a lecture that will teach you how to build a portfolio and show you what art directors are looking for. \t</p></li></ul><p> Over the 18 chapters you will learn:</p><ul><li><p>How to draw &amp; paint an eye</p></li><li><p>How to use digital brushes </p></li><li><p>Drawing fundamentals</p></li><li><p>Space and perspective</p></li><li><p>Color &amp; lighting </p></li><li><p>Still\tlife painting</p></li><li><p>How to choose color pallets </p></li><li><p>Blending</p></li><li><p>Painting textures</p></li><li><p>Painting the human face and head</p></li><li><p>Environment and landscape painting</p></li><li><p>Colorized painting</p></li><li><p>Photo realistic painting</p></li><li><p>Character Design </p></li><li><p>Building a social media portfolio</p></li></ul><p> What else will you get?</p><p> - Personal contact with both course tutors Jaysen Batchelor &amp; Austin Batchelor</p><p> - Lifetime access to course materials</p><p> - Understanding of how professional art is created</p><p> - Quizzes and downloadable resources</p><p> This all comes under one convenient easy to use platform. Plus you will get fast, friendly, responsive support on the Udemy Q&amp;A section of the course or direct message.</p><p> We will be here for you&nbsp;every step of the way!</p><p> <strong>So what are you waiting for? Sign up now and change your art world today!</strong></p><p><br></p>",
            "suitableLearners": [
                "Students wanting to learn how to digitally paint",
                "Students willing to put in a handful of hours",
                "Students willing to take action and start digital painting",
                "Students wanting to add another skill to their tool belt"
            ],
            "sections": []
        },
        "messages": {
            "welcome": "",
            "congratulations": ""
        },
        "history": {
            "createdAt": "2022-03-16T00:00:00.000Z",
            "createdBy": "622c1f382e96f2828a7dae2d",
            "publishedAt": "2022-03-19T00:00:00.000Z"
        },
        "promotions": {
            "discountPrice": 275280,
            "startAt": "2022-01-31T17:00:00.000Z",
            "endAt": "2023-01-31T17:00:00.000Z",
            "enabled": true
        }
    },
    {
        "status": "active",
        "categories": [
            "625e82a09c9b04f3f624d732",
            "625e82bb9c9b04f3f624d746"
        ],
        "topics": [],
        "reviews": [],
        "meta": {
            "ratingCount": 10055,
            "studentCount": 55750,
            "avgRatingScore": 4.65434,
            "contentVideoLength": 50855
        },
        "basicInfo": {
            "udemyCourseId": 850426,
            "slug": "photoshop-2022-masterclass",
            "title": "Photoshop 2022 MasterClass",
            "subtitle": "Master the World's Best Imaging and Design Application and Become an Adobe Certified Associate.",
            "image": "https://img-c.udemycdn.com/course/240x135/850426_5596_4.jpg",
            "price": 1949670,
            "lan": "en",
            "level": "all",
            "currency": "vnd",
            "isFree": false
        },
        "details": {
            "objectives": [
                "Learn all the different kind of Selection techniques",
                "Master Masking to be able to seamlessly combine images together",
                "Learn how to retouch photos like a pro",
                "Understand the differences and pros/cons between different image file formats",
                "Learn useful keyboard shortcuts and best practices",
                "Learn Photoshop from the very beginning the way a professional would use it"
            ],
            "requirements": [
                "Any version of Adobe Photoshop, preferably not older than Photoshop CS6. Ideally Photoshop CC (Creative Cloud).",
                "Prior knowledge is not needed",
                "Exercise Files and Study Guides are provided"
            ],
            "description": "<p><strong>One of Udemy’s highest rated Photoshop courses</strong> – by one of the Top 10 Adobe Instructors in the world – this course teaches you to use this industry-leading image editing application as a creative professional. The whole course content, including examples, techniques, exercises and quizzes have been carefully selected and refined to offer the most efficient and enjoyable way to master Adobe Photoshop.</p><p>This course has been purposely designed <strong>for users of all experiences</strong>, from complete beginners to existing Photoshop users, who want to take their skills to the next level. Being able to confidently work in Photoshop is an essential skill for any Photographer or Graphic Designer, but it is an equally useful tool for Retouchers, UI/UX designers, Web Developers, Digital Artists and various other areas within and outside of the creative industry.<br></p><p><em>‘One of the best courses on Udemy I've taken. It covers both the topic at hand and also how to get certified in it - all in a format that's relaxing and enjoyable. The instructor is impressive. Very knowledgeable man.’ </em></p><p><em>Joe Pillera<br></em></p><p><strong>More about Adobe Photoshop: <br></strong><br>If you can think it, you can make it with Photoshop, the world’s best imaging and graphic design software. Create and enhance photographs, illustrations and 3D artwork. Design websites and mobile apps. Edit videos, simulate real-life paintings and more. It’s everything you need to make any idea real.<br></p><p><strong>A closer look at what you will learn: </strong></p><ul><li><p>First of we will start with the basics, so you feel totally at ease with the interface, navigation, preferences, setting up new documents and applying simple adjustments to images. </p></li><li><p>The next chapter will teach you everything you need to know about one of the most crucial features in Photoshop, working with Layers. </p></li><li><p>Moving on you will learn about all the drawing tools and techniques, focusing on creating and working with Brushes and Vector Shapes. </p></li><li><p>The following chapters will walk you through core skills that are essential to work non-destructively in Photoshop: Transformations, Selections, Masking, Smart Objects and Adjustment Layers.</p></li><li><p>The next chapter is all about retouching techniques. You will learn the difference between technical and creative image retouching and all the features and techniques professionals use for enhancing images for adverts, movie posters and the beauty industry.</p></li><li><p>You will also learn about all the different types of image files, the pros and cons of each of them and how to work with the robust Adobe Camera RAW editor.</p></li><li><p>There is also a whole chapter dedicated to working with type in Photoshop, which can be extremely important when working on adverts and posters.</p></li><li><p>The final two chapters will ensure you understand how to save and export your work and learn more advanced Photoshop workflows including 3D Layers, the Timeline panel, Lightroom integration and so much more.</p></li></ul><p><br></p><p><strong>This course includes:</strong></p><ul><li><p>94 Videos (12 hours of total playtime)</p></li><li><p>Interactive quizzes testing what you learnt in each chapter</p></li><li><p>Downloadable working files</p></li><li><p>Course content updated with the latest 2022 new features</p></li><li><p>All future updates to Photoshop will be included in this course for no extra payment</p></li><li><p>Estimated completion time: 25 hours (including finishing all exercises and quizzes)</p></li><li><p>Preparation guide for the official Adobe Certified Associate exam: Visual design using Photoshop</p></li><li><p>Completion certificate upon finishing the entire course</p><p><br></p></li></ul><p><strong>Martin is an Adobe Certified Instructor </strong>–<strong> </strong>voted as one of the Top 10 Adobe instructors in the world – with years of experience teaching in classrooms, seminars and webinars. He also worked professionally in the creative industry for over 10 years on a wide range of projects for clients such as Disney, Accenture, Mattel, etc.</p><p><br></p><p><strong>Who will find it useful:</strong></p><ul><li><p>Perfect for anyone looking to start or develop their career in the creative industry.</p></li><li><p>Complete beginners will be able to master the software from the very beginning to the most advanced features. </p></li><li><p>Self-taught users and existing professionals can use the course to take their skills and knowledge to the next level, refine their workflows and learn to do everything the right way!</p></li><li><p>Existing and more experienced users of Photoshop may also discover hidden gems and workflows or catch up with all the new features released in 2022.<br></p></li></ul><p><em>‘This course is not only educational but also really entertaining. I'm honestly really glad I bought this course. I'm loving it and honestly from these videos you can really tell that Photoshop is this guy's true passion. I'm ready to be a pro!!!!!’</em></p><p><em>Anna<br></em></p><p><strong>Skills you will gain:</strong></p><ul><li><p>Creating photo montages and combining images in various creative ways.</p></li><li><p>Retouching photographs like a professional, seamlessly removing or adding any details.</p></li><li><p>Enhancing tonal values, color, contrast, sharpness, clarity, reducing noise and compression artifacts in images.</p></li><li><p>Exporting to various image formats for both print and screen with confidence.</p></li><li><p>Designing engaging compositions using photos, typography and special effects.</p></li><li><p>Creating digital art with the powerful Brush engine and using blend modes.<br></p></li></ul><p>Are you ready to become a Photoshop pro? Enroll on this course now and get started!</p><p><br></p>",
            "suitableLearners": [
                "This course is aimed at anyone who wants to get into the creative industry and gain a rock solid foundation of Photoshop. Although it is providing a beginner to intermediate level learning experience it can be useful for experienced Photoshop users too as there are many self-taught users who are missing out on a lot of techniques and features."
            ],
            "sections": []
        },
        "messages": {
            "welcome": "",
            "congratulations": ""
        },
        "history": {
            "createdAt": "2022-01-05T00:00:00.000Z",
            "createdBy": "622c1f382e96f2828a7dae2d",
            "publishedAt": "2022-01-08T00:00:00.000Z"
        },
        "promotions": {
            "discountPrice": 275280,
            "startAt": "2022-01-31T17:00:00.000Z",
            "endAt": "2023-01-31T17:00:00.000Z",
            "enabled": true
        }
    },
    {
        "status": "active",
        "categories": [
            "625e82a09c9b04f3f624d732",
            "625e82bb9c9b04f3f624d746"
        ],
        "topics": [],
        "reviews": [],
        "meta": {
            "ratingCount": 9599,
            "studentCount": 34739,
            "avgRatingScore": 4.7885585,
            "contentVideoLength": 16324
        },
        "basicInfo": {
            "udemyCourseId": 371074,
            "slug": "sketch-from-a-to-z-2022-become-an-app-designer",
            "title": "Sketch from A to Z (2022): Become an app designer",
            "subtitle": "Finally a comprehensive guide to using Sketch for designing mobile applications. Learn to design an app from A to Z.",
            "image": "https://img-b.udemycdn.com/course/240x135/371074_6c73_2.jpg",
            "price": 1949670,
            "lan": "en",
            "level": "beginner",
            "currency": "vnd",
            "isFree": false
        },
        "details": {
            "objectives": [
                "Master Sketch to create a strong mobile app design from start to finish",
                "Advanced techniques and shortcuts to design faster than most professionals",
                "User interface design best practices to solve problems effectively",
                "Know how to simplify visual information to clarify meaning and improve UX",
                "Understand how to design for different device viewports",
                "How to leverage tools to ensure pixel perfect design work",
                "How to save tons of time by using shared styles, symbols, and libraries",
                "How to export and hand off the assets developers need to build a real app",
                "How a good UI (user interface) influences good UX (user experience)",
                "Be a professional designer who creates better apps faster"
            ],
            "requirements": [
                "Download Sketch and purchase a license or use the free trial"
            ],
            "description": "<p>&nbsp; \tSketch&nbsp;has revolutionized the world of mobile application design by providing the tools to transform yourself into a professional app designer with only a few hours of training. This course will teach you to use the Sketch to design dynamic, development-ready mobile app user interfaces that impress clients and engage users.&nbsp; </p><p>&nbsp; \t<strong>Learn to Design Beautiful, High-Quality Mobile Application UI&nbsp;with Sketch's Powerful Tools and Smooth Workflow</strong>&nbsp; </p><ul><li><p>Master the essential principles and tools of Sketch.</p></li><li><p>Discover design techniques that will enhance your creative potential.</p></li><li><p>Learn and implementUI best practices to ensure quality and usability.</p></li><li><p>Journey from concept to completion by creating a sample mobile application. </p></li></ul><p>&nbsp; \t<strong>Find Out Why Google, Apple, and Facebook Designers Use Sketch</strong></p><p>&nbsp; \tMany of Silicon Valley’s most established and fastest growing companies swear by Sketch&nbsp;when designing UIs for mobile applications because it’s fast and intuitive, and produces stunning final products.&nbsp; </p><p>&nbsp; \tSketch isn’t just a tool for designing pretty apps, It’s a tool for composing UI components and design patterns that scale without effort as projects grow more complex. </p><p>&nbsp; &nbsp; &nbsp; &nbsp;When it comes to styling, we’re able to use multiple color and gradient fills, borders, and automatically scaling images on a single layer to keep out layers list clean and organized.</p><p>&nbsp; &nbsp; &nbsp; &nbsp;It gives us the ability to reuse styles and elements throughout a design — so that you never have to waste time making the same change in multiple places. And those reused elements can be nested inside one another and then tweaked or swapped out to create powerful and flexible design systems.</p><p>&nbsp; \t<strong>Contents and Overview</strong>&nbsp; </p><p>&nbsp; \tWhether you’re a beginner or a veteran designer with experience using Photoshop and Illustrator, you will find this course valuable in the way that it blends step-by-step instruction with hands-on, customizable exercises:&nbsp; </p><ul><li><p><strong>Mobile App Design from A to Z: </strong>With 55 lectures and 4.5 hours of content, this course covers everything from layers, shapes, and styling to text editing to exporting finished projects.</p></li></ul><ul><li><p><strong>Test Your Knowledge: </strong>Periodic quizzes will review key concepts and ensure that you are mastering the content. </p></li></ul><ul><li><p><strong>Interactive Design Project: </strong>Together with the instructor, you will build a sample UI for an iPhone music player app. Included Sketch documents allow you to pick up at any point in the project.</p></li></ul><p>&nbsp; \tAfter completing this course, you will understand how to design high-quality mobile application UI&nbsp;using Sketch&nbsp;and you will be better prepared to meet the demands of your clients and developers.&nbsp; </p>",
            "suitableLearners": [
                "This course is perfect for web and print designers",
                "This course is perfect for Photoshop or Illustrator users",
                "This course requires practically no prior design experience",
                "Some graphic design experience will be helpful",
                "This course is not to learn to develop a functioning app"
            ],
            "sections": []
        },
        "messages": {
            "welcome": "",
            "congratulations": ""
        },
        "history": {
            "createdAt": "2021-08-22T00:00:00.000Z",
            "createdBy": "622c1f382e96f2828a7dae2d",
            "publishedAt": "2021-08-25T00:00:00.000Z"
        },
        "promotions": {
            "discountPrice": 275280,
            "startAt": "2022-01-31T17:00:00.000Z",
            "endAt": "2023-01-31T17:00:00.000Z",
            "enabled": true
        }
    },
    {
        "status": "active",
        "categories": [
            "625e82a09c9b04f3f624d732",
            "625e82bb9c9b04f3f624d746"
        ],
        "topics": [],
        "reviews": [],
        "meta": {
            "ratingCount": 7933,
            "studentCount": 51884,
            "avgRatingScore": 4.759985,
            "contentVideoLength": 58638
        },
        "basicInfo": {
            "udemyCourseId": 1835828,
            "slug": "adobe-photoshop-cc-advanced-training-course",
            "title": "Adobe Photoshop CC – Advanced Training Course",
            "subtitle": "You'll learn advanced Photoshop techniques like Photoshop retouching & Graphic Design tutorials.",
            "image": "https://img-b.udemycdn.com/course/240x135/1835828_92e5_2.jpg",
            "price": 1949670,
            "lan": "en",
            "level": "all",
            "currency": "vnd",
            "isFree": false
        },
        "details": {
            "objectives": [
                "You will be able to earn more using these new Photoshop skills.",
                "You will create multiple images for you to use in your Portfolio.",
                "You will be able to add 'Advanced Photoshop User' to your CV.",
                "You will create multiple social media graphics for Instagram, Facebook, Twitter, Pintrest & Youtube.",
                "You will know how to mask people with one click.",
                "You will create a fruit juice poster.",
                "You will replace ugly skies with new blue skies.",
                "You will create an image by combining 3 different images.",
                "You will create amazingly realistic shadows.",
                "You will build animations ready for social media.",
                "You will make blurry images - sharp & focused.",
                "You will master advanced curves & levels.",
                "You will retouch perfect skin.",
                "You will change colors of a flower & dress.",
                "You will make images larger without distorting them.",
                "You will automatically generate more grass & sky in an image.",
                "You will remove unwanted objects from a photograph",
                "You will edit video in Photoshop.",
                "You will bend text to fit into a heart shape.",
                "You will tread a vine through text.",
                "You will manipulate cartoon characters into lots of different positions.",
                "You will add color to images to create trendy new images styles.",
                "You will add dust & splatters to an image & text for a grunge effect.",
                "Create photographs with Instagram effects.",
                "You will create a double exposure using a woman & a mountain scape.",
                "You will transform 3 images into realistic water color images.",
                "Build 2 images that look like they have a pixel explosion & decaying effect.",
                "You will create a flyer using new & exciting fonts.",
                "You will discover unknown fonts from your images using Photoshop",
                "You will create flourished text so your text looks elegant.",
                "You will build multiple advertising banners.",
                "You will create professional retouching projects.",
                "You will remove a nose ring from a model.",
                "You will remove acne from a model.",
                "Enhance eyes in your photographs.",
                "Whiten teeth",
                "Remove unwanted lights from a photograph",
                "Completely remove people & objects from 6 images.",
                "Remove bags from underneath eyes.",
                "Enlarge eyes.",
                "Add a smile to a model.",
                "You will add depth to static photographs by animating using parallax so they feel like a real 3D movie.",
                "Create repeating looping videos for social media using cinemagraphs in Photoshop",
                "Create 3D text of your name.",
                "Build a 3D logo.",
                "Build mockups of your images in real life situations like on: computer screens, posters on walls, in magazines, billboards, mobile phones.",
                "You'll learn the best selection and masking techniques",
                "You'll know how to fix images that look 'hard to fix'",
                "You'll master advanced levels and curves tricks, specifically with skin, adjusting and enhancing colors",
                "You'll learn how to enlarge images without distortion and what to do when things go wrong",
                "You'll know how to convincingly remove all kinds of objects from images",
                "My favourite: You'll master the ability to distort, bend and reshape images",
                "Lets look at how current trending styles are super easy to duplicate",
                "You will become a type nerd. We'll use font pairing in Typekit. We'll also use Photoshop's ability to guess fonts",
                "Your Artboard skills will be mastered",
                "A master of retouching, you will become!",
                "We'll also create awesome cinemagraphs, AKA: Moving pictures!",
                "You'll learn lots about professional, reusable mockups, techniques and shortcuts!"
            ],
            "requirements": [
                "Any version of Adobe Photoshop, preferably the CC (Creative Cloud) version.",
                "Basic knowledge of Photoshop is required. I recommend watching my Photoshop Essentials course before this course.",
                "If you already know how to use layers & make simple selections then you are perfect for this course."
            ],
            "description": "<p>Are you already good at Photoshop? Do you know there is more that you aren't using? This course will take to you the top level of Photoshop. </p><p>Hi there, my name is  Dan and I am an Adobe Certified Instructor for Photoshop  - this is the Advanced Photoshop course.</p><p>This course is not for people new to Photoshop. This is for people who already know the fundamentals. It is for people who have their own ways of doing things but believe there really is a better, faster way to work. </p><ul><li><p><strong><em>Cindy: \"</em></strong><em>This is an amazing class with so many techniques to learn. The instructor is the best of best on my list and I have taken over 50 classes on Udemy! Thank you Mr. Scott - this class really raises my confidence level!!!!\"</em></p></li></ul><p>We will start by learning the best selection techniques available. I promise, by the end of the first section what took you 30mins to mask will now take you 30 seconds. You'll learn the very best Photoshop retouching skills as well as how to master Photoshop for graphic design.</p><p>We will correct 'hard to fix' images and learn what to do with blurry images. We will master Advanced Levels &amp; Curves tricks and will work specifically with skin, adjusting and enhancing colours. </p><p>You will learn how to enlarge images without distorting them and also, what to do when things go wrong. </p><ul><li><p><strong><em>Aurelien</em></strong><em>: \"I feel I should elaborate a tiny bit on my 5 star rating for people still hesitating! This is hands down the best Training Course on Photoshop. I've always felt scared of learning and using Photoshop. Tried million times, failed just as much (but maybe blindly following some shady specific tutorials on YouTube was not the best method). But then I came across Daniel's courses on Udemy. Natural, fun and intuitive are the keywords that first come to mind to describe his teaching method. The exercises are perfect, not too challenging (well it depends) but not simple either. Amazing. He shows the love for the product and the art and most of all doesn't just scratch the surface. You'll learn how to use Photoshop as a great tool to express your art, no matter what kind of artist you are. As an aspiring and self-taught graphic designer wanting to take the leap and become a professional, I've felt the need to get proper training for the tools I wish to use along my dream career, and Daniel's teachings really motivate me to challenge myself and go forward! Daniel, thank you so much! Huge high five from my little town of France.\"</em></p></li></ul><p>We will learn how to convincingly remove all kinds of objects from images. My personal favourite section will show you how to distort, bend &amp; reshape images.</p><p>We will look at how current trending visual styles are easily created, duotones, glitches and orange/teal colour grading.</p><p>We get 'type nerdy' and use font pairing in Typekit. We will use Photoshop to identify the fonts used in an image and learn how to work with hidden glyphs &amp; ligatures as well as variable &amp; open type fonts.</p><p>You will master artboards while you are learning how to make easily updatable multiple sized social media &amp; ad banner graphics. </p><p>There is a big section on advanced retouching techniques, advanced healing, advanced cloning &amp; patching. </p><p>You will learn how to edit videos in Photoshop. We will also animate static images creating parallax videos plus the very cool cinemagraphs sometimes called 'living pictures' - great for social media.</p><ul><li><p><strong><em>Petra:</em></strong><em> \"I love this course. I am in graphic design program at UC Berkeley ex. and I have learned more here than in their photoshop class.\"</em></p></li></ul><p>You will learn to master 3D in photoshop. We will finish off the course with professional, reusable mockup techniques &amp; shortcuts. </p><p>This course has a strong focus on workflow. We use real world, practical projects and show you the professional techniques and shortcuts which will save you hours using Photoshop. Throughout the course I have many class exercises for you to use in order to practice your skills. </p><p><strong>Who am I? </strong></p><p>As well as being an Officially Certified Expert by Adobe, I’m photoshop guru and user with 18 years Photoshop experience. I make tutorial videos directly for Adobe and will again this year be presenting a seminar on  Photoshop at Adobe’s 20 thousand attendee strong Max Conference.  </p><p>If you can’t remember the last time you sat down and went through the updates in Photoshop, let this course be your one stop professional development and upgrade path.   </p><p>Even if you consider yourself a heavy user, I promise there will be things in here that will blow your Photoshop mind. Sign up now!</p><p><br></p>",
            "suitableLearners": [
                "Anyone that has a base knowledge in Photoshop",
                "Photographers, graphic designers, motion graphics artists, Illustrator users, and any creatives who want to an advanced understanding of Photoshop.",
                "Anyone that has completed my Photoshop Essentials Course"
            ],
            "sections": []
        },
        "messages": {
            "welcome": "",
            "congratulations": ""
        },
        "history": {
            "createdAt": "2021-11-15T00:00:00.000Z",
            "createdBy": "622c1f382e96f2828a7dae2d",
            "publishedAt": "2021-11-18T00:00:00.000Z"
        },
        "promotions": {
            "discountPrice": 275280,
            "startAt": "2022-01-31T17:00:00.000Z",
            "endAt": "2023-01-31T17:00:00.000Z",
            "enabled": true
        }
    },
    {
        "status": "active",
        "categories": [
            "625e82a09c9b04f3f624d732",
            "625e82bb9c9b04f3f624d746"
        ],
        "topics": [],
        "reviews": [],
        "meta": {
            "ratingCount": 7734,
            "studentCount": 166505,
            "avgRatingScore": 4.184502,
            "contentVideoLength": 18826
        },
        "basicInfo": {
            "udemyCourseId": 348116,
            "slug": "photoshop-in-depth-master-all-of-photoshops-tools-easily",
            "title": "Photoshop In-Depth: Master all of Photoshop's Tools Easily",
            "subtitle": "Learn the many tools in Adobe Photoshop with in-depth lectures that explain the tool uses, options + modes in Photoshop.",
            "image": "https://img-c.udemycdn.com/course/240x135/348116_e9d8_5.jpg",
            "price": 1146770,
            "lan": "en",
            "level": "beginner",
            "currency": "vnd",
            "isFree": false
        },
        "details": {
            "objectives": [
                "Master the various Photoshop tools and describe how they are used in Photoshop.",
                "Use the many tools in Photoshop and adjust their settings and options.",
                "Describe the applications in which you would use certain tools.",
                "Use tools in conjunction with one another."
            ],
            "requirements": [
                "Students need a copy of Adobe Photoshop (preferably Creative Cloud). A free trial would work as well."
            ],
            "description": "<p><strong><em>January 2020 course updated:&nbsp;I added a quick video about Photoshop 2020 update on constrain proportions when resizing smart objects, photos, type layers, and shape layers.</em></strong></p><p><strong><em>Course updated:&nbsp;Object Selection tool added for Photoshop 2020 update. </em></strong></p><p><strong><em>Two-part series on Select and Mask Technique added for more accurate selection of hair.</em></strong></p><p>In this Photoshop course, I introduce, explain, and demonstrate the various tools in Photoshop. Every single tool is covered, with the exception of 3D tools. I also go over the various ways to make selections in Photoshop, including techniques that do not use a tool. Advanced modes and options are also covered. By the time you've finished this course, you will be an expert at Photoshop's tools. However, some students may option not to complete the entire course and instead use this as a reference to learn about specific tools. If that's the case, jump around to which tool you have questions about, even though you might be missing some helpful content by not completing all the lectures. The lectures are ordered in the order they are located in the Tools panel.&nbsp; </p><p>Students can follow along in Photoshop and practice adjusting the various tools’ options and use them in conjunction with each other, whether it’s the Type Tools, the Pen Tools, or the Shape Tools, or digital darkroom tools like the Clone Stamp Tool, the Sponge Tool, and so on.&nbsp; </p><p>There are 11 lectures on the various selection tools. This could normally be a course by itself, but it is included as one section in this course. If you complete this course, you will be an expert at making selections in Photoshop!&nbsp; </p><p>I have years of experience using Photoshop, including doing web and advertising design at a newspaper, an advertising design firm, a library system, and freelance work for about two decades. I’ve also been managing editor at two international graphic design magazines (helping run Photoshop World in Las Vegas), and I’m currently a full-time professor of graphic design and digital media. I’ve taken classes on digital production and design during my undergraduate and graduate work.</p><p>Enroll today and let’s learn about Photoshop’s tools and their neat uses and effects.&nbsp; </p>",
            "suitableLearners": [
                "Beginners to Photoshop as well as more advanced users would benefit from taking this course.",
                "Anyone interested in learning more about Photoshop's tools.",
                "Anyone who wants to use Photoshop to create and explore their inner artist!",
                "Anyone wanting to learn more about Photoshop's tools in order to pursue web design, app design, photo editing, and so on."
            ],
            "sections": []
        },
        "messages": {
            "welcome": "",
            "congratulations": ""
        },
        "history": {
            "createdAt": "2021-03-24T00:00:00.000Z",
            "createdBy": "622c1f382e96f2828a7dae2d",
            "publishedAt": "2021-03-27T00:00:00.000Z"
        },
        "promotions": {
            "discountPrice": 298220,
            "startAt": "2022-01-31T17:00:00.000Z",
            "endAt": "2023-01-31T17:00:00.000Z",
            "enabled": true
        }
    },
    {
        "status": "active",
        "categories": [
            "625e82a09c9b04f3f624d732",
            "625e82bb9c9b04f3f624d746"
        ],
        "topics": [],
        "reviews": [],
        "meta": {
            "ratingCount": 7423,
            "studentCount": 42305,
            "avgRatingScore": 4.7467685,
            "contentVideoLength": 34136
        },
        "basicInfo": {
            "udemyCourseId": 1623798,
            "slug": "adobe-illustrator-cc-advanced-training-course",
            "title": "Adobe Illustrator CC – Advanced Training Course",
            "subtitle": "In this Adobe Illustrator Advanced course we'll learn Advanced techniques for graphic design, logo design & illustration",
            "image": "https://img-c.udemycdn.com/course/240x135/1623798_db31_4.jpg",
            "price": 1949670,
            "lan": "en",
            "level": "all",
            "currency": "vnd",
            "isFree": false
        },
        "details": {
            "objectives": [
                "You will be able to earn more using these new Illustrator skills.",
                "You will create multiple images for you to use in your Portfolio.",
                "You will be able to add 'Advanced Illustrator User' to your CV.",
                "53 Lectures 4+ hours of content",
                "Speed up your productivity & workflow",
                "Advanced anchor point & pen tool tricks",
                "You will build your own animated gifs.",
                "Mastering lines & strokes",
                "Depth & perspective",
                "Set permanent defaults for fonts, colours",
                "Be able to turn hyphenation off once and for all",
                "Make beautiful charts & graphs.",
                "You will learn to make quick colour adjustments, gradients meshs & how to blend it all together",
                "Your creativity will be doubled once you finish the transform, distort & blending section of the course",
                "Know how to speed up your personal workflow & how to speed up Illustrator",
                "Create your own custom icons.",
                "You'll draw various animals to explore the fastest ways to create them.",
                "You'll create your own custom lettering using swirls, whips & flourishes.",
                "Take hand drawn lettering and vectorize it in Illustrator.",
                "You'll create 3D icons for a website.",
                "You'll create UI designs for an app & website.",
                "You'll create paper cut effects inside of text.",
                "You'll make a pie chart, line chart & bar graph.",
                "You'll blend real images together to create cool instagram style filters.",
                "You'll create a post card with advanced color & prepress tricks.",
                "Adjust all the colors in your illustrator at once, making it easy to re-color & test color combinations.",
                "Warp text so that if fits inside of shapes.",
                "Create a 3D style ribbon.",
                "Make 3D text & logos.",
                "Create lots of blended lines for exciting linear effects.",
                "Create linocut flowers.",
                "Create duotones.",
                "Build a half tone image.",
                "Fill shapes with text."
            ],
            "requirements": [
                "Any version of Adobe Photoshop, preferably the CC (Creative Cloud) version.",
                "Basic knowledge of Illustrator is required. I recommend watching my Illustrator Essentials course before this course.",
                "If you know how to draw simple icons & you already know what an anchor point is. Then this course if for you."
            ],
            "description": "<p><strong>Do you know you're only using 50% of Illustrator's capabilities? Ready upgrade yourself? Then this course will take to you the top level of Illustrator mastery. </strong></p><p>Hi there, welcome to this Adobe Illustrator advanced tutorial. </p><p>My name is Dan. I’m an ACI &amp; ACE for Illustrator. This course is a more advanced look at Illustrator. It’s not designed for people who are brand new to Illustrator.</p><p>This course is for people who can already understand the fundamentals of Illustrator. If you already know what an anchor point is and how to adjust it this course is for you.</p><ul><li><p><strong><em>Giovanni: </em></strong><em>\"I started learning graphic design on youtube, and after 6 weeks I had already learned the basics of color, logo design, typography, and the basics of illustrator. But after a while I felt stuck, my workflow wasn't improving, and I still could not materialize all the details that I imagined for an artwork. So I saw your course and after two or three lessons I already knew that I made a gold-value purchase. The teacher's explanation is crystal clear and to the point, while also considering alterative scenarios where a student might get stuck. Really good attention to detail and every minute of this course brings value to me and enriches my imagination with the power of Illustrator. This course is all you need to get from being an ok user of illustrator to being an expert with unlimited possibilities. Highly recommended.\"</em></p></li></ul><p>This course will speed up your productivity &amp; workflow. It is project based, so you will learn the tools &amp; tricks to create some really beautiful current design styles.</p><p>Even if you consider yourself an experienced user, I promise there will be things in here that will blow your Illustrator mind.</p><p>You’ll learn advanced anchor point &amp; pen tool tricks. There is a really fun section on mastering lines &amp; strokes. You’ll learn the quick way to take hand drawn sketches and vectorize &amp; color them.</p><ul><li><p><strong><em>George:</em></strong><em> \"I really enjoyed this course Dan, I finished it in 3 days because my intention was to go through it rather quickly. But the content of the course is amazing for someone who has been self-taught and has more or less followed their instinct thus far. You gave me a new perspective on tools that I was already using and opened my horizon by teaching some tools that I always looked at and thought \"what the heck\" is that for? - All around awesome!\"</em></p></li></ul><p>You’ll master depth &amp; perspective in Illustrator, creating semi-flat presentations. We’ll set permanent defaults for fonts, colours &amp; learn how to turn hyphenation off once and for all. You'll learn advanced logo design &amp; graphic design techniques.</p><p>We’ll make beautiful charts &amp; graphs for your indesign documents. There is a colour mastery section where you will learn to make quick colour adjustments, gradients meshs &amp; how to blend it all together.  </p><p>Your creativity will be doubled once you finish the transform, distort &amp; blending section of the course.</p><ul><li><p><strong><em>Jamie: </em></strong><em>This course was the perfect way for me to brush up on skills I haven't used in a while and also learn some really neat ways to save time. My company puts a big emphasis on working smart and doing things efficiently, and this course seriously helped me out in that department. I've always been pretty proficient in Illustrator, and have even gotten several comments about how fast I work, but this course is helping me take that to the next level. Thanks Dan! I truly enjoyed it!</em></p></li></ul><p>There is an entire section dedicated to learning how to speed up your personal workflow &amp; how to speed up Illustrator and get it running super fast. </p><p>If you’re ok in Illustrator but you know there is so much more in there to be unlocked then please  join me and become an Illustrator super hero.</p>",
            "suitableLearners": [
                "This course is for people who already know Illustrator and want to take their skills and speed to the maximum level.",
                "This is an advanced Illustrator course, so you’ll need basic Illustrator skills to find this course useful.",
                "If you a completely new to Illustrator try my Illustrator Essentials course before starting this one."
            ],
            "sections": []
        },
        "messages": {
            "welcome": "",
            "congratulations": ""
        },
        "history": {
            "createdAt": "2021-11-15T00:00:00.000Z",
            "createdBy": "622c1f382e96f2828a7dae2d",
            "publishedAt": "2021-11-18T00:00:00.000Z"
        },
        "promotions": {
            "discountPrice": 275280,
            "startAt": "2022-01-31T17:00:00.000Z",
            "endAt": "2023-01-31T17:00:00.000Z",
            "enabled": true
        }
    },
    {
        "status": "active",
        "categories": [
            "625e82a09c9b04f3f624d732",
            "625e82bb9c9b04f3f624d746"
        ],
        "topics": [],
        "reviews": [],
        "meta": {
            "ratingCount": 6389,
            "studentCount": 36005,
            "avgRatingScore": 4.649675,
            "contentVideoLength": 86232
        },
        "basicInfo": {
            "udemyCourseId": 2509634,
            "slug": "the-ultimate-character-drawing-course-beginner-to-advanced",
            "title": "The Ultimate Character Drawing Course - Beginner to Advanced",
            "subtitle": "Learn How To Draw & Design Characters. Obtain Valuable Drawing & Design Skills For Animation, Cartoons, & Video Games!",
            "image": "https://img-c.udemycdn.com/course/240x135/2509634_a995_10.jpg",
            "price": 1949670,
            "lan": "en",
            "level": "intermediate",
            "currency": "vnd",
            "isFree": false
        },
        "details": {
            "objectives": [
                "How to design unforgettable characters",
                "How to draw character body and poses",
                "How to draw different styles of characters"
            ],
            "requirements": [
                "Paper & Pencil",
                "Or digital means of drawing",
                "A willingness to work hard and learn"
            ],
            "description": "<p><em>Join over 30,000&nbsp;achieving student and start making your art dreams a reality through your drawings.</em></p><p><strong>NOW YOU CAN FIT ART SCHOOL IN YOUR POCKET.</strong></p><p>This course combines a simple effective teaching system with easy to follow videos and tons of projects to work on. And a mind-blowing 24 hours of video content straight to your fingertips. This will take you from beginner to advanced in how ever long you want it to take because its completely self guided. Take it at your own pace. </p><p><strong>PREVIEW SECTION 12 OF THE COURSE.</strong></p><p>If you scroll to section 12 you can watch the entire character design process through a two part film that demos a character design form start to finish. This course will teach you everything you need to know to design unbelievable characters. </p><p><strong>YOU'LL GAIN INSTANT ACCESS TO:</strong></p><ul><li><p>12 sections - 95 lectures </p></li><li><p>New and improved character design skills </p></li><li><p>Access to The Artist Inner Family Facebook Group</p></li><li><p>Q&amp;A Support through out the entire course</p></li><li><p>Downloadable resources</p></li><li><p>Student discounts to future courses</p></li><li><p>100% absolutely no questions asked money back guarantee (for 30 Day) </p></li><li><p>All future updates to the course</p></li></ul><p><strong>CAN YOU GIVE ME A QUCK RUN DOWN?</strong></p><p>Yes! Here's what you'll learn:</p><ul><li><p>Drawing fundamentals</p></li><li><p>Story telling</p></li><li><p>Pencil control</p></li><li><p>Dynamic poses</p></li><li><p>Style development</p></li><li><p>Body proportions </p></li><li><p>Drawing body forms</p></li><li><p>Drawing faces</p></li><li><p>Drawing hands</p></li><li><p>Foreshortening</p></li><li><p>Gesture &amp; Poses</p></li><li><p>Facial expressions</p></li><li><p>Hair &amp; Costume </p></li><li><p>Anime </p></li><li><p>Disney animation</p></li><li><p>Comic</p></li><li><p>Pixar style</p></li><li><p>Character design demo</p></li><li><p>Facebook group</p></li></ul><p><strong>TAKE A CLOSER LOOK.</strong></p><p><strong>Section 2 </strong></p><p>You'll dive right into your first character drawings. It's never fun to listen to a bunch of lectures on theory for the first few hours of a course. It's much more fun to actually do. So you'll already be drawing characters by lecture 3.&nbsp; You'll get to draw a male and female character in this section. You can preview this section for free if you want to get a taste of the course. </p><p><strong>Section 3</strong></p><p>This section is called Learning The Fundamentals of Character Design because you will be learning everything you need to know in order to build a strong foundation. You'll learn everything from the drawing hierarchy to how line, shapes, and form are used in stages to create character designs.</p><p><strong>Section 4</strong></p><p>Welcome to drawing boot camp. This sections name comes form the fact that you will go through exercises that will strengthen you drawing ability. This includes pencil control, muscle memory, speed control, and pressure control. All of which are extremely important to character design. We call this section drawing boot camp because you'll change after going through it. </p><p><strong>Section 5</strong></p><p>Next your going to receive some extremely useful training. This whole section is on drawing the human body. You'll need the ability to draw the human form if your going to create good character designs. Through out this training you will learn how to draw every individual part of the human body from different angles and in different poses. This section breaks down the human body into simple to understand shapes and forms that you can replicate over and over again. And don't worry, you'll learn how to draw the male and the female forms.</p><p><strong>Section 6</strong></p><p>This section is all about how to pose that body that you're now an expert at drawing. In order to create exceptional character designs you need to know how to draw poses that are dynamic and have attitude. You'll learn all the different ways to make a pose dynamic and how to express a characters attitude, emotion, and just give them that appealing look. Trust me. By the end of this section you'll get it like a professional. </p><p><strong>Section 7</strong></p><p>The most important part of character design is always telling a story. Here you'll learn how to tell a story through your characters expression. First you need to know how to draw certain expression. Once you've mastered your character expressions you can start mixing and matching eye and mouth expressions to get a wide variety of emotions. Creating good expressions is the secret of the pros. </p><p><strong>Section 8</strong></p><p>You probably don't want your characters to be naked and bald so in this section you'll learn all about hair &amp; costume design. Hairstyles and costumes are really what make characters iconic and memorable. So you'll learn all about how to give your character their \"Thing\" that will distinguish them form other characters. </p><p><strong>Section 9</strong></p><p>This section of the course will give you some very practical knowledge and skills in drawing characters in different genres. Character design is broken up into different genres. You'll be taught in-depth how to draw anime, Disney animation, comic, and Pixar cartoon styled characters over the course of 5 lectures. You won't want to miss this section!</p><p><strong>Section 10</strong></p><p>At this point you have acquired all the necessary skills and knowledge to design your own characters from start to finish. So now its time to put it all together. You'll get to watch a two part video of me designing a dragon slayer character from start to finish. This section demonstrates a character being imagined and developed right before your eyes. Theres no better way to learn than to watch others. </p><p><strong>WHY THIS IS THE BEST COURSE TO BUY.</strong></p><p>As an instructor I have always worked hard to build courses that are simple for students to understand and implement. I wanted to build a course that could take a student with little or no drawing skills and shape them up into a decent character designer in a short period of time. My company Jaysen Batchelor Education is committed to developing courses that exceed expectations and provide value above and beyond what is payed for. If you're not happy with the course you can always get a 100% money back guarantee within the first 30 days of purchasing the course. The refund process is hassle free and you won't be asked why. But I have a feeling you won't want to refund this course.&nbsp;</p><p><br></p><p>This all comes under one convenient easy to use platform. Plus you will get fast, friendly, responsive support on the Udemy Q&amp;A section of the course or direct message.</p><p> I will be here for you&nbsp;every step of the way!</p><p> <strong>So what are you waiting for? Sign up now and lets change your art world today!</strong>&nbsp; </p>",
            "suitableLearners": [
                "Student wanting to learn how to design characters",
                "Students wanting to add a new skill to their tool belt",
                "Students Willing to take action and start drawing amazing artwork",
                "Students willing to put in some time to gain a new skill"
            ],
            "sections": []
        },
        "messages": {
            "welcome": "",
            "congratulations": ""
        },
        "history": {
            "createdAt": "2022-03-16T00:00:00.000Z",
            "createdBy": "622c1f382e96f2828a7dae2d",
            "publishedAt": "2022-03-19T00:00:00.000Z"
        },
        "promotions": {
            "discountPrice": 275280,
            "startAt": "2022-01-31T17:00:00.000Z",
            "endAt": "2023-01-31T17:00:00.000Z",
            "enabled": true
        }
    },
    {
        "status": "active",
        "categories": [
            "625e82a09c9b04f3f624d732",
            "625e82bb9c9b04f3f624d746"
        ],
        "topics": [],
        "reviews": [],
        "meta": {
            "ratingCount": 4371,
            "studentCount": 23723,
            "avgRatingScore": 4.4679585,
            "contentVideoLength": 44998
        },
        "basicInfo": {
            "udemyCourseId": 1047436,
            "slug": "how-to-draw-and-sketch-for-absolute-beginners-pt-1",
            "title": "How to Draw and Sketch for Absolute Beginners pt 1",
            "subtitle": "Learn the Basics of Sketching and Drawing",
            "image": "https://img-b.udemycdn.com/course/240x135/1047436_97b3.jpg",
            "price": 1949670,
            "lan": "en",
            "level": "all",
            "currency": "vnd",
            "isFree": false
        },
        "details": {
            "objectives": [
                "By the end of this course you will be able to draw almost anything ",
                "The correct way to use reference ",
                "Draw what they see and observe",
                "Draw basic lines and shapes ",
                "Understand the basics of volume , light , shadow and composition",
                "Feel confident enough to further their artistic learning on any subject.",
                "Understand that everything is made of a few basic shapes "
            ],
            "requirements": [
                "There is absolutely no prior experience required to take this course",
                "No software is needed",
                "Only a pencil or pen and paper is needed"
            ],
            "description": "<p>Drawing and sketching can seem like magic if you don't know how to do it. It's not magic, it's a skill. that means it can be taught and I will be your instructor. Just like anything and everything you have learned you had to know the very basics. You can't do math without knowing how to count and you can't drive without knowing what the key looks like.</p>\n\n<p>This course is your \"key\". All drawing starts with lines, some are straight, some are curved and rough but all are lines.  Lines are used to make shapes and shapes become volumes (3d shapes) and everything in the world is made from shapes. </p>\n\n\n\n\n\n\n\n\n\n<p>I will teach you to use those shapes. I will show you how to make lines shapes and volumes. You will learn to hone your observational skills and draw what you see, and even what is in your head if you study and practice enough.</p>\n\n\n\n\n\n\n\n\n\n<p>You need no experience in drawing. Absolutely zero ! There is no special software just a regular pencil and some paper. </p>\n\n\n\n\n\n\n\n\n\n<p>If you have always wanted to learn to draw this is the course for you. If you are a graphic artist that knows learning to draw will save you time and money, take this course. If you want to make comics or cartoons then this will be the course that will be your starting point. </p>\n\n\n\n\n\n\n\n\n\n<p>This is the beginner class. Often books tell you to start by making 3d shapes but what if you are having trouble with that? If you are , I got you covered.  </p>\n\n\n\n\n\n\n\n\n\n<p> </p>",
            "suitableLearners": [
                "Anyone who wants to learn how to draw using a pencil and paper ",
                "Anyone who wants to learn drawing in a more \"traditional\" way. ",
                "Anyone wanting to increase their drawing skills",
                "The absolute beginner with zero ability to draw",
                "Graphic artists that want to learn to draw. ",
                "The hobbyist who has wanted to learn to draw",
                "Anyone who wants to make comics or games or express their artistic desires.",
                "Everyone who has \"How to\" art books on their shelves but still couldn't draw",
                "Everyone who has watched a drawing video but still couldnt draw."
            ],
            "sections": []
        },
        "messages": {
            "welcome": "",
            "congratulations": ""
        },
        "history": {
            "createdAt": "2022-01-07T00:00:00.000Z",
            "createdBy": "622c1f382e96f2828a7dae2d",
            "publishedAt": "2022-01-10T00:00:00.000Z"
        },
        "promotions": {
            "discountPrice": 275280,
            "startAt": "2022-01-31T17:00:00.000Z",
            "endAt": "2023-01-31T17:00:00.000Z",
            "enabled": true
        }
    },
    {
        "status": "active",
        "categories": [
            "625e82a09c9b04f3f624d732",
            "625e82bb9c9b04f3f624d746"
        ],
        "topics": [],
        "reviews": [],
        "meta": {
            "ratingCount": 4360,
            "studentCount": 37632,
            "avgRatingScore": 4.4958553,
            "contentVideoLength": 44685
        },
        "basicInfo": {
            "udemyCourseId": 1458304,
            "slug": "the-digital-painting-mega-course-beginner-to-advanced",
            "title": "The Digital Painting MEGA Course: Beginner to Advanced",
            "subtitle": "Learn the #1 most important skill for digital artists!",
            "image": "https://img-b.udemycdn.com/course/240x135/1458304_7c2b_3.jpg",
            "price": 1949670,
            "lan": "en",
            "level": "beginner",
            "currency": "vnd",
            "isFree": false
        },
        "details": {
            "objectives": [
                "Digitally paint in a variety of styles."
            ],
            "requirements": [
                "You should have access to a painting software of your choice like photoshop or Procreate.",
                "You will need a basic understanding of your preferred painting software.",
                "You will need a drawing tablet and a stylus of some sort.",
                "You’ll need a deep drive to become a better painter!"
            ],
            "description": "<p><strong>You’ll create </strong><strong>over 15</strong><strong> </strong><strong>different projects in this course that will take you from beginner to expert!</strong><br></p><p>The Digital Painting Mega Course will show you how to create advanced art that will stand up as professional work. This course will enhance or give you skills in the world of digital painting - or your money back</p>\n\n<p>The course is your track to obtaining digital painting skills like you always knew you should have! Whether for your own projects or to create art as a professional.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This course will take you from having little knowledge in digital painting to creating advanced art and having a deep understanding of digital painting fundamentals. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>So what else is in it for you?</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>You’ll gain instant access to all 14 sections of the course.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The course is setup to quickly take you through step by step, the process of digital painting in 5 many different styles. It will equip you with the knowledge to create stunning designs and illustrations!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Don’t believe me? I offer you a full money back guarantee within the first 30 days of purchasing the course.</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Here’s what you get with the course:</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>You’ll get access to the 14 sections of the course that will teach you the fundamentals of digital painting from the ground up. The course is supported with over 13 hours of clear content that I walk you through each step of the way.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>All at your fingers tips instantly.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li><p>The course starts with the basics. You will get an in depth understanding of the fundamentals of digital painting. Fundamentals are the most important part of creating professional art. You will learn everything from sketching  fundamentals all the way up to photorealistic rendering. </p></li><li><p>Next you’ll learn how brushes work and how to incorporate them into your art. You will be learning how to create your own custom brushes as well.</p></li><li><p>Once you’ve learned brushes you are going to learn about the fundamentals of light and color and how to apply it to your drawings.</p></li><li><p>Then you are going to learn how to paint various surfaces and textures.</p></li><li><p>At this point you’ll be ready to start painting in different art styles. We will spend 5 whole sections learning how to paint in different styles.</p></li><li><p>Lastly you will gain access to the bonus section where I’ll teach you how to build a professional art portfolio and build a following on social media.</p></li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Over the 14 chapters you will learn:</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li><p>How to draw your under drawing</p></li><li><p>painting fundamentals</p></li><li><p>Shape and form</p></li><li><p>How to use value and contrast </p></li><li><p>light and color</p></li><li><p>painting water </p></li><li><p>Creating texture </p></li><li><p>painting photorealisticly </p></li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>What else will you get?</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>- Personal contact with me, the course tutor</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>- Lifetime access to course materials</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>- Understanding of how professional art is created</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>- Quizzes and exercise work sheets</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This all comes under one convenient easy to use platform. Plus you will get fast, friendly, responsive support on the Udemy Q&amp;A section of the course or direct message.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I will be here for you every step of the way!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>So what are you waiting for? Sign up now </strong><strong>and change your art world today!</strong></p>",
            "suitableLearners": [
                "Anyone who wants to learn to digitally paint.",
                "Anyone who can already paint but wants to learn new styles."
            ],
            "sections": []
        },
        "messages": {
            "welcome": "",
            "congratulations": ""
        },
        "history": {
            "createdAt": "2018-05-29T00:00:00.000Z",
            "createdBy": "622c1f382e96f2828a7dae2d",
            "publishedAt": "2018-06-01T00:00:00.000Z"
        },
        "promotions": {
            "discountPrice": 275280,
            "startAt": "2022-01-31T17:00:00.000Z",
            "endAt": "2023-01-31T17:00:00.000Z",
            "enabled": true
        }
    },
    {
        "status": "active",
        "categories": [
            "625e82a09c9b04f3f624d732",
            "625e82bb9c9b04f3f624d746"
        ],
        "topics": [],
        "reviews": [],
        "meta": {
            "ratingCount": 3863,
            "studentCount": 20440,
            "avgRatingScore": 4.55974,
            "contentVideoLength": 60532
        },
        "basicInfo": {
            "udemyCourseId": 595876,
            "slug": "logo-design-in-adobe-illustrator-for-beginners-beyond",
            "title": "Logo Design in Adobe Illustrator - for Beginners & Beyond",
            "subtitle": "Learn how to design a logo by a Published, Multi-Award Winning Logo Designer! 21+ Years Experience!",
            "image": "https://img-b.udemycdn.com/course/240x135/595876_f52f_18.jpg",
            "price": 1949670,
            "lan": "en",
            "level": "intermediate",
            "currency": "vnd",
            "isFree": false
        },
        "details": {
            "objectives": [
                "Develop a Professional Iconic Logo Designs",
                "Develop a Professional Typographic Logo Design",
                "Develop Professional Vintage Logo Designs",
                "Study and follow a client brief to create a logo exactly to requirements with ultimate satisfaction.",
                "Gain valuable insight into colour psychology to influence the audience.",
                "Construct an awesome mood board to further develop and refine logo ideas.",
                "Learn how to develop logo design sketches like a professional.",
                "Discover the very best materials to use in the sketching stage.",
                "Discover how to develop a logo with deep & rich meanings.",
                "Prepare sketches in Illustrator ready for optimal tracing.",
                "Discover suitable colour modes for on-screen and in print.",
                "Master every primary tool in Illustrator to weave masterpieces.",
                "Increase competency in Illustrator and its features to illustrate almost anything.",
                "Master the almighty Pen Tool to develop stunning symbol designs.",
                "Professionally kern and prepare type for ultimate aesthetics.",
                "Marry type with symbols professionally.",
                "Sit taglines so they look great against a company name.",
                "Learn how to design with optical illusions in mind.",
                "Learn how to colour logos professionally and how to make the most of few colours.",
                "Learn how to apply simple but effective effects with a few mouse clicks.",
                "Learn how to develop mockups of photorealistic objects with your logo upon them.",
                "Discover how to organise logo design files.",
                "Learn to to present your logo design work to the client professionally.",
                "Learn how to handle logo design feedback and revisions and completion.",
                "Obtain email templates which you can use for your own business.",
                "Find out how to price your logo designs to get the most money for your skill.",
                "Learn about different logo design formats and their benefits.",
                "Put your skills to the test with an array of projects to complete!",
                "How to comprehend and use professional logo / graphic design terms",
                "Speak to me in the Q&A at any time! Present your work and / or fire a question!"
            ],
            "requirements": [
                "Adobe Illustrator (or Trial Version) or any other Vector Software",
                "Scanner or digital camera / iPad / tablet camera is preferable to photo sketches to trace.",
                "Pencil, paper & eraser.",
                "Positive attitude & willingness to learn."
            ],
            "description": "<p><strong>* 'Truly the best course I have come across on Udemy (out of 30 so far!)'</strong></p><p><strong>*&nbsp;I have learned more about logo design here than I have at college'</strong></p><p><strong>* 'I am just amazed by how dedicated the creator is to this course, I think this is better than university courses. 5/5 perfect'.</strong></p><p><strong>* 'After just a few sections, I learned more than I did in my four years of undergrad getting my BFA in Graphic Design.'</strong></p><p><strong>* I was able to win 4 logo competitions worldwide. Thanks to this course'</strong></p><p><strong>* 'One of the best Logo design Courses on Udemy.'</strong></p><p><strong>* 'Really the best Logo design course ever created.'</strong></p><p><strong>* I wish I could rate 10. The courses of Mr Evans are enough for everyone to be a professional logo designer'.</strong></p><p><strong>* 'Stop reading reviews and buy this class. incredible.'</strong></p><p><br></p><p>==========================</p><p><strong>*** UPDATED JANUARY 2022! ***</strong></p><p><br></p><p><strong>Do you want to be a professional logo designer who can design stunning logos with little effort? This is your exclusive opportunity to learn from an award winning, published logo design professional so that YOU can do this in no time at all!</strong></p><p>In the course, I reveal the whole professional logo design process from start to finish covering everything from sketching, fonts, character placement, symbol development, colour application and much more. You'll also learn insider tips and tricks as well as having a full briefing of logo design types in exclusive showcases.</p><p>I also provide all the materials I use to run my day to day logo design business so you can use them to do exactly the same from logo design client questionnaires to email templates. You'll also gain insight into my communication with a real life client as we embark upon the First Point Surfing case study!</p><p>Not only that, we're going to explore additional case studies designing symbolic logos for Coffeeshake and Goldstein, Typographical logos for Cloudbox and Goinstall and vintage logo designs in the Bristol Barbers case study!&nbsp; I'm also going to pass on the skill of designing unique mosaic / Pixel style logos! </p><p>What's more there are exercises laid out for each and every one of these logo types, so that you can try your hand at them and receive valuable, professional feedback from me in the Q&amp;A!</p><p>All that's required to start is a free download of Adobe Illustrator and a pencil and paper. From here we're going to go on a journey to design awe inspiring logos.</p><p><strong>If you want to master designing proper, professional logos faster than you ever imagined, I'll see you on the inside!</strong></p><p><br></p><p><strong>Get your Certificate of Completion </strong>after finishing the entire course!</p>",
            "suitableLearners": [
                "Ideal for both beginners who haven't used Adobe Illustrator or those who are interested in learning the logo design and the logo design business.",
                "Intermediate logo / graphic designers will undoubtedly learn from the course also in relation to insight into the professional logo design process."
            ],
            "sections": []
        },
        "messages": {
            "welcome": "",
            "congratulations": ""
        },
        "history": {
            "createdAt": "2022-03-24T00:00:00.000Z",
            "createdBy": "622c1f382e96f2828a7dae2d",
            "publishedAt": "2022-03-27T00:00:00.000Z"
        },
        "promotions": {
            "discountPrice": 275280,
            "startAt": "2022-01-31T17:00:00.000Z",
            "endAt": "2023-01-31T17:00:00.000Z",
            "enabled": true
        }
    },
    {
        "status": "active",
        "categories": [
            "625e82a09c9b04f3f624d732",
            "625e82bb9c9b04f3f624d746"
        ],
        "topics": [],
        "reviews": [],
        "meta": {
            "ratingCount": 2493,
            "studentCount": 12895,
            "avgRatingScore": 4.768892,
            "contentVideoLength": 14840
        },
        "basicInfo": {
            "udemyCourseId": 1684914,
            "slug": "painting-environments",
            "title": "Painting Environments",
            "subtitle": "Creating Concept Art Worlds with Photoshop",
            "image": "https://img-c.udemycdn.com/course/240x135/1684914_2369_2.jpg",
            "price": 1949670,
            "lan": "en",
            "level": "expert",
            "currency": "vnd",
            "isFree": false
        },
        "details": {
            "objectives": [
                "Design and painting amazing, imaginative landscapes for use as concept art or stand-alone masterpieces"
            ],
            "requirements": [
                "You should have a decent grasp of Photoshop and Art Fundamentals - we offer courses on both for FREE!",
                "Photoshop and a pressure sensitive tablet"
            ],
            "description": "<p>Welcome to <strong><em>Painting Environments</em></strong>. My name is Hardy Fowler and I am a professional illustrator and concept artist. I’m calling on all artists out there with a passion for creating worlds - if you’ve ever dreamed of making a career out of this, I’m here to tell you that the dream is real. You can make a living doing this!</p>\n\n\n\n\n\n<p>All you need is a killer portfolio to launch you into an amazingly fun and rewarding career. </p>\n\n\n\n\n\n\n\n<p>This course can get you there. I’ll show you all of my professional level techniques and tricks that will demystify the entire process of create stunning environments and landscapes with Adobe Photoshop. This stuff is way easier than it looks! In an easy to grasp, step by step process, I’ll share all of my digital painting techniques and custom tools that will have you amazed at how stunning, expansive and detailed your scenes can be!</p>\n\n\n\n\n\n\n\n<p>But this course is so much more than just a painting demonstration. We’ll teach you everything you need to know to start <em>thinking</em> like a professional environment designer. To tie it all together, we offer responsive support and loads of other course resources to make sure that every student can take their work to new heights.</p>\n\n\n\n\n\n\n\n<p>Don’t miss your chance to create worlds. You can do this! It just might lead to a dream career. Enroll today, grab your stylus and let’s paint cool stuff</p>",
            "suitableLearners": [
                "Anyone who wants to learn to create digital paintings like a pro",
                "Those aspiring to be professional concept artists",
                "Students or professionals who want to learn new techniques and tools that can turbo charge their creativity and efficiency"
            ],
            "sections": []
        },
        "messages": {
            "welcome": "",
            "congratulations": ""
        },
        "history": {
            "createdAt": "2021-02-26T00:00:00.000Z",
            "createdBy": "622c1f382e96f2828a7dae2d",
            "publishedAt": "2021-03-01T00:00:00.000Z"
        },
        "promotions": {
            "discountPrice": 275280,
            "startAt": "2022-01-31T17:00:00.000Z",
            "endAt": "2023-01-31T17:00:00.000Z",
            "enabled": true
        }
    }
]