[{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83499c9b04f3f624d7c2"],"topics":[],"reviews":[],"meta":{"ratingCount":8591,"studentCount":42147,"avgRatingScore":4.439523,"contentVideoLength":19278},"basicInfo":{"udemyCourseId":1136678,"slug":"how-to-work-with-interior-design-styles-like-a-pro","title":"How to Work with Interior Design Styles Like a Pro","subtitle":"Interior Design Styles Demystified","image":"https://img-b.udemycdn.com/course/240x135/1136678_f12f_3.jpg","price":1949670,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["Understand 18 of the main interior design styles used in today’s homes in great detail.","Articulate the defining furniture characteristics of each main style","Select the common materials used in each of the main styles","Select appropriate color schemes used for each of the main styles","Select the commonly used patterns for each of the main styles","Select appropriate window coverings and flooring used for each of the main styles","Discover your interior design style personality","Learn how to mix different styles with confidence!"],"requirements":["Students should have some paper and a pen or pencil ready for the activities.","Students should come ready to engage themsleves fully in a fun-filled training on interior design styles."],"description":"<p>With so many different interior design styles available today, do you find yourself getting&nbsp;overwhelmed and unsure of how to choose a style&nbsp;or pull off a style well in your own home?&nbsp;It becomes even more complicated when you want to mix different interior design styles but are unsure of how to do that so it looks fabulous and well pulled together, instead of flat out&nbsp;chaotic. &nbsp;</p><p>To that end, <strong>this course has been created to help you understand the defining characteristics of 18 different popular interior design&nbsp;styles today so that you can either create one of those&nbsp;styles in your own home or learn how to easily and effectively mix different styles on your own.&nbsp;&nbsp;</strong></p><p>Please note that this course <strong>only</strong> covers the characteristics of various&nbsp;interior design styles.&nbsp; <strong>It does NOT provide information on how to pull together a room (e.g., furniture layouts, rug sizes, etc.).&nbsp;</strong> That information can be found in my course \"How to Design a Room in 10 Easy Steps\"</p><p>That said, this course will go fairly deeply into 18 different and distinct interior design styles in areas that include:</p><ul><li><p>Defining furniture characteristics</p></li><li><p>Common materials used in each style</p></li><li><p>Appropriate color schemes and patterns&nbsp;for each style</p></li><li><p>Window and floor covering options for each style</p></li><li><p>Lighting, artwork and accessories appropriate to each&nbsp;style</p></li><li><p>Retailers that carry furnishings for each particular style</p></li></ul><p>We will also spend an entire section focused solely on how to mix styles well using a simple, formulaic approach. &nbsp;You will learn how to do this&nbsp;both through a lecture approach as well as listening to&nbsp;2 real life case studies.</p><p>Finally, after each style&nbsp;section, you will have an opportunity to take a style quiz to help you find out which interior design styles are best suited to you based on your preferences.</p><p>This course is a great choice for anyone wanting to learn more about different interior design styles and how to mix them successfully on their own,&nbsp;and for&nbsp;interior designers who want to brush up their skills on different interior design styles.</p><p>Join me for a exciting journey into the world of interior design styles!</p><p><strong>IMPORTANT NOTES:</strong></p><ul><li><p>If you are interested in taking most or all of my courses,<strong> I have a recommended order in which to watch them</strong> (although it's certainly not required).&nbsp; I would start with \"How to Design a Room in 10 Easy Steps\" because most of my other courses are in-depth classes of the concepts touched on in this 10 step class.&nbsp; Following the 10 Step Course, I&nbsp;suggest moving on to \"How to Use Color Like a Pro\", followed by \"How to Work with Interior Design Styles Like a Pro\", then \"How to Use Lighting Design to Transform your Home\", and finally \"Design is in the Details\".&nbsp; My other courses, \"How to Use Minimalist Interior Design to Live your Best Life\", \"Use Eco-friendly, Sustainable Design to Improve Your Life\", \"How to Design Your Dream Kitchen\", and \"How to Design Your Dream Bathroom\" are all stand alone classes on specialty topics within interior design, and therefore, can be taken in any order.<br></p></li><li><p>Please be aware that this course, or any of my courses, is not intended to provide all of the knowledge needed to become a professional interior designer.&nbsp; As with any professional field, there is a significant amount of education and/or experience that is needed to achieve competency in this field.&nbsp; My intention with these courses is to provide some solid foundational knowledge to assist either those individuals interested in \"DIY\" interior design to work on their own projects more effectively, or to provide supplemental education to both interior design students and professionals.<br></p></li></ul>","suitableLearners":["This in-depth course is appropriate for any level of interior design knowledge","This course is for anyone who wants in-depth information on the main interior design styles used today and how to mix those styles with confidence","This course could also be a great choice for anyone who is new to the interior design field and would like more in depth information on interior design styles"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-04-11T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-04-14T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83499c9b04f3f624d7c2"],"topics":[],"reviews":[],"meta":{"ratingCount":6555,"studentCount":26609,"avgRatingScore":4.5943823,"contentVideoLength":6286},"basicInfo":{"udemyCourseId":871756,"slug":"how-to-design-a-room-in-10-easy-steps","title":"How to Design a Room in 10 Easy Steps","subtitle":"Interior Design Made Simple","image":"https://img-b.udemycdn.com/course/240x135/871756_5356_3.jpg","price":1949670,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["Design/decorate nearly any room well using a systematic 10-step method.","Identify the best places to buy furnishings for a room.","Identify different interior design styles and select your own style for decorating.","Create different room layout options for family rooms, living rooms, dining rooms and bedrooms.","Create a personalized color scheme that will look great.","Create a layered lighting scheme that is both functional and dramatic."],"requirements":["Measuring tape to measure room","Ruler","Pen/pencil (pencil is preferred)"],"description":"<p><strong><em>Do you find yourself struggling to pull together a room in a way that is both functional and aesthetically pleasing? &nbsp;</em></strong></p><p><strong><em>Do you think that interior design is&nbsp;all art and no science? &nbsp;</em></strong></p><p>If you answered yes to either or both of these questions, then this is the class for you! &nbsp;In this course,&nbsp;you will learn that you can actually use&nbsp;an easy,&nbsp;systematic approach for creating beautiful and functional designs for the primary rooms&nbsp; in your home, primarily focusing on family and living rooms, dining rooms, and bedrooms.&nbsp; (Please note that this class does not cover kitchen or bath design).&nbsp; This&nbsp;course is primarily lecture based, but does contain activities along the way to help you immediately apply what you've learned, as well as&nbsp;a quiz at the end.&nbsp; </p><p>By the end of this beginner&nbsp;course, you will be able to completely design a room end-to-end using a simple 10-step approach.&nbsp; Specifically, you will learn how to:</p><ul><li><p>Measure a room to maximize the use of your space and select appropriately sized furniture</p></li><li><p>Create your ideal floor plan (various sample floor plans are provided)</p></li><li><p>Identify your preferred interior design style(s)</p></li><li><p>Create a cohesive interior design color scheme</p></li><li><p>Select the appropriate sized rug and furniture for a room</p></li><li><p>Efficiently shop for furniture online</p></li><li><p>Create a layered lighting scheme</p></li><li><p>Learn the secret for making off-the-shelf drapes look custom</p></li></ul><p>The ideal student for this course is a person who is interested in creating functional and aesthetically pleasing rooms in their home, but does not already have a lot of knowledge in interior design.&nbsp;</p><p><strong>IMPORTANT NOTES:</strong></p><ul><li><p>If you are interested in taking most or all of my courses,<strong> I have a recommended order in which to watch them</strong> (although it's certainly not required).&nbsp; I would start with \"How to Design a Room in 10 Easy Steps\" because most of my other courses are in-depth classes of the concepts touched on in this 10 step class.&nbsp; Following the 10 Step Course, I&nbsp;suggest moving on to \"How to Use Color Like a Pro\", followed by \"How to Work with Interior Design Styles Like a Pro\", then \"How to Use Lighting Design to Transform your Home\", and finally \"Design is in the Details\".&nbsp; My other three courses, \"How to Use Minimalist Interior Design to Live your Best Life\",&nbsp; \"Use Eco-friendly, Sustainable Design to Improve Your Life\" , and \"How to Design Your Dream Kitchen\" are all stand alone classes on specialty topics within interior design, and therefore, can be taken in any order.<br></p></li><li><p>Please be aware that this course, or any of my courses, is not intended to provide all of the knowledge needed to become a professional interior designer.&nbsp; As with any professional field, there is a significant amount of education and/or experience that is needed to achieve competency in this field.&nbsp; My intention with these courses is to provide some solid foundational knowledge to assist either those individuals interested in \"DIY\" interior design to work on their own projects more effectively, or to provide supplemental education to both interior design students and professionals.</p></li></ul>","suitableLearners":["This is best suited for individuals with limited knowledge of interior design.","This course is for anyone who wants to learn how to create/design a well-pulled together looking room (e.g., family room, living room, dining room, and bedroom).  This course does not cover interior design for kitchens or bathrooms"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-11-12T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-11-15T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83499c9b04f3f624d7c2"],"topics":[],"reviews":[],"meta":{"ratingCount":4817,"studentCount":23545,"avgRatingScore":4.3858047,"contentVideoLength":7067},"basicInfo":{"udemyCourseId":1014236,"slug":"how-to-use-color-like-a-pro","title":"How to Use Color Like a Pro","subtitle":"Interior Design Color Schemes Made Easy","image":"https://img-c.udemycdn.com/course/240x135/1014236_3867_3.jpg","price":1949670,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["Create the ideal color scheme for any room in your home using a tool that has been designed to guide you through this process easily!","Use the color wheel like a pro.","Use the psychology of color to create the perfect mood in your home.","Use texture to change the way a color appears.","Mix patterns successfully in a room.","Choose from popular color schemes for different rooms in your home based on the room's orientation, your interior design style, or the function of your room.","Choose the right paint colors, including how to effectively test them out before you start, and how to transition those colors effectively in your home."],"requirements":["Students should have some paper and a pen or pencil ready for the activities.","Students should come ready to engage themslves fully in a fun-filled training on color."],"description":"<p><strong><em>Do you find yourself struggling to create a cohesive color scheme in your own home? &nbsp;</em></strong></p><p><strong><em>Do you wonder how interior designers use colors to create a certain mood or feeling in a room? &nbsp;</em></strong></p><p>It's no secret that color is one of the most important elements of great interior design.&nbsp; To that end, <strong>this course has been created to help you create&nbsp;fantastic color schemes for your own home</strong>.&nbsp; This course will cover everything you ever wanted to know (and maybe what you didn't know that you wanted/needed to know!)&nbsp;about color in the world of interior design, including: </p><ul><li><p>Color theory / color psychology</p></li><li><p>How to use the color wheel in a very practical and useful way</p></li><li><p>How to use color to create different moods in a room</p></li><li><p>How to use color to make your rooms appear larger or smaller than they actually are</p></li><li><p>How to mix patterns like a pro</p></li><li><p>Learn about&nbsp;beautiful color scheme selections for every room in your home based on various factors</p></li><li><p>Learn everything you need to know about paint</p></li></ul><p>We delve deep into the topic of paint, including discussing how many different&nbsp;paint colors you should be using in your home, how to narrow your paint choices, the best white paint colors, how to effectively test out paint colors, and how to transition paint colors from room to room.</p><p>Finally, there are exercises in this course&nbsp;as well, to provide you with&nbsp;opportunities to create your own beautiful color schemes.&nbsp; </p><p>This course is a great choice for&nbsp;the novice or aspiring&nbsp;interior designer, or for anyone who is interested in learning more about how to create beautiful interior design color schemes&nbsp;like a pro.&nbsp; </p><p>Join me for a fantastic journey into the world of interior design color schemes!</p><p><strong>IMPORTANT NOTES:</strong></p><ul><li><p>If you are interested in taking most or all of my courses,<strong> I have a recommended order in which to watch them</strong> (although it's certainly not required).&nbsp; I would start with \"How to Design a Room in 10 Easy Steps\" because most of my other courses are in-depth classes of the concepts touched on in this 10 step class.&nbsp; Following the 10 Step Course, I&nbsp;suggest moving on to \"How to Use Color Like a Pro\", followed by \"How to Work with Interior Design Styles Like a Pro\", then \"How to Use Lighting Design to Transform your Home\", and finally \"Design is in the Details\".&nbsp; My other two courses, \"How to Use Minimalist Interior Design to Live your Best Life\",&nbsp; \"Use Eco-friendly, Sustainable Design to Improve Your Life\", and \"How to Design Your Dream Kitchen\" are stand alone classes on specialty topics within interior design, and therefore, can be taken in any order.<br></p></li><li><p>Please be aware that this course, or any of my courses, is not intended to provide all of the knowledge needed to become a professional interior designer.&nbsp; As with any professional field, there is a significant amount of education and/or experience that is needed to achieve competency in this field.&nbsp; My intention with these courses is to provide some solid foundational knowledge to assist either those individuals interested in \"DIY\" interior design to work on their own projects more effectively, or to provide supplemental education to both interior design students and professionals.<br></p></li></ul>","suitableLearners":["This is best suited for individuals with minimal to moderate knowledge of interior design.","This course is for anyone who wants to learn how to use color effectively in interior design to accomplish any or all of the following goals:  create a certain mood or effect in a space through color, find the right color scheme for a particular room, and choose the right paint color every time.","This course would also be a great choice for anyone who is new to the interior design field and would like more in depth information on color."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-11-12T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-11-15T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83499c9b04f3f624d7c2"],"topics":[],"reviews":[],"meta":{"ratingCount":2334,"studentCount":14641,"avgRatingScore":4.6379848,"contentVideoLength":9630},"basicInfo":{"udemyCourseId":1260482,"slug":"design-is-in-the-details-how-to-accessorize-like-a-pro","title":"Design is in the Details:  How to Accessorize Like a Pro","subtitle":"Take your interior design from good to great by focusing on the details","image":"https://img-c.udemycdn.com/course/240x135/1260482_dcca_4.jpg","price":1949670,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["Use 5 key accessories to take any room from good to great","Stylishly decorate a variety of surfaces in your home, including a console table, coffee table, fireplace mantel and bookcase.","Use pillows to stylishly decorate a sofa and a bed","Mix metal finishes effectively in any room of your home","Mix wood finishes effectively in any room of your home","Match the right paint colors to your wood tones","Articulate the various moldings that can be used to elevate the design of your home","Select moldings (types and sizes) that are best suited to your home"],"requirements":["Students should have some paper and a pen or pencil ready for the activities.","Students should come ready to engage themselves fully in a fun-filled training on accessorizing and other design details."],"description":"<p><strong><em>Have you ever wondered what makes a room look so much more polished and pulled together than other rooms?</em></strong></p><p><strong><em>Have you struggled to find the right paint color that coordinates with the different wood finishes in&nbsp;your home?</em></strong></p><p><strong><em>Have you ever wondered how interior designers make coffee tables, console tables, fireplace mantels,&nbsp;and bookcases look so beautifully decorated? </em></strong>&nbsp;</p><p>If you've ever asked yourself any of these questions, then this is the class for you! &nbsp;\"Design is in the Details\" is a class devoted to <strong>the&nbsp;main&nbsp;details that make up beautiful room design, including accessorizing, mixing wood and metal finishes, and moldings</strong>.&nbsp;&nbsp;</p><p>Please be aware that this course only covers the topics of accessorizing, mixing wood and metal finishes, and different types of room molding.&nbsp; It does&nbsp;not&nbsp;provide information on how to pull together a room (e.g., furniture layouts, rug sizes, etc.).&nbsp; That information can be found in my course \"How to Design a Room in 10 Easy Steps\"<br></p><p>In this class we will cover the following main&nbsp;topics:</p><ul><li><p>5 key accessories that every room should have</p></li><li><p>The importance of accessories</p></li><li><p>My 7 golden rules for accessorizing</p></li><li><p>Learn how to beautifully decorate console tables, coffee tables, fireplace mantels, bookcases, and dining tables</p></li><li><p>Learn how to hang artwork the right way</p></li><li><p>Learn how to mix different metal finishes with ease, including the kitchen and the bathroom</p></li><li><p>Learn how to mix different wood finishes like a pro, including which paint colors look&nbsp;best with different wood finishes</p></li><li><p>Learn how to use moldings to transform your home, including crown molding, baseboard, window and door casing, chair rail, panel molding, and picture frame molding</p></li></ul><p>Throughout the class, you will also be provided with practical exercises to help you immediately apply what you've learned in each section. &nbsp;</p><p>This is a great <strong>beginner's course</strong> for those who are interested in learning more about the details that designers use to elevate the overall design of a space. &nbsp;This could also be a great class for&nbsp;interior design students or&nbsp;professionals who are new to the field. &nbsp;</p><p>Join me for a fun, action-packed class on interior design details!</p><p><strong>IMPORTANT NOTES:</strong></p><ul><li><p>If you are interested in taking most or all of my courses,<strong> I have a recommended order in which to watch them</strong> (although it's certainly not required).&nbsp; I would start with \"How to Design a Room in 10 Easy Steps\" because most of my other courses are in-depth classes of the concepts touched on in this 10 step class.&nbsp; Following the 10 Step Course, I&nbsp;suggest moving on to \"How to Use Color Like a Pro\", followed by \"How to Work with Interior Design Styles Like a Pro\", then \"How to Use Lighting Design to Transform your Home\", and finally \"Design is in the Details\".&nbsp; My other courses, \"How to Use Minimalist Interior Design to Live your Best Life\", \"Use Eco-friendly, Sustainable Design to Improve Your Life\", and \"How to Design Your Dream Kitchen\" are all stand alone classes on specialty topics within interior design, and therefore, can be taken in any order.</p><p><br></p></li><li><p>Please be aware that this course, or any of my courses, is not intended to provide all of the knowledge needed to become a professional interior designer.&nbsp; As with any professional field, there is a significant amount of education and/or experience that is needed to achieve competency in this field.&nbsp; My intention with these courses is to provide some solid foundational knowledge to assist either those individuals interested in \"DIY\" interior design to work on their own projects more effectively, or to provide supplemental education to both interior design students and professionals.</p></li></ul>","suitableLearners":["This course is a great beginner course for anyone interested in taking their home's design to the next level through accessorizing, mixing metal and wood finishes and the application of various moldings.","This course could also be a great supplemental educational course for interior design students or those new to the interior design field."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-11-12T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-11-15T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83499c9b04f3f624d7c2"],"topics":[],"reviews":[],"meta":{"ratingCount":2216,"studentCount":16010,"avgRatingScore":4.4563823,"contentVideoLength":54911},"basicInfo":{"udemyCourseId":2738212,"slug":"the-complete-sketchup-vray-course-for-interior-design","title":"The Complete Sketchup & Vray Course for Interior Design","subtitle":"Become an Expert in Modelling, Rendering and Post-Production with Sketchup, Vray and Photoshop in under 7 hours","image":"https://img-c.udemycdn.com/course/240x135/2738212_d25c_8.jpg","price":1949670,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["Learn the core Sketchup skills required to model faster & more efficiently.","Learn how to use certain Sketchup Plugins to take your modeling skills to the next level.","Understand Vray lighting, materials, settings, render elements & more to create amazing Photorealistic Renders","Learn from a Real-Life Apartment Project as we model & render a Contemporary Bedroom, Furniture, Modular Kitchen & more Interior spaces, STEP-BY-STEP.","Understand certain Interior Design standards and styles required to design a space functionally and efficiently.","Learn to Leverage Sketchup Plugins to create blankets, pillows,  curtains & more."],"requirements":["No prior experience is needed. You will learn everything you need to know","A computer with either Windows or Mac to install all the software & sketchup plugins to model & render your favorite Interior Design space.","A strong work ethic, willingness to learn, and plenty of excitement about the awesome new Sketchup modeling & Vray rendering skills you will acquire in this Interior Design course.","Nothing else! It's just you, your computer and your hunger to get started today."],"description":"<p>You've just stumbled upon the most complete, in-depth<strong> Sketchup &amp;&nbsp;Vray course for Interior Design. </strong>With over 10,000+ students enrolled and <strong>hundreds of 5-star reviews</strong> to date, these comprehensive Sketchup &amp;&nbsp;Vray tutorials cover everything you'll ever need.<br><br>&gt;&gt;&gt; Updated at the start of December 2021 (Model &amp;&nbsp;Render a Living Room Scene with Vray 5 and Sketchup 2021)&nbsp;&lt;&lt;&lt;<strong><br></strong>&gt;&gt;&gt; Updated at the end of November 2021 (Introduction to Sketchup 2021 for Absolute Beginners)&nbsp;&lt;&lt;&lt;<strong><br></strong>&gt;&gt;&gt; Updated at the end of July 2021 on how to create a Photorealistic Chic Bedroom)&nbsp;&lt;&lt;&lt;<br><br>***ALL&nbsp;NEW&nbsp;SECTIONS&nbsp;ARE&nbsp;ADDED&nbsp;TO&nbsp;THE TOP&nbsp;OF&nbsp;THE&nbsp;COURSE***</p><p>Shruti says, <em>\"Yes, I absolutely love this course and have gained so much knowledge ever since I started these lessons. Would definitely recommend this to my friends who would like to brush up on their basics as well as learn the fine details in designing on software like Sketch up.\"</em></p><p>Aparna says,<em> \"Just Wonderful! Before this course, I only know how to click interactive render without even adding any lights or settings. Now I know, whats Interactive and Main rendering is, lights, materials, plugins, settings etc. Loved learning this course and also instant clarification of doubts.\"</em></p><p>Jhoe says, <em>\"Excellent SketchUp course! The instructor utilizes the power of SketchUp and Vray with Post-Production...and very easy to follow. Highly recommended!</em>\"<br><br>Varun says,&nbsp;<em>\"Wonderful experience. It helps me a lot to start my interior design firm. I was from an IT background after taking this course I mastered 3D design.\"</em></p><p><br></p><p>This course is designed to <strong>jumpstart </strong>your <strong>Sketchup, Vray &amp;&nbsp;Interior Design Journey</strong>, wherein we take you <strong>Step&nbsp;by Step </strong>with a<strong> Real-Life Apartment Project </strong>and get you up &amp;&nbsp;running<strong> </strong>to design your favourite <strong>Interior Design</strong> space efficiently, quickly and in the right way.<strong><br></strong></p><p><strong>Why this Course?</strong></p><ul><li><p><strong>Comprehensive coverage</strong> of the essential tools to design a<strong> bedroom, modular kitchen &amp;&nbsp;more </strong>- Learn not only how every tool works but also how to apply it in the right way in your Sketchup workflow.</p></li><li><p><strong>Downloadable Resources - </strong>Exercise files like<strong> </strong>Sketchup Models for every lecture &amp; section so you can follow along step by step. </p></li><li><p><strong>Learn from an Expert </strong>- I've been using Sketchup for over 10 years and I will be sharing all my skills and secrets which has helped me model faster, efficiently and most importantly, <strong>amaze my clients.</strong></p></li><li><p><strong>Monthly Updates</strong> - This course will be updated on a monthly basis with new high-quality tutorials and resources and you will get an in-depth understanding of how to design a modern contemporary bedroom, modular kitchen&nbsp;&amp;&nbsp;more.</p></li><li><p><strong>Taught by an Architect &amp;&nbsp;Interior Designer -</strong> We not only learn about modelling &amp; rendering in Sketchup, but you will also learn useful interior design tips, standards, and secrets along the way from the instructor who has over 6+&nbsp;years of experience in the Industry.</p></li><li><p><strong>Access to Exclusive Sketchup&nbsp;&amp;&nbsp;Vray Library - </strong>All our students will get exclusive access to our Sketchup&nbsp;Library for every Interior Design space worth over 150$. These models can be imported directly into your scene and rendered since it comes preloaded with Vray materials. <br></p></li></ul><p><strong>Who is this Course For?</strong></p><ul><li><p>Interior Designers</p></li><li><p>Architects</p></li><li><p>Students of Architecture &amp;&nbsp;Interior&nbsp;Design</p></li><li><p>Hobbyists</p></li><li><p>Construction Professionals </p></li><li><p>Anyone with an interest in 3D&nbsp;Modelling in Sketchup</p></li><li><p>Anyone with an interest in 3D&nbsp;Rendering with Vray Next for Sketchup</p></li></ul><p>(note that this course will be taught on the windows version but the same techniques can be applied in Mac as well)<br></p><p><strong>What you will Learn?</strong></p><p>It is crucial that when you learn Sketchup, you start with the right fundamentals (which is also easy to pick up). Once you've picked up on the fundamentals of 3D&nbsp;Modelling, we jump into more advanced topics using specific Sketchup plugins, to take your modelling to the Next Level.</p><p>This course is divided into <strong>Six Projects</strong></p><p>Prior to Project 01, we will have the introduction and how to install Sketchup, Vray &amp; all the essential plugins<br></p><p><strong>Introduction to Sketchup for Absolute Beginners</strong></p><p>In Project 01, we will start with the fundamentals</p><ul><li><p>Introduction to Sketchup Interface</p></li><li><p>Introduction to Sketchup Tools.</p></li><li><p>Introduction to Sketchup Default Tray<br></p></li></ul><p><strong>Project 01 - Model &amp;&nbsp;Render a Photorealistic Chic Bedroom with Vray 5 and Sketchup 2021 (Added ON July 2021)<br><br></strong>In this project, we will learn to use the latest versions of both Vray and Sketchup, namely Vray 5 and Sketchup 2021 respectively, to model, render and post-produce a Contemporary Chic Bedroom. We will also showcase some additional plugins which come in really handy while designing interiors such as profile builder, floor generator and sketchuv. Towards the end of the project, we create an additional sectional perspective render that would definitely \"wow\" your clients. </p><p><br></p><p><strong>Project 02 - Model &amp;&nbsp;Render a Living Room Scene with Vray 5 and Sketchup 2021 (BRAND&nbsp;NEW&nbsp;PROJECT - ADDED ON DECEMBER 2021)</strong></p><p>In this brand new project, you will learn to recreate a realistic Living Room render with all the new features of Vray 5. </p><p>Here's what you get to learn in this workshop:</p><ul><li><p>We'll start off the Sketchup model and learn how to create our room from an imported DWG file.</p></li><li><p>We will learn to design our living room space using various 3D Warehouse Models and Chaos Cosmos models. (you'll get a deep-dive on how I design Interior spaces)</p></li><li><p>We will set up the camera using different compositional techniques in Sketchup</p></li><li><p>We will set up the lighting properly in the scene using some new techniques taught exclusively in this workshop.</p></li><li><p>We will leverage VFB layers to boost our render further within Vray.</p></li><li><p>We will create a fur material for our rugs using Vray Fur and learn its various parameters.</p></li><li><p>We will learn to change the colours of our materials within the VfB window without having to use photoshop.</p></li><li><p>We will learn additional post-production techniques in Photoshop and learn how to add a beach scene behind our windows.</p><p><br></p></li></ul><p><strong>Project 03 -Modeling a Contemporary Bedroom</strong></p><p>In this project, we will start with the fundamentals </p><ul><li><p>We will learn to import images &amp;&nbsp;CAD&nbsp;into Sketchup</p></li><li><p>How to model our walls, floors, ceilings, doors &amp;&nbsp;windows.</p></li><li><p>How to model our Bedroom Placeholders </p></li><li><p>How to model our Wardrobes, Study Tables, &amp;&nbsp;TV&nbsp;Units.</p><p><br>We then learn some Advanced Sketchup&nbsp;Modelling Taught in this Course</p></li></ul><ul><li><p>Learn to model Beds using the&nbsp; Artisan Tools &amp;&nbsp;SubD</p></li><li><p>Learn to model Curtains using Clothworks</p></li><li><p>Learn to model Blankets &amp;&nbsp;Pillows using the Clothworks tool.</p></li><li><p>Create a Studio and import from 3D&nbsp;Warehouse the Right Way!</p></li><li><p>Create a Bean Bag in the Studio<br><br>We then jump into the world of photorealistic rendering with Vray Next for Sketchup. <br></p></li><li><p>We will be introduced to the Vray Interface &amp;&nbsp;the Vray Asset Editor</p></li><li><p>We will learn how to set up Vray Lights in our Bedroom and use an important lighting system. (Photographic Approach with the Archgyan Lighting System)</p></li><li><p>We will learn to create Vray materials like metal, cloth, wood, glass, glossy, matte laminate sheets. </p></li><li><p>We will also learn to use Vray-Fur to create rugs &amp; carpets, Vray-Infinite plane, Render elements, and loads more.</p></li><li><p>Finally, we learn how to render our final image using vray settings and also learn post-production techniques using Photoshop.</p><p><br></p></li></ul><p><strong>Project 04 - Model &amp;&nbsp;Render a Swing Wardrobe with Sketchup &amp;&nbsp;Vray Next (Added in March 2020)<br></strong>In this project, we will learn how to create a Swing Wardrobe in Sketchup as per interior design standards. We will learn the importance of composition and how to render the swing wardrobe in a Studio setting using Vray Next. <br><br><br><strong>Project 05 - Design &amp;&nbsp;Render a Modular Kitchen with Sketchup 2020 &amp;&nbsp;Vray Next (Added in April 2020)<br></strong>In this project, we will learn to model and render a Modular Kitchen. We will learn about the various standards, vray materials, lights and more to create an amazing looking Night Render of our Kitchen. We will also learn how to change material colours on Photoshop instead of re-rendering them on Sketchup. </p><p><br></p><p><strong>Project 06 - Design &amp;&nbsp;Render a Contemporary Bathroom with Vray 4 and Sketchup 2020 (Added in May 2020)</strong></p><p>Here's what you will learn in this project:</p><ol><li><p>Create a Vray Library in the Vray Asset Editor<br>This will help you create your best Vray Library which you can reuse for all future work, modelling &amp; rendering. Plus, I will be sharing the Exclusive Archgyan Vray Library with you.</p></li><li><p>Creating Multiple Options in the Same View<br>You will learn to create multiple options for the same views by leveraging Tags (Layers) &amp; Scenes. This is going to be super useful for all those Interior Designers out there.</p></li><li><p>Create New Materials<br>We will learn about various new maps like the falloff maps, edges maps and more. We will learn to create bathroom wall tiles using in-built Vray Maps and much more.</p></li><li><p>Add Vray Lights in a New Way<br>We will learn how to add lights in a new way and help you easily change the direction, cone angles &amp; penumbra angle of spotlights.</p></li><li><p>Leveraging VFB History</p><p>We will learn to render a photorealistic bathroom plus we will learn to leverage VFB History to check out before &amp; after of Renders.<strong><br></strong></p></li></ol><p><strong>Bonus Sections - Advanced Modeling in&nbsp;Sketchup</strong></p><p>In this section, we will learn to use plugins to create beanbags, tufted headboards, parametric shapes and a whole lot more.<br><br><strong>Bonus Sections - Advanced Vray for Sketchup Techniques<br><br></strong>In this section, we will learn to share the latest features in Vray, advanced techniques and more. <br></p><p><strong>Bonus Sections - Student Q/A Videos</strong></p><p>We help enhance your renders and point out areas of improvement which benefits other students as well.</p><p><br></p><p>We will keep updating this course with new course content and add it to the future sections on a monthly basis. We will be updating our course description here as and when we release new tutorials and downloadable resources. </p><p><br></p><p><strong>Special Features Provided</strong></p><ul><li><p>Downloadable Scenes, complete with all V-Ray Settings</p></li><li><p>Exclusive Student Group on Facebook</p></li><li><p>Exclusive Sketchup &amp;&nbsp;Vray Library for Interior Design</p><p><br></p></li></ul><p>By the end of the course, you will have a solid understanding of Sketchup &amp;&nbsp;Vray, and you will be well on your way to creating amazing renders for your clients. </p><p><br></p>","suitableLearners":["Interior Designers","Architects","Construction Professionals","Contractors","Furniture Designers","All those related to design & those who have an interest for 3D Modeling","Beginner to Advanced Sketchup Users","Beginner to Advanced Vray Users"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-02-23T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-02-26T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83499c9b04f3f624d7c2"],"topics":[],"reviews":[],"meta":{"ratingCount":1626,"studentCount":9580,"avgRatingScore":4.4976497,"contentVideoLength":7003},"basicInfo":{"udemyCourseId":1357521,"slug":"how-to-use-lighting-design-to-transform-your-home","title":"How to Use Lighting Design to Transform your Home","subtitle":"Learn How to Use Lighting in your Interior Design Like a Pro","image":"https://img-c.udemycdn.com/course/240x135/1357521_1641_5.jpg","price":1949670,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["Use 3 layers of light to create a cohesive and dramatic lighting scheme in any room of their home.","Calculate exactly how much artificial light each of their rooms need.","Effectively utilize and control both natural and artificial light in their home.","Select light fixtures appropriate to the type of room.","Place lighting fixtures appropriately throughout their room.","Hide unsightly electrical cords from table and floor lamps.","Create a simplified professional lighting plan.","Use artificial light to alter the intensity of colors in their room.","Use artificial light to make a room appear larger or smaller than it is.","Use artificial light to create a focal point in their room."],"requirements":["Students should have some paper and a pen or pencil ready for the activities.","Students should have access to a printer so they can print out the resources related to the class activities.","Students should come ready to engage themselves fully in a comprehensive training on lighting design."],"description":"<p><strong><em>Have you ever wondered how much light a room really needs?</em></strong></p><p><strong><em>Have you struggled with determining the right size light fixtures for the various spaces in your home?</em></strong></p><p><strong><em>Have you ever wondered how interior&nbsp;designers&nbsp;make a&nbsp;room look so much&nbsp;more dramatic through the use of lighting?&nbsp;</em></strong>&nbsp;</p><p>If you've ever asked yourself any of these questions, then I encourage you to check out this class! &nbsp;\"Lighting Design to Transform your home\" is a course focused exclusively on residential&nbsp;lighting design. &nbsp;More specifically, in&nbsp;this class we will cover the following main&nbsp;topics:</p><ul><li><p>3 great lighting tricks!</p></li><li><p>Why is lighting so important?</p></li><li><p>How to calculate the correct lumens for your rooms, including rooms with high ceilings or dark walls</p></li><li><p>How to effectively use and control both artificial and natural light in your home</p></li><li><p>How to use 3 layers of light to elevate your lighting design</p></li><li><p>How to choose the right type of light fixtures based on the function of your room</p></li><li><p>How to choose the right size light fixtures</p></li><li><p>How to install your light fixtures appropriately in your home</p></li><li><p>How to hide unsightly table and floor lamp cords</p></li><li><p>Use lighting to alter the intensity of colors in your room</p></li><li><p>Use lighting to make your room appear larger or smaller than it is</p></li><li><p>Use lighting to create a focal point in your room</p></li></ul><p><strong>There are also some fantastic, practical activities in this course:&nbsp; </strong></p><ol><li><p>By participating in activities throughout this course, I will walk you through how to <strong>build&nbsp;your own&nbsp;customized lighting design scheme for any room in your home</strong>.</p></li><li><p>To complement the work you will be doing on your lighting scheme, <strong>I will also teach you how to create a simplified professional lighting plan</strong>.&nbsp; </p></li><li><p>At the end of this course, you will put your newfound knowledge to work when <strong>you are given a hands-on opportunity to improve the lighting in 2 case studies.</strong> </p></li></ol><p>This is a great course for all levels of individuals&nbsp;who are interested in learning more about how to effectively build their own residential lighting plan. &nbsp;This could also be a great class for&nbsp;interior design students or&nbsp;professionals who are new to the field. &nbsp;</p><p>Join me for an adventure into the world of lighting design!</p><p><strong>IMPORTANT NOTES:</strong></p><ul><li><p>If you are interested in taking most or all of my courses,<strong> I have a recommended order in which to watch them</strong> (although it's certainly not required).&nbsp; I would start with \"How to Design a Room in 10 Easy Steps\" because most of my other courses are in-depth classes of the concepts touched on in this 10 step class.&nbsp; Following the 10 Step Course, I&nbsp;suggest moving on to \"How to Use Color Like a Pro\", followed by \"How to Work with Interior Design Styles Like a Pro\", then \"How to Use Lighting Design to Transform your Home\", and finally \"Design is in the Details\".&nbsp; My other courses, \"How to Use Minimalist Interior Design to Live your Best Life\", \"Use Eco-friendly, Sustainable Design to Improve Your Life\", and \"How to Design Your Dream Kitchen\" are all stand alone classes on specialty topics within interior design, and therefore, can be taken in any order.<br></p></li><li><p>Please be aware that this course, or any of my courses, is not intended to provide all of the knowledge needed to become a professional interior designer.&nbsp; As with any professional field, there is a significant amount of education and/or experience that is needed to achieve competency in this field.&nbsp; My intention with these courses is to provide some solid foundational knowledge to assist either those individuals interested in \"DIY\" interior design to work on their own projects more effectively, or to provide supplemental education to both interior design students and professionals.<br></p></li></ul>","suitableLearners":["This is a great course for anyone interested in taking their home's lighting design to the next level.","This course could also be a great supplemental educational course for interior design students or those new to the interior design field."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-11-12T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-11-15T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83499c9b04f3f624d7c2"],"topics":[],"reviews":[],"meta":{"ratingCount":1401,"studentCount":6682,"avgRatingScore":3.9959295,"contentVideoLength":33810},"basicInfo":{"udemyCourseId":263768,"slug":"intro-to-interior-design-course","title":"Intro to Interior Design Course","subtitle":"This course will give you good base of knowledge about interior design enough to start designing few project of your own","image":"https://img-b.udemycdn.com/course/240x135/263768_7960_5.jpg","price":1949670,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["Understanding all the basics of interior design","Understanding the concept inspiration styles process of interior design (they might seem simple words but for sure have big meanings!)","Ability to both read and create floorplan, elevation and section drawings","If you want you could actually make a full sample interior project explained step by step in 10 detailed steps provided in (Section 6) of the course","You will learn some details that many interior design graduate don't know a thing about it and they are very basic and important.","We are not just learning, but we are also having fun expanding our knowledge and experience","Downloadable exercise file will help so much understand some basics with in the course (all materials downloads are available now!)","Get ready to feel like an interior designer or actually be one!"],"requirements":["There are no special requirements for this course so you can set back and relax maybe make some tea or coffee and enjoy watching this course","On the other hand, you can participate by applying what you are learning by your self and make a sample interior design project of your own by taking this course"],"description":"<p style=\"\">  \t  This course is made carefully to take care of several levels of Interior Design lovers.  </p>  <p style=\"\">  \t  You will find your knowledge increasing gradually video by video without even knowing it and in no time you will reach the final video and end up with a very beautiful experience with this course brought to you with so much care of the details of the content, the sequence, and the presenting look of each video.  </p>  <p style=\"\">  \t  I am an interior designer and it took me 4 years to graduate and to tell the truth I have provided in this course information that are collected both from 4 years of study interior design and over 5 years of work experience.  </p>  <p style=\"\">  \t  Please enjoy the course and relax because this course will talk to your heart and then your mind.  </p>","suitableLearners":["Just interested in interior design","Graduate student who hasn't decided yet to go for interior design school or university and want to know about interior design","Interior design student who want's to be ahead of his/her mates and want's to feel already like an interior designer","Interior designer who didn't work in interior design yet and need a great refresher","Interior designer who want's to develope his/her knowledge about interior design"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2020-05-08T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2020-05-11T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83499c9b04f3f624d7c2"],"topics":[],"reviews":[],"meta":{"ratingCount":1087,"studentCount":4606,"avgRatingScore":4.6222816,"contentVideoLength":27095},"basicInfo":{"udemyCourseId":3713306,"slug":"learn-sketchup-pro-2021-the-right-way","title":"Learn SketchUp Pro 2021 the Right Way!","subtitle":"An easy to follow SketchUp course that teaches good 3d modeling habits to master.","image":"https://img-c.udemycdn.com/course/240x135/3713306_8a2a_2.jpg","price":1720270,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["Learn how to create and develop a 3D model of an interior space in SketchUp.","Learn how to adjust and add furniture, materials and textures to a model in SketchUp","Learn how to create a rendering and animation in SketchUp","Learn how to export to LayOut to create a presentation document with dimensions and notes."],"requirements":["PC or Mac (both are shown throughout the videos)","3-button Scroll Wheel Mouse is preferred over a trackpad."],"description":"<p>This beginner <strong>SketchUp Pro 2021</strong> course is created to have you learning proper techniques from the get-go! Start with good habits and begin learning SketchUp the right way.</p><p>Both <strong>PC and Mac</strong> versions of SketchUp Pro are shown throughout the course so that users get to see the UI correctly!</p><p>The course starts by going over the fundamental tools as well as setup of the template and toolbars. Next, you will build a simple interior living room space and develop the model into a document. Learn how to start from scratch, create a living room space and bringing up walls and push out door and window openings. Learn how to create groups and components as well as place furniture within the model. You will then add textures and materials to the model, learn how to import images and colors, and even artwork. You will also add details like trim and baseboards. You will also learn how to organize with SketchUp. Learn how to use tags to adjust the visibility of objects and create scenes to save camera positions for renderings or plans and elevations.</p><p>Lastly, we send the file to <strong>LayOut</strong>, SketchUp's paper space tool, where we will add pages, add a title block, labels, and dimensions to our design intent document.</p>","suitableLearners":["Beginner getting started in SketchUp.","Current SketchUp user looking to master better habits.","Interior designers or Architectural background looking to design in SketchUp."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-09-23T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-09-26T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83499c9b04f3f624d7c2"],"topics":[],"reviews":[],"meta":{"ratingCount":1005,"studentCount":3984,"avgRatingScore":4.404974,"contentVideoLength":35931},"basicInfo":{"udemyCourseId":2378614,"slug":"hvac-part1-with-hapexcelautocadmanual-calculations","title":"HVAC (PART1) with HAP|Excel|AutoCAD|Manual Calculations","subtitle":"A Practical Guide in the Heating Ventilation & Air Conditioning with Programs & Layouts (A Practical Project Included)","image":"https://img-b.udemycdn.com/course/240x135/2378614_a310_9.jpg","price":1949670,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["Design any HVAC system for any type of buildings.","Apply all the HVAC designs with the HAP software.","Design all the HVAC thermal loads calculations on the Excel software.","Design all the HVAC thermal load calculations with the manual calculations.","Read and Analyze AutoCAD architectural layouts .","Design the chiller systems and its required calculations.","Design the Ducts systems and their required calculations.","Design the Air-terminal Systems and their required calculations.","Understand all the Heat Ventilation and Air Conditioning fundamentals and basic concepts.","Understand some thermodynamics fundamentals that are basics for the HVAC design.","Work perfectly on the HAP Software.","Work perfectly on the Excel Software.","Work on the AutoCAD Software."],"requirements":["No prior experience is needed.","Just the passion to learn within your heart and leave the rest for us!"],"description":"<p><strong><em>\"Heat ventilation and air conditioning (HVAC) is one of the most important system for any building design\".</em></strong></p><p>Hello there,</p><ul><li><p>If the word 'HVAC' baffles your mind and you want to master it, then this is for you.</p></li><li><p>If you want to start your career in HVAC design&nbsp; and make money from it, then is for you.</p></li><li><p>If you want to learn how to design HVAC system for any Project, then this course is for you.</p></li><li><p>If you get bored of the word 'this course is for you', then this course is for you.</p></li><li><p>if you love the mechanical engineering.</p></li><li><p>if you are a mechanical engineering student. <br></p></li></ul><p>Well, <strong>HVAC </strong>is becoming a widely-used word on everybody's tongue, and this is reasonable as most the building designs must include the heating and ventilation requirements.</p><p>So we introduce to you the <strong>HEAT&nbsp;VENTILATION &amp; AIR CONDITIONING </strong>Design course that you need in order to get your hand on the HVAC design as this course collects most of the knowledge that you'll need in your journey.</p><p>We believe that the <strong>brain </strong>loves to keep the information that it finds <strong>applicable</strong>, and that's what we're doing here in UNITED ENGINEERING, we give you years of experience from our instructors that have been gathered in just one an interesting <strong>dose</strong>.</p><p>HVAC also is one of the mechanical engineering designing cores.</p><p><br></p><p><em>Our course is structured as follows:</em></p><ol><li><p>Discuss some thermodynamic for heating and ventilation fundamentals that will be the basics of that course.<br></p></li><li><p>Analyse&nbsp;the <strong><em>psychometric chart </em></strong>and learn how to use it.<br></p></li><li><p>Design the thermal loads for any project with the <strong><em>manual calculations</em></strong>.<br></p></li><li><p>Learn how to enter the <strong>standard handbooks&nbsp; like ASHRAE</strong>.<br></p></li><li><p>Use the<strong><em> Excel software</em></strong> to design the thermal load calculations automatically.<br></p></li><li><p>Apply with <strong><em>a practical project</em></strong> to calculate its total thermal loads with Excel.<br></p></li><li><p>Learn all the&nbsp;required details about the <strong>HAP&nbsp;software </strong>to implement your HVAC project automatically. <br></p></li><li><p>Design the air terminals system required for your HVAC project.<br></p></li><li><p>Design the Ducts system required for you HVAC project.<br></p></li><li><p>Learn about the direct expansion HVAC system and its different types.<br></p></li><li><p>Learn about the chiller HVAC systems and its different types.<br></p></li><li><p>Design the chiller system required pumping and piping systems.<br></p></li><li><p>Learn about the chiller system required controlling systems and valves.</p></li></ol><p><br></p><p><strong>** At this course </strong>:</p><ul><li><p>These tracks would be like a piece of cake to you.</p></li></ul><ul><li><p>We'll take you from the Scratch of Designing and Analysis.</p></li></ul><ul><li><p>You'll learn with practical exciting method in order to understand without being bored.</p></li></ul><p><strong><em>All you need is an open mind and the passion to be successful!</em></strong></p><p><br></p><p><strong>** Our help in YouCan is always available to you if you get stuck or have a question </strong>- our support is<em> legendary</em> in Udemy</p><p><strong>--&gt; So don't hesitate and click \"<em> Buy Now</em> \" button so you can begin on the right path!</strong></p><p><br></p>","suitableLearners":["Mechanical engineers","Mechanical engineering students","HVAC designers","Fluid mechanics students","Heat Ventilation and Air Conditioning students","Anyone who need to construct his HVAC project","Energy engineers","HAP designing students","Revit MEP students","Autocad mechanical students","Plumbing students","Piping students"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-09-25T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-09-28T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83499c9b04f3f624d7c2"],"topics":[],"reviews":[],"meta":{"ratingCount":770,"studentCount":4150,"avgRatingScore":4.4482117,"contentVideoLength":19166},"basicInfo":{"udemyCourseId":2389088,"slug":"how-to-design-your-dream-kitchen","title":"How to Design Your Dream Kitchen","subtitle":"Learn Kitchen Design from A to Z","image":"https://img-c.udemycdn.com/course/240x135/2389088_0341_2.jpg","price":1949670,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["Be able to select the right finishes for your dream kitchen","Learn the best areas to spend your money in a kitchen remodel","Understand when it's a good idea to bring in a designer or design/build firm","Learn important questions to ask your contractors to avoid costly mistakes","Learn what order work should be done in during a kitchen remodel","Identify ideal kitchen layouts for smaller and larger kitchens","Implement innovative storage solutions for your kitchen","Learn how to save money on your countertop and backsplash","Learn important guidelines for your backsplash installation","Learn the right questions to ask to help select the right appliances for your family"],"requirements":["Pen/Pencil"],"description":"<p><strong><em>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Do you dream of having a beautiful new kitchen, but don’t know where to start? <br><br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Are you about to start a kitchen remodel, but you are already overwhelmed with all of the choices you have to make? </em></strong><br><br>If this is you, then you have come to the right place! </p><p>Whether you are planning on simply updating your kitchen finishes or you are planning a complete kitchen gut remodel, the breadth of today’s kitchen options are truly incredible, and I am here to break it all down for you so that you feel confident in creating the perfect design for you.</p><p>This course really is the A-Z of kitchen design, covering the most important aspects of kitchen design, including, but not limited to:</p><ul><li><p>Realistic kitchen remodeling budgets and timelines</p></li><li><p>Knowing what to ask your contractors to avoid costly mistakes</p></li><li><p>Sorting through all of the functional and aesthetic decisions you’ll need to make during the kitchen design process including, but not limited to, layouts, cabinetry, lighting, window coverings, breakfast nooks, countertops, backsplashes, appliances, and hardware</p></li><li><p>How to mix metal finishes in the kitchen like a Pro</p></li><li><p>How to choose the best kitchen style for you and your home</p></li><li><p>How to save money when purchasing countertops and backsplashes</p></li><li><p>Learn the latest in innovative storage solutions and the best small kitchen design hacks</p></li></ul><p>I’ll also provide you with some invaluable downloadable resources, first and foremost, a \"Master Kitchen Design Planner\", which we’ll complete together in the course, and once completed, will contain all of the design details you’ll need for your kitchen remodel. You’ll also be able to download my \"Ultimate Kitchen Design Style Guide\", which contains a wealth of information, covering the ideal finishes and selections for whichever style of kitchen you choose.</p><p>In short, kitchen design is complicated.&nbsp; Unless you are a seasoned interior designer who already has experience in kitchen design, I encourage you to enroll, as this course is ideal for both non-designers as well as professional interior designers who are new to the world of kitchen design.&nbsp; I look forward to seeing you in the course!</p><p><strong><br>IMPORTANT NOTES:</strong></p><ul><li><p>If you are interested in taking most or all of my courses,<strong> I have a recommended order in which to watch them</strong> (although it's certainly not required).&nbsp; I would start with \"How to Design a Room in 10 Easy Steps\" because most of my other courses are in-depth classes of the concepts touched on in this 10 step class.&nbsp; Following the 10 Step Course, I&nbsp;suggest moving on to \"How to Use Color Like a Pro\", followed by \"How to Work with Interior Design Styles Like a Pro\", then \"How to Use Lighting Design to Transform your Home\", and finally \"Design is in the Details\".&nbsp; My other courses, \"How to Use Minimalist Interior Design to Live your Best Life\", \"Use Eco-friendly, Sustainable Design to Improve Your Life\", and \"How to Design Your Dream Kitchen\" are all stand alone classes on specialty topics within interior design, and therefore, can be taken in any order.<br></p></li><li><p>Please be aware that this course, or any of my courses, is not intended to provide all of the knowledge needed to become a professional interior designer.&nbsp; As with any professional field, there is a significant amount of education and/or experience that is needed to achieve competency in this field.&nbsp; My intention with these courses is to provide some solid foundational knowledge to assist either those individuals interested in \"DIY\" interior design to work on their own projects more effectively, or to provide supplemental education to both interior design students and professionals.</p></li></ul>","suitableLearners":["This course is ideal for anyone who wants to learn how to design their dream kitchen","This course is also for professional interior designers who are new to the field of kitchen design"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-03-17T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-03-20T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83499c9b04f3f624d7c2"],"topics":[],"reviews":[],"meta":{"ratingCount":740,"studentCount":4180,"avgRatingScore":4.5830293,"contentVideoLength":6581},"basicInfo":{"udemyCourseId":1474464,"slug":"use-minimalist-interior-design-to-live-your-best-life","title":"Use Minimalist Interior Design to Live your Best Life","subtitle":"Minimalist Interior Design Deconstructed","image":"https://img-b.udemycdn.com/course/240x135/1474464_c003_2.jpg","price":1949670,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["Create a minimalist interior design plan for any room of their home.","Identify the main principles of minimalist interior design.","Apply successful decluttering techniques to their own home.","Understand what makes a great focal point for a room.","Understand how to use negative space as a design element.","Understand how to incorporate harmony and balance in their interior design."],"requirements":["Pen/pencil","Scratch paper"],"description":"<p><strong><em>Do you want to learn how minimalist interior design can help to create mental clarity, calmness and increased productivity?<br>Do you want a home that is beautiful, stress-free, and easy to clean?<br>Do you love minimalist design but are worried that your room will look cold and bare, rather than stylishly pulled together?</em></strong></p><p>If you answered yes to any of these questions, then I encourage to check out this course!&nbsp; Minimalist interior design is a hot design trend right now, and for good reason.&nbsp; In this course I will show you exactly why it's so popular today, but more importantly, I will help you translate this beautiful and chic design style into your own home.&nbsp; By the end of this class, you will be able to:</p><ul><li><p>Use 3 Easy Ways to Begin your Minimalist Journey Today!</p></li><li><p>Understand why Minimalism is such a Popular Design Trend&nbsp; &nbsp;</p></li><li><p>Articulate the Main Principles of Minimalist Interior Design&nbsp; &nbsp;</p></li><li><p>Utilize my Favorite Decluttering Techniques&nbsp; &nbsp;</p></li><li><p>Effectively Deal with Favorite Collections and Sentimental Items&nbsp; &nbsp;</p></li><li><p>Choose a Calming Color Scheme&nbsp; &nbsp;</p></li><li><p>Create a Focal Point&nbsp; &nbsp;</p></li><li><p>Use Negative Space as a Design Element&nbsp; &nbsp;</p></li><li><p>Achieve Balance and Harmony in a Room</p></li></ul><p>In this course, you will be encouraged to print out a template that will allow you to create your own minimalist interior design plan for a room of&nbsp;your home,&nbsp;via activities through which I will guide you&nbsp;throughout this course.</p><p>This is a great course for all levels of individuals&nbsp;who are interested in learning more about how to use minimalist interior design to improve their homes and their lives.</p><p>Join me for a journey into the beautiful world of minimalist interior design!</p><p><strong>IMPORTANT NOTES:</strong></p><ul><li><p>If you are interested in taking most or all of my courses,<strong> I have a recommended order in which to watch them</strong> (although it's certainly not required).&nbsp; I would start with \"How to Design a Room in 10 Easy Steps\" because most of my other courses are in-depth classes of the concepts touched on in this 10 step class.&nbsp; Following the 10 Step Course, I&nbsp;suggest moving on to \"How to Use Color Like a Pro\", followed by \"How to Work with Interior Design Styles Like a Pro\", then \"How to Use Lighting Design to Transform your Home\", and finally \"Design is in the Details\".&nbsp; My other courses, \"How to Use Minimalist Interior Design to Live your Best Life\", \"Use Eco-friendly, Sustainable Design to Improve Your Life\", and \"How to Design your Dream Kitchen\" are all stand alone classes on specialty topics within interior design, and therefore, can be taken in any order.<br></p></li><li><p>Please be aware that this course, or any of my courses, is not intended to provide all of the knowledge needed to become a professional interior designer.&nbsp; As with any professional field, there is a significant amount of education and/or experience that is needed to achieve competency in this field.&nbsp; My intention with these courses is to provide some solid foundational knowledge to assist either those individuals interested in \"DIY\" interior design to work on their own projects more effectively, or to provide supplemental education to both interior design students and professionals.<br></p></li></ul>","suitableLearners":["This course is for anyone looking to create a simplified, cohesive interior design for their home"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-11-09T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-11-12T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83499c9b04f3f624d7c2"],"topics":[],"reviews":[],"meta":{"ratingCount":702,"studentCount":5050,"avgRatingScore":3.266268,"contentVideoLength":5907},"basicInfo":{"udemyCourseId":507172,"slug":"design-your-room-using-sketchup","title":"Design your Room Using Sketchup","subtitle":"Learn the principles of interior design and how to use SketchUp to make a 3D model of a bedroom's layout and décor.","image":"https://img-c.udemycdn.com/course/240x135/507172_7793_3.jpg","price":458570,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["Learn how to design a dream bedroom, from choosing the right paint colors, to placing your furniture in their optimal places throughout the space","Know how to use the SketchUp 3D modeling program to design any room"],"requirements":["A computer onto which you can download the SketchUp program"],"description":"<p style=\"\">This course will guide you through two exciting elements of design: the SketchUp 3D modeling program and the interior design principles that have allowed the instructor and interior designer, <strong style=\"\">Rebecca <span style=\"\">Robeson</span>,</strong> to create award-winning bedrooms.</p><p style=\"\">If you&#039;re interested in interior design, even if it&#039;s just to improve the way your home flows and feels, this fun course will show you how to apply basic design techniques that will make your home look like it was professionally designed.</p><p style=\"\"><strong style=\"\">Master Basic Interior Design Principles You Can Easily Apply</strong></p><ul style=\"\"><li style=\"\">Create a virtual model of a sample bedroom using SketchUp</li><li style=\"\">Learn how to properly arrange furniture to make the most of a bedroom space</li><li style=\"\">Choose the best paint colors, accessories, and lighting for a bedroom<strong style=\"\"></strong></li></ul><p style=\"\"><strong style=\"\">Use the SketchUp 3D Modeling Program to Design the Perfect Bedroom</strong></p><p style=\"\">Whether you&#039;re an interior designer, someone who&#039;s interested in interior design, or someone who simply wants to make their home look its best, this course will show you how to download and use the easy-to-learn interior design program, SketchUp, to design a samplebedroom.</p><p style=\"\">Once you&#039;re comfortable designing this sample bedroom, you can then use the same principles to create your own dream bedroom as well as other rooms throughout your home. <strong style=\"\"></strong></p><p style=\"\"><strong style=\"\">Contents and Overview</strong> </p><p style=\"\">The first half of this course will focus on how to use SketchUp. </p><p style=\"\">You&#039;ll download it, set up your toolbar, and create the walls of your room. You&#039;ll also master the paint tool, as well as the doors, windows, and component library. </p><p style=\"\">Once the room is set up as a 3D model, you can move on to the second half of the course, which focuses on decorating a bedroom virtually before tackling it in the real world.</p><p style=\"\">You&#039;ll begin with furniture placement so you can set every piece of furniture, from your bed to your nightstand, in its optimal place. This includes choosing the right wall that your bed should be placed against.</p><p style=\"\">A great design also encompasses the right wall colors and artwork, so you&#039;ll tackle how to select the best wall colors, and you&#039;ll understand the role that art plays in your design so you can choose the right pieces to display. </p><p style=\"\">Accessories and lighting, as well as area rugs and window treatments, will serve to complete the look of your sample bedroom and bring everything together, so you&#039;ll learn how to find complementary décor and where to place it.</p><p style=\"\">By the end of this course, you&#039;ll know how to use SketchUp to create customized designs for every room in your home, not just your bedroom. <strong style=\"\">You will be ready to move on to the next level by creating your own completely scaled bedroom, providing you the opportunity to design your own virtual reality dream bedroom. </strong></p><p style=\"\">You&#039;ll even be invited to post screenshots of your design on the <span style=\"\">Robeson</span> Design Facebook page to show off your new skills.</p>","suitableLearners":["Anyone interested in interior design or in upgrading their décor","Interior designers of all levels"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2015-08-04T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2015-08-07T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83499c9b04f3f624d7c2"],"topics":[],"reviews":[],"meta":{"ratingCount":618,"studentCount":3416,"avgRatingScore":4.797757,"contentVideoLength":11732},"basicInfo":{"udemyCourseId":1693060,"slug":"use-eco-friendly-sustainable-design-to-improve-your-life","title":"Use Eco-friendly, Sustainable Design to Improve your Life","subtitle":"Save Money and Live Healthier through Eco-Friendly Interior Design","image":"https://img-c.udemycdn.com/course/240x135/1693060_8015_11.jpg","price":1949670,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["Learn how to save money in the areas of energy, water, and lighting for your home","Improve your indoor air quality by choosing green finishes and furnishings for your home","Be able to explain the difference between eco-friendly and sustainable interior design","Understand and apply the main principles of green interior design to your own home","Be able to make green selections for all the finishes of your home (e.g., floors, walls, kitchen)","Be able to make green selections for all types of furnishings in your home (e.g., furniture, textiles, accessories)","Learn where to source green finishes and furnishings for your home","Create your own residential eco-friendly interior design plan","For design professionals, learn about green certifications/accreditations available to you"],"requirements":["Pen/pencil","Scratch paper"],"description":"<p><strong><em>Do you want to save money on your utilities and improve your indoor air quality?</em></strong></p><p><strong><em>Are you interested in making changes to your home to make it more eco-friendly and sustainable?</em></strong></p><p><strong><em>Are you a design professional who wants to learn how to incorporate this hot design movement into your own business?<br></em></strong></p><p>If you answered with a resounding \"yes!\" to any of these questions, then this will be a great course for you!&nbsp; Eco-friendly, sustainable design is a rapidly evolving area of interior design with so many choices available today.&nbsp; For the average consumer, it can be incredibly overwhelming.&nbsp; My goal with this course, is to break it all down for you so that you can create your own eco-friendly dream home at your own pace.&nbsp;&nbsp;</p><p>By the end of this class, you will be able to:</p><ul><li><p>Use 3 Easy Ways to Incorporate Green Interior Design into Your Home Today</p></li><li><p>Understand why Eco-Friendly, Sustainable Design is More Important than Ever</p></li><li><p>Explain the Difference Between the Terms,&nbsp;\"Eco-Friendly\" and \"Sustainable\"</p></li><li><p>Articulate the Main Principles of Eco-Friendly, Sustainable&nbsp;Interior Design&nbsp; &nbsp;</p></li><li><p>Implement&nbsp;Affordable and Higher End Upgrades to improve Your Energy Efficiency</p></li><li><p>Implement&nbsp;Easy Ways to improve Your Water&nbsp;Efficiency</p></li><li><p>Maximize your Natural and Artificial Lighting in an Eco-Friendly Way</p></li><li><p>Improve Your Indoor Air Quality</p></li><li><p>Understand the&nbsp;Green Finishes and Furnishings Available&nbsp;for Your Home and Where to Source Them</p></li><li><p>If You're a Professional, You Will Learn About Green Professional Certifications&nbsp;and Green Trade-Only Vendors</p></li></ul><p>In this course, you will have an opportunity to apply the information in a very practical way through two exercises:&nbsp; By creating a list of current and future upgrades that you can make to&nbsp;your home, and by creating your own eco-friendly, sustainable interior design plan.&nbsp; I've also included a bonus lecture that will show you other easy ways to&nbsp;\"green\" your home and your life.</p><p>This is a great course for all levels of individuals&nbsp;who are interested in learning more about green interior design, and more importantly, how they can easily incorporate these principles into their own homes.&nbsp; It’s also an ideal&nbsp;course for design professionals who want to learn how to incorporate green design into their own business.</p><p>Please join me as I&nbsp;help you to navigate the&nbsp;rapidly evolving world of eco-friendly, sustainable&nbsp;interior design!</p><p><strong>IMPORTANT NOTES:</strong></p><ul><li><p>If you are interested in taking most or all of my courses,<strong> I have a recommended order in which to watch them</strong> (although it's certainly not required).&nbsp; I would start with \"How to Design a Room in 10 Easy Steps\" because most of my other courses are in-depth classes of the concepts touched on in this 10 step class.&nbsp; Following the 10 Step Course, I&nbsp;suggest moving on to \"How to Use Color Like a Pro\", followed by \"How to Work with Interior Design Styles Like a Pro\", then \"How to Use Lighting Design to Transform your Home\", and finally \"Design is in the Details\".&nbsp; My other courses, \"How to Use Minimalist Interior Design to Live your Best Life\", \"Use Eco-friendly, Sustainable Design to Improve Your Life\", and \"How to Design Your Dream Kitchen\" are all stand alone classes on specialty topics within interior design, and therefore, can be taken in any order.<br></p></li><li><p>Please be aware that this course, or any of my courses, is not intended to provide all of the knowledge needed to become a professional interior designer.&nbsp; As with any professional field, there is a significant amount of education and/or experience that is needed to achieve competency in this field.&nbsp; My intention with these courses is to provide some solid foundational knowledge to assist either those individuals interested in \"DIY\" interior design to work on their own projects more effectively, or to provide supplemental education to both interior design students and professionals.</p></li></ul>","suitableLearners":["This course is for anyone looking to incorporate eco-friendly, sustainable interior design into their home","This course is also for interior design professionals who want to add eco-friendly design practices into their business"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-11-12T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-11-15T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83499c9b04f3f624d7c2"],"topics":[],"reviews":[],"meta":{"ratingCount":480,"studentCount":2340,"avgRatingScore":4.5941978,"contentVideoLength":10583},"basicInfo":{"udemyCourseId":40393,"slug":"feng-shui-the-easiest-way","title":"Feng Shui The Easiest Way","subtitle":"How to Feng Shui home & office: have better health, attract supportive relationships and success.","image":"https://img-c.udemycdn.com/course/240x135/40393_0725_6.jpg","price":1032070,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":[" By the end of this course you will know how to Feng Shui your home quickly and on a budget","You will learn how to arrange your home so that it is balanced and harmonious","You will learn Feng Shui prosperity secrets so that you can make more money and attract more customers","Find out what to place in your home so that you can avoid quarrels and create fulfilling relationships","Know what to do to stop your home from draining money"],"requirements":["Internet connection","Printer","Access to email"],"description":"<p>Feng  Shui Basics: Feng  Shui Tips for Home &amp; Office is a detailed, yet easy to follow program, in which  I teach you how to Feng Shui your entire home and create balance as  I reveal all the inside secrets to improve the health, bring more money into  your home, create harmonious relationships, and increase happiness of all who  live within your walls.</p>\n\n<p>In this video Feng Shui basics course, I will show you how I arrange each of these  rooms: the entrance way and front door, the living room, family room and master  bedroom, a child’s bedroom, a teenager’s room and a guest bedroom, plus the  kitchen, bathroom and home office.</p>\n\n\n\n<p>In this Feng Shui basics program, you will discover how to avoid the common  mistakes most people make with furniture arrangement and basic Feng Shui  principles. </p>\n\n\n\n<p>Course Content of Feng Shui Basics: Feng Shui Tips for Home &amp; Office:</p>\n\n\n\n<p>&lt;/p&gt;<strong>Section 1 Feng shui Overview<br><br> </strong> 01. Welcome from Glenda<br>  02. Your Entry Way &amp; Front Door: Where Prosperity Flows Into Your Home<br>  03. Feng Shui Basics: Preventing Prosperity Leaks<br>  04. How to Use The 5 Elements of Nature in Feng Shui<strong><br><br>Section 2: Begin Walking Through Homes With Glenda<br><br>  </strong>05. Curb Appeal, Your Driveway, &amp; Your Living Room Part 1<br>  06. Curb Appeal, Your Driveway, &amp; Your Living Room Part 2<strong><br><br>Section 3: Feng Shui Your Bedroom: One of the 2 Most Important Places in Your Home<br><br>  </strong>07. Your Master Bedroom: Are You Set up for Romance?<br>  08. Guest Rooms &amp; Child's Room: Setting Your Child up for Success<strong><br><br>Section 4: Where Money Draining From Your Home: Bathroom, Kitchen, Dining Room<br>   <br> </strong> 09. Why You Don't Want to Ignore Your Bathroom When it Comes to Feng shui<br>  10. The Heart of Your Home: How to Double Your Prosperity<br><br><strong>Section 5:  </strong><br><br>  11. Final Words From Glenda</p>","suitableLearners":["Business owners who want to bring in more clients","Parents who want to have stronger relationships with their children","Anyone who is struggling to find love or lasting relationships","Students who want to have better concentration","Home decorators"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2020-08-18T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2020-08-21T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83499c9b04f3f624d7c2"],"topics":[],"reviews":[],"meta":{"ratingCount":470,"studentCount":2143,"avgRatingScore":4.0399427,"contentVideoLength":9885},"basicInfo":{"udemyCourseId":1277146,"slug":"sketchup-make-from-beginner-to-advanced","title":"SketchUp Make - From beginner to advanced","subtitle":"Design anything with the 3D modeling software, SketchUp.","image":"https://img-c.udemycdn.com/course/240x135/1277146_db1e_5.jpg","price":917370,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["You will know how to customize your toolbar","You will know how to navigate with a mouse and a trackpad","You will know how to draw lines parallel to the axes","You will know how to use the select tool","You will know how to use the eraser tool","You will know how to draw rectangles","You will know how to draw circles and polygons","You will know how to draw arcs","You will know how to use the freehand tool","You will know how to use the push and pull tool","You will know how to use the offset tool","You will know how to move and rotate objects in SketchUp","You will know how to use the scale tool","You will know how to use the follow me tool","You will know how to use the paint bucket tool","You will know how to create your own texture","You will know how to use the 3D warehouse","You will know the difference between groups and components","You will know how to create landscape","You will know how to create a little cottage"],"requirements":["Have access to a computer and knowing how to use it"],"description":"<p><strong>What is SketchUp?</strong></p><p>SketchUp is one of the most popular 3D modeling program out there that is used to visualize ideas. In fact, Sketchup is used in many professions such as architecture, interior designing, landscape architecture, video game designing and so on. </p><p><strong>Who is the ideal student for this course?</strong></p><p>If you have no experience with SketchUp, what so ever. Or if you've played around with it for a little bit and just but want to get more acquainted with the program. Either way, this is the perfect course for you!</p><p><strong>In this course, you will learn the following</strong></p><p>In the first section of the course, you will learn how to use every main tool in SketchUp with confidence, as well as, learning a few advanced skills that you are going to use a lot in the future.  In the second section, I will then help you to create your first little cottage as well as designing the interior by yourself.</p><p><strong>My promise to you</strong></p><p>I'll be here for you every step of the way. If you ever feel lost or just feel like you don't understand something specific then you can always post a question inside of the course or send me a direct message. </p><p>I want to make this the best course on how to use SketchUp. So if there is any way I can improve this course, just tell me and I'll try my best to fix it</p>","suitableLearners":["Beginners who are just starting out and know absolutely nothing how to use Sketchup","Anyone who has been using Sketchup for a while and want's to gain their knowledge of Sketchup and learn new tips and tricks!"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2018-11-24T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2018-11-27T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83499c9b04f3f624d7c2"],"topics":[],"reviews":[],"meta":{"ratingCount":442,"studentCount":2091,"avgRatingScore":4.9172297,"contentVideoLength":9737},"basicInfo":{"udemyCourseId":3158226,"slug":"everything-small-home-design","title":"Everything Small Home Design","subtitle":"Small Home Living at its Best","image":"https://img-c.udemycdn.com/course/240x135/3158226_949f_2.jpg","price":1949670,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["Great design tips/techniques for every room in your home, including your outdoor area","How to make your small rooms appear bigger","Best storage hacks for your small home","Learn where to go \"big\" and where to go \"small\" when selecting furnishings","How to strategically use color/patterns in your home","Understand the most effective ways to divide open spaces","How to select the best lighting fixtures for each room of your home","How to most effectively use open shelving in your home"],"requirements":["Pen/Pencil"],"description":"<p><strong><em>&nbsp; &nbsp; &nbsp;&nbsp; &nbsp; &nbsp;Are you challenged on how to most effectively design your small room or home?<br>&nbsp; &nbsp; &nbsp;&nbsp; &nbsp; &nbsp;Do you feel constrained functionally and/or aesthetically by your smaller space?<br>&nbsp; &nbsp; Do you feel paralyzed for fear of making the wrong design decisions in your small home?</em></strong></p><p><br>If you answered yes to any of these questions, this course is here to help!</p><p>Whether you live in an apartment, condo, flat, townhouse, loft, or single family home, this course has been designed to give you the right tips, techniques, and approaches to make the most out of your space both functionally and aesthetically. </p><p><strong>**PLEASE NOTE:</strong>&nbsp; This course does <strong>NOT</strong> include \"tiny house\" design/decoration.&nbsp; As stated above, this course is for those who live in smaller homes, such as apartments, condominiums, flats, townhouses, lofts, or single family houses.**</p><p>This course covers a wide range of topics related to small home design and decoration, including, but not limited to:</p><ul><li><p>4 pro ways to make a room look bigger and the 4 biggest mistakes to avoid in your small home</p></li><li><p>Design techniques and approaches for every room in your small home, including your outdoor space</p></li><li><p>How to make your small rooms appear bigger</p></li><li><p>Where to go \"big\" and where to go \"small\" when selecting furnishings</p></li><li><p>Best storage hacks for your small home</p></li><li><p>Great \"double duty\" pieces </p></li><li><p>How to strategically use color and patterns in your home</p></li><li><p>Best approaches for effectively dividing open spaces</p></li><li><p>Excellent lighting techniques for every room of your home</p></li><li><p>How to most effectively use open shelving in your home</p></li></ul><p>You will also be guided through two hands-on activities in this course.&nbsp; First, you will have the opportunity to immediately apply your learning in three guided small room case studies.&nbsp; Then, using a customized planner that I created especially for this course. you will create a comprehensive room design for one of your own small rooms, as nothing will help you to cement the concepts and techniques you learned in this course more quickly than immediately applying them to a real world situation.</p><p>In short, my goal with this course is to help you fall in love with your small home by showing you the techniques and approaches that interior design professionals regularly use to create small home magic.&nbsp; I look forward to seeing you in the course!</p><p><strong><br>IMPORTANT NOTES:</strong></p><ul><li><p>If you are interested in taking most or all of my courses,<strong> I have a recommended order in which to watch them</strong> (although it's certainly not required).&nbsp; I would start with \"How to Design a Room in 10 Easy Steps\" because most of my other courses are in-depth classes of the concepts touched on in this 10 step class.&nbsp; Following the 10 Step Course, I&nbsp;suggest moving on to \"How to Use Color Like a Pro\", followed by \"How to Work with Interior Design Styles Like a Pro\", then \"How to Use Lighting Design to Transform your Home\", and finally \"Design is in the Details\".&nbsp; My other courses, \"How to Use Minimalist Interior Design to Live your Best Life\", \"Use Eco-friendly, Sustainable Design to Improve Your Life\", \"How to Design Your Dream Kitchen\", and \"Everything Small Home Design\" are all stand alone classes on specialty topics within interior design, and therefore, can be taken in any order.<br></p></li><li><p>Please be aware that this course, or any of my courses, <strong>is not intended to provide all of the knowledge needed to become a professional interior designer</strong>.&nbsp; As with any professional field, there is a significant amount of education and/or experience that is needed to achieve competency in this field.&nbsp; My intention with these courses is to provide some solid foundational knowledge to assist either those individuals interested in \"DIY\" interior design to work on their own projects more effectively, or to provide supplemental education to both interior design students and professionals.</p></li></ul>","suitableLearners":["This course is ideal for anyone who wants to learn how to great design techniques for small homes","This course is also ideal for interior design students and professional interior designers who are new to their field"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-11-15T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-11-18T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83499c9b04f3f624d7c2"],"topics":[],"reviews":[],"meta":{"ratingCount":306,"studentCount":1497,"avgRatingScore":4.5950985,"contentVideoLength":13051},"basicInfo":{"udemyCourseId":433188,"slug":"store-design-how-to-design-successful-retail-stores","title":"Store Design:  How to Design Successful Retail Stores","subtitle":"Everything you need to know to create effective brick & mortar retail stores: Image, Display, Storefront, and Lighting.","image":"https://img-c.udemycdn.com/course/240x135/433188_0800_6.jpg","price":458570,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["Design or evaluate any type of retail store, in any location using the tools and techniques presented in this Store Design course. You will learn how to convert your client’s image of the store into a three-dimensional reality show. To do this you will learn product presentation, store planning, storefront design and the special requirements of retail lighting.","This course is best suited for people who are designers, retailers, or real estate executives who can use this new knowledge to design a store or evaluate a retail store design. Architectural or interior design students can use the course as a basis for school projects. This course is only intended for \"brick and mortar\" stores, and is not for the design of on-line stores."],"requirements":["No special materials or software are required for this course. However, it would be a good idea, for 2 or 3 days, to take special notice of retail stores you encounter in your everyday activities before starting the course. Identify the designs you think are effective and pleasing, and those that fail. And if possible, come to some conclusions as to why they succeed or fail. This focus will get you ready to take the course. See you soon.","Optionally, you may wish to purchase the companion book to this course, STORE DESIGN: A Complete Guide to Designing Retail Stores. This book is available at all on-line book retailers, or usually by special order at local brick-and-mortar bookstores. While it is not a required element of this course, it would be a useful tool for understanding the store design process and as a handy summary reference."],"description":"<p><span class=\"projectsummarydescription\"><strong></strong><strong> Store Design </strong>is an informative, stimulating<strong></strong> course that provides everything you need to  design retail stores. You will create stores that establish a strong image, attract shoppers, and motivate buying...in short, well-conceived designs...that sell. NOTE: Before you purchase this course, please understand this course is not a substitute for practical experience or knowledge in the world of design and construction. To use this course successfully, other than to just gain a better understanding of this interesting and distinctive design field, you will have to have basic architectural/interior design knowledge and/or experience.</span></p>\n\n<p><span class=\"projectsummarydescription\"><strong>You will gain a comprehensive knowledge of what makes a successful retail store design, and the pitfalls to avoid.</strong></span></p>\n\n<ul><li>Determine the correct image for your store</li><li>Design a sensible, logical floor plan</li><li>Create totally effective product presentation</li><li>Design storefronts that attract, sell and reinforce the store image</li><li>Design vibrant and effective lighting</li></ul>\n\n<p><strong>Store Design is your guided tour through the entire retail design process.</strong></p>\n\n<p>Design fast and effectively and explain the reasons for your design decisions. Take the mystery out of the process. The axiomatic elements of the design of stores are presented in simple diagrams with straight-forward language. It's a structured process leading to design success. Of course, you are still the designer. This comprehensive course is your toolkit to use to increase your abilities and critical perception. </p>\n\n<p>The skills of a store designer are always in demand. This is an exciting, edgy, and never-boring area of work. The store design process moves quickly, and it's full of theater and fun. Unlike other project types which may take years to complete, the products of your imagination in retail will be revealed in a matter of weeks.</p>\n\n<p><span class=\"projectsummarydescription\">After you complete the course, you will have the confidence to know that your store design will work functionally, aesthetically, and psychologically. You will always create the right concept for every product, every location, and every retailer, because you will have sound design principles on which to base every decision. </span><br> <br> <span class=\"projectsummarydescription\"><strong>Take the course: broaden your skills, become more marketable, and have fun creating cutting-edge retail stores. You'll be amazed how fast you can become an expert in the exciting field of retail store design.</strong></span></p>","suitableLearners":[],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2020-10-08T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2020-10-11T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83499c9b04f3f624d7c2"],"topics":[],"reviews":[],"meta":{"ratingCount":262,"studentCount":1181,"avgRatingScore":4.258789,"contentVideoLength":4475},"basicInfo":{"udemyCourseId":3153074,"slug":"styling-and-staging-interior-spaces","title":"Styling and Staging Interior Spaces","subtitle":"Interior styling and staging is the key to character and interest in interior projects.","image":"https://img-c.udemycdn.com/course/240x135/3153074_dfc2_2.jpg","price":1949670,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["Styling and Staging Interior Spaces"],"requirements":["A passion for all things interior design and decorating is highly recommended."],"description":"<p>Become a pro in styling interiors and staging your (and your clients) interior spaces. Once you know how, it’s easy! Learn how to artfully rearrange existing furnishings, surfaces, artwork and accessories to transform any room into a stylish, revitalized and inviting space that reflects personal style and taste.</p><p><br></p><p><strong>IMPORTANT NOTE:</strong></p><p>All of our courses have been designed to be stand-alone courses and can be done in any order. However, if you are interested in taking all of our courses – we’d like to recommend an order in which to do them (although it’s not required):</p><p>· Popular Interior Design Styles and How to Use Them</p><p>· Design Principles &amp; Elements in Interiors</p><p>· Introduction to Colour In Interiors</p><p>· Textiles &amp; Fabrics</p><p>· Introduction to Space Planning</p><p>· Staging and Styling Interior Spaces</p><p>· Simple Guide to Curtains and Blinds in Interiors</p><p>· Simple Guide to Furniture Styles in Interiors</p>","suitableLearners":["•\tThis course is ideal for anyone who wants to learn great interior design and decorating techniques","•\tThis course is also ideal for enthusiasts, interior design students and professional interior designers who are new to their field"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2020-05-25T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2020-05-28T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83499c9b04f3f624d7c2"],"topics":[],"reviews":[],"meta":{"ratingCount":245,"studentCount":919,"avgRatingScore":4.345534,"contentVideoLength":3011},"basicInfo":{"udemyCourseId":3148768,"slug":"design-principles-and-elements-in-interiors","title":"Design Principles and Elements in Interiors","subtitle":"The Role of Design Principles and Elements in Interior Decorating & Design","image":"https://img-c.udemycdn.com/course/240x135/3148768_1465_2.jpg","price":1949670,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["Design Principles & Elements and how they can be used to create harmonious interiors."],"requirements":["A passion for all things interior design and decorating is highly recommended."],"description":"<p>Once you are able to identify and work with the essential ingredients - the design elements and principles - of interior decorating, you will be able to transform any space. Design principles and elements are the best toolkit for any interior space an all aspects of interior decorating and design is dependent on them. The correct and creative use of design principles will make an interior space feel cohesive and well put together.&nbsp; </p><p><br></p><p><strong>IMPORTANT NOTE:</strong></p><p>All of our courses have been designed to be stand-alone courses and can be done in any order. However, if you are interested in taking all of our courses – we’d like to recommend an order in which to do them (although it’s not required):</p><p>· Popular Interior Design Styles and How to Use Them</p><p>· Design Principles &amp; Elements in Interiors</p><p>· Introduction to Colour In Interiors</p><p>· Textiles &amp; Fabrics</p><p>· Introduction to Space Planning</p><p>· Staging and Styling Interior Spaces</p><p>· Simple Guide to Curtains and Blinds in Interiors</p><p>· Simple Guide to Furniture Styles in Interiors</p>","suitableLearners":["•\tThis course is ideal for anyone who wants to learn great interior design and decorating techniques","•\tThis course is also ideal for enthusiasts, interior design students and professional interior designers who are new to their field"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2020-05-20T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2020-05-23T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e82a09c9b04f3f624d732","625e83499c9b04f3f624d7c2"],"topics":[],"reviews":[],"meta":{"ratingCount":152,"studentCount":724,"avgRatingScore":3.543978,"contentVideoLength":6513},"basicInfo":{"udemyCourseId":1002400,"slug":"interior-design-with-revit-for-beginners","title":"Interior Design with Revit for Beginners","subtitle":"Interior Design Projects from Scratch using Revit","image":"https://img-c.udemycdn.com/course/240x135/1002400_7020_3.jpg","price":1261470,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["Deliver a complete Interior Design package to a client.","Create 2d and 3d Interior Designs","Setup complete and compelling sheets to publish","Start an Interior Design project from the begining"],"requirements":["Revit 2013 - 2021"],"description":"<p>Do you use AutoCAD or Sketchup, but want to move into the latest Building Information Modeling software that all the major architecture firms and developers are using? Having a hard time getting off the AutoCAD dinosaur train? Want to save drafting time and use a program that coordinates your changes to populate instantly? By learning Revit for Interior Designers you can easily change all that.</p>\n\n<p><em>Interior Design with Revit</em> is a series of step-by-step video tutorials that show anyone -- even a total beginner -- how to effectively use Revit as an Interior Designer. You will learn the entire process of modeling hotel room interiors; starting from scratch and finishing with sending your deliverable to your clients.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>When you sign up, you immediately get access to the member’s area where you can join our BIM Master online and take each lesson at your own pace. Through these engaging, short tutorials, you’ll learn how to draft 2-D and 3-D starting with the fundamentals.  We promise that it’s not as complicated as it sounds. Most Revit courses are intimidating and don't teach an Interior Designer what they REALLY need to know to be effective on the job. By the end of this course you will know the beginner basics of Revit and be ready to work on client projects.</p>","suitableLearners":["Students","Profesionals who want to start learning Revit","Someone who knows Revit but wants to learn Interior Design in Revit","Interior Designers"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2020-07-15T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2020-07-18T00:00:00.000Z"},"promotions":{"discountPrice":367040,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}}]