[{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fbd9c9b04f3f624d68c"],"topics":[],"reviews":[],"meta":{"ratingCount":8149,"studentCount":19299,"avgRatingScore":4.4210186,"contentVideoLength":3276},"basicInfo":{"udemyCourseId":2256324,"slug":"goal-setting-at-work-plan-for-success-and-reach-your-goals","title":"Goal Setting at Work: Plan for Success and Reach Your Goals","subtitle":"Use SMART goals to focus your work, hold yourself accountable, measure and evaluate your progress, and make an impact.","image":"https://img-c.udemycdn.com/course/240x135/2256324_cb3b.jpg","price":1146770,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["Explore why goal setting at work is important and worth your time","Define common goal setting methods like MBO, OKR, BHAG, and SMART","Master the SMART goal setting framework","Write out your current top 3-5 goals at work while incorporating SMART language","Create a realistic plan to meet your newly set goals, and hold yourself accountable","Communicate effectively about your goals with your manager and team","Use a goal setting template to capture the full scope of your current and future goals"],"requirements":["You don’t need any special equipment for this course, just a PC or Mac to watch the videos and a pen to take notes.","The desire to set concrete, achievable, work-related goals and map out a plan to reach them."],"description":"<p><strong>Do you need to learn how to set goals--fast?</strong> Has your manager asked you if your goals are SMART? If you want to measure and evaluate your progress and make an impact, you are in the right place!</p><p>Setting goals seems like it should be one of the easier things to do at work. You are good at your job, so writing down thoughts on what you will tackle in the next 3-6 months should come naturally, right? Too often we set goals that are vague, undefined ideas about what we want to accomplish at work. <strong>Without concrete steps to achieve those goals, and without setting measurable metrics, it can be impossible to know if you’ve reached them.</strong></p><p>In this course, you will:</p><ul><li><p>Explore why goal setting is important and why it’s worth your time</p></li><li><p>Bust myths about goal setting</p></li><li><p>Figure out what MBO, OKR, BHAG, and SMART stand for--and why everyone talks about them</p></li><li><p>Discover the fundamentals of goal setting</p></li><li><p>Master the SMART goal setting framework</p></li><li><p>Identify your current top 3-5 goals at work and make them SMART</p></li><li><p>Create a realistic plan to meet your newly set goals</p></li></ul><p><strong>Using a combination of worksheets, downloadable PDFs, checklists, and other resources to help you through this process, by the end of this course, you’ll have a manageable list of goals and steps to take to reach them.</strong></p><p>As an executive coach, I work with executives and their teams to better understand what they are responsible for and how to hold each other accountable. I’ve seen first hand the destruction that can be wrought when goals are not concrete, not written down or discussed so that everyone is on the same page and working toward the same objectives. Teams need commonly shared information about what to do, who is taking on each step, and when each step needs to be completed. Setting goals, and motivating others to accomplish them, is not an innate skill. It’s one that can be developed, and in this course, that’s exactly what we’re going to do.</p><p><strong>Without the ability to set real, actionable goals for yourself and how to measure them and judge whether or not you’re reaching them, you’ll fall short every time. Don’t allow that to happen.</strong></p><p>So, if you’re ready to work out exactly how to get from where you are now to where you want to be at work, then sign up for this course and let’s get started!</p><p><strong>CPE (Continuing Professional Education)</strong></p><p><strong>Learning Objectives</strong></p><ol><li><p>Define what a goal is.</p></li><li><p>Describe characteristics of goals.</p></li><li><p>Recognize the elements of a SMART goal and the benefits of using SMART goals.</p></li><li><p>Determine the benefits and drawbacks of stretch goals.</p></li><li><p>List reasons why goals may not work.</p></li><li><p>Explain the importance of communicating your goals.</p></li><li><p>Describe the key components of a goal setting action plan.</p></li><li><p>State what subgoals are and why they are helpful.</p></li></ol><p>For additional information, including refunds and complaints, please see <strong>Udemy Terms of Use</strong>, which is linked from the footer of this page.</p><p>For more information regarding administrative policies, please contact our support using the <strong>Help and Support</strong> link at the bottom of this page.</p>","suitableLearners":["Employees who are setting work goals for the first time","Employees who have not found a goal setting framework that they can stick to, and who want a better way to track and measure their progress","New or existing managers who need to set goals for themselves AND a team in order to hold themselves and team members accountable","This course is NOT for employees or managers who have been successfully setting goals for an extensive amount of time, or already have a framework that works for them."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2020-11-18T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2020-11-21T00:00:00.000Z"},"promotions":{"enabled":false}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fbd9c9b04f3f624d68c"],"topics":[],"reviews":[],"meta":{"ratingCount":8138,"studentCount":17119,"avgRatingScore":4.4749346,"contentVideoLength":2064},"basicInfo":{"udemyCourseId":166240,"slug":"managing-change-learn-to-thrive-through-change","title":"Managing Change:  Learn to thrive through change.","subtitle":"Overcome fear and resistance by mastering the phases of change and transition","image":"https://img-b.udemycdn.com/course/240x135/166240_d837_4.jpg","price":1261470,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["Understand and use the  3 phases of a transition to thrive during a time of dramatic change","Understand the difference between a change process and a transition process","Create an action plan to manage the transition","Understand and eliminate your resistances to change","Understand the emotions that may be getting in your way"],"requirements":["An open mind","A willingness to examine your own behaviors and thoughts","The willingness to put into practice some of the exercises"],"description":"<p>  \t    Life is filled with changes and yet as human beings we often resist and/or fear change.  Although change is how we evolve and grow we often suffer through the phases of a transition that we experience.  </p>\n\n<p>  \t  Using slides and reflective activities participants will be encouraged to question their own patterns, resistances and emotions while going through a change process. The better equipped we are to understand our own emotions and barriers through a change process the better we will be able to thrive through any change.  </p>\n\n<p>  \t  Whether we need to navigate through change on a personal level or help a team member, family member, friend etc. through a change process this course will allow you to gain some simple yet effective tools and concepts to successfully thrive through a transition.  </p>","suitableLearners":["Anyone who wants to better experience and live through changes","Managers/team leaders","Parents who want to help their children thrive through change"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2020-05-24T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2020-05-27T00:00:00.000Z"},"promotions":{"discountPrice":298220,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fbd9c9b04f3f624d68c"],"topics":[],"reviews":[],"meta":{"ratingCount":8007,"studentCount":14035,"avgRatingScore":4.361234,"contentVideoLength":1106},"basicInfo":{"udemyCourseId":585072,"slug":"culture-how-to-make-team-decisions","title":"Culture | How to Make Team Decisions","subtitle":"Understand how collaborating with your team to make decisions can drive motivation and innovation","image":"https://img-c.udemycdn.com/course/240x135/585072_48a6.jpg","price":687970,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["Manage the challenges of team decision making","Identify and avoid decision making traps","Understand how actions are driven by assumptions","Question assumptions to avoid poor judgement"],"requirements":["A keen readiness to learn and put it into practice ","Access to a computer, tablet or iPad ","Headphones or speakers to listen to videos"],"description":"<p>Culture is not so easily defined. We think about culture as the mix of ingredients to get a recipe right. How to make team decisions with Learoy Tonight will provide you with the skills and knowledge to understand what drives culture and what you can do to create and foster the one that's right for you.</p><p>As a leader, aren't you sick of being the one making all the decisions? Well, there's a clear reason why this is still happening and it's staring you right in the face every time you look in the mirror.</p><p>Collaborating with your team to make decisions comes with many rewards. Not only does it drive motivation through a sense of empowerment and ownership, it also builds team cohesion, drives innovation, oh, and did I mention relieves personal burdens as well?</p><p>Each lecture in this course has been carefully selected for you to explore how to implement relevant and meaningful strategies to support you as a leader and culture driver now and in the future.</p><p>This course will provide you with many tips and tricks you can utilize inside and out of your workplace, it will encourage and motivate you to really understand and support the environment you're trying to create.</p><p>Learoy Tonight is a fresh business with interesting and modern ideas towards education. Many people take part in creating these courses – from subject matter experts, to researchers and designers – to ensure you are provided with the best learning experience and the most up to date information. We are excited about education and want to give you the opportunity to be the best you can be.</p><p>This course will take you approximately 30 to 45 minutes to complete and will cover ways you can make effective decisions. Our content will give you the opportunity to listen to experts and understand relevant models for you to use on your journey to a strong team culture. This will be an experience to enjoy with a collection of videos, interviews and engaging imagery throughout our presentations.</p><p>This course is a small section of our Culture: In the Mix journey. If you would like to really challenge yourself, join us for the entire culture building experience.</p>What are you waiting for? Start tonight, be on your way to amazing culture tomorrow.","suitableLearners":["Anyone looking to boost their skills as a leader ","Anyone with an interest in driving strong business and team culture ","Anyone looking to develop their workplace into an environment where people want to be ","Anyone with leadership or management experience, whether in a junior to middle management level or those who wish to move into a middle/senior management role ","Anyone from a small, medium or large organisation"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2015-09-13T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2015-09-16T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fbd9c9b04f3f624d68c"],"topics":[],"reviews":[],"meta":{"ratingCount":7854,"studentCount":23177,"avgRatingScore":4.3510556,"contentVideoLength":7254},"basicInfo":{"udemyCourseId":1498158,"slug":"time-and-task-management-time-management-techniques","title":"Time and Task Management: Time Management Techniques","subtitle":"Time management techniques and strategies that you can apply today to get more things done with more value","image":"https://img-c.udemycdn.com/course/240x135/1498158_3947_2.jpg","price":1146770,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["Manage time and tasks more effectively","Immediately apply several easy time management techniques"],"requirements":["Basic understanding that time is a constraint","You'll need to budget some time to complete this course"],"description":"<p>Are you feeling overwhelmed, pressed for time, and you don’t know how you’ll squeeze another minute out of your day? If so, this is the course for you. In this hands-on, practical course management consultant and author Joseph Phillips will show you how to get more things done, with less stress, and more efficiency. Are you feeling overwhelmed, pressed for time, and you don’t know how you’ll squeeze another minute out of your day? If so, this is the course for you. In this hands-on, practical course management consultant and author Joseph Phillips will show you how to get more things done, with less stress, and more efficiency.</p><p><br></p><p>You have demands from projects, operations, bosses, and even coworkers. Meetings that could be summed up in an email – meetings that rob you of time from getting things done. Tasks that are complicated, require focus and need your undivided attention to invade your desk and email daily. You need a system to organize your work, a system that’s more than a long list of what you need to do, but rather a system that helps you prioritize, create a strategy of accomplishment, and get things done.</p><p><br></p><p>In this course you’ll learn how to:</p><ul><li><p>Manage different types of activities</p></li><li><p>Identify and create priorities to add more value</p></li><li><p>Manage constraints that squeeze your options</p></li><li><p>Create to-do lists that actually work</p></li><li><p>Experiment with time management strategies</p></li><li><p>Get organized – for real this time!</p></li><li><p>Remove \"time sucks\" that rob you of productive time</p></li><li><p>Create duration estimates that are realistic</p></li></ul><p><br></p><p>If you’re ready to stop wasting time – and to take back control of your time – this is the course for you.</p><p><br></p><p>Seeking Professional Development Units? This course is worth two (2) PDUs with PMI for your continuing education hours.</p><p><br></p><p>This course aims to help you find balance, get things done, and stop the flood of chaos from work, personal life, and disorganization.</p><p>In this course you’ll learn how to:\n\n&nbsp; </p><ul><li><p>Manage different types of activities</p></li><li><p>Identify and create priorities to add more value</p></li><li><p>Manage constraints that squeeze your options</p></li><li><p>Create to-do lists that actually work</p></li><li><p>Experiment with time management strategies</p></li><li><p>Get organized –<em> for real this time!</em></p></li><li><p>Remove \"time sucks\" that rob you of productive time</p></li><li><p>Create duration&nbsp;estimates that are realistic</p></li></ul><p>If you’re ready to stop wasting time – and to take back control of your time – this is the course for you.\n\n</p><p><em>Seeking Professional Development Units?&nbsp;This course is worth two (2) PDUs with PMI for your continuing education hours.</em></p>","suitableLearners":["Anyone who wants to better manage their time","Anyone who wants to accomplish more with less effort"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-11-09T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-11-12T00:00:00.000Z"},"promotions":{"discountPrice":367040,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fbd9c9b04f3f624d68c"],"topics":[],"reviews":[],"meta":{"ratingCount":6818,"studentCount":33416,"avgRatingScore":4.5513535,"contentVideoLength":2262},"basicInfo":{"udemyCourseId":640940,"slug":"the-customer-how-to-manage-customer-feedback-bite-size","title":"The Customer: How to Manage Customer Feedback (BITE SIZE)","subtitle":"Create an environment that welcomes customer feedback. Educate your team on how to handle feedback and use it to improve","image":"https://img-c.udemycdn.com/course/240x135/640940_c23d_5.jpg","price":687970,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["Understand the importance of giving team’s customer feedback","Be able to give positive and negative customer feedback to my team in an effective way","Define potential gaps in service and methods to overcome them","Drive a culture that welcomes customer feedback","Develop strategies to proactively manage complaints before they arrive","Diffuse difficult customer situations to focus on actionable solutions ","Understand why customers complain"],"requirements":["A keen readiness to learn and put it into practice","Access to a computer, tablet or iPad","Headphones or speakers to listen to videos"],"description":"<p>There is no question about the impact great customer service has on an organisation. How to manage customer feedback will give you the tools to make a connection and build a relationship with your customer base.&nbsp; Today we may be providing a service, tomorrow we may be a receiving one; it is the beauty of this that makes good customer service a truly human endeavour.</p><p>Bill Gates once said: <em>“Your most unhappy customers are your greatest source of learning”. </em></p><p>Make sure you use this as a source of inspiration! Create an environment that welcomes customer feedback. Educate your team on how to handle feedback and use it to improve. Predict potential issues before they arise and give people the tools they need to deal with any issues. You’ll create a more empowered workforce, who will inevitably provide a better customer experience.</p><p>Each lecture has been carefully selected so that you can explore relevant and meaningful strategies to create a truly customer centric workplace. Build a culture that values the importance of each customer interaction and empowers employees to provide the best service possible. This course is full of tips and tricks to use inside and out of your workplace. It will motivate you to really understand and support the environment you’re trying to create.</p><p>Many people take part in creating these courses – from subject matter experts, to researchers and designers – to ensure you are provided with the best learning experience and the most up to date information. We’re excited about education and want to give you the opportunity to be the best you can be.</p><p>This <strong>BITE&nbsp;SIZED&nbsp;</strong>course will take you approximately 30 to 45 minutes to complete and will cover all of the components required to manage customer feedback. Our content will give you the opportunity to listen to experts and understand relevant models to use on your leadership journey when creating a truly human customer experience. Enjoy a collection of videos, interviews and engaging imagery used throughout our presentations.</p><p>This <strong>BITE&nbsp;SIZED</strong> course is also part of our <strong><em>Master Series - The Customer: Service At Its Best</em></strong>. </p><p>If you would like to really challenge yourself, join us for the entire journey.</p><p>So what are you waiting for? Start tonight and be on your way to providing amazing customer service tomorrow.</p>","suitableLearners":["Anyone looking to improve the experience of their customers","Anyone with an interest in driving a strong customer focus within their organisation","Anyone looking to develop their organisation into an environment that customers want to interact with and develop loyalty to","Anyone with frontline customer service experience, leadership or management experience, whether in a junior to middle management level or those who wish to move into a middle/senior management role within a customer focussed organisation","Anyone from a small, medium or large organisation"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2015-10-15T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2015-10-18T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fbd9c9b04f3f624d68c"],"topics":[],"reviews":[],"meta":{"ratingCount":6656,"studentCount":25835,"avgRatingScore":4.5558267,"contentVideoLength":22335},"basicInfo":{"udemyCourseId":429062,"slug":"new-manager-the-basics-and-more-of-being-a-great-leader","title":"New Manager: The Basics and More of Being a Great Leader","subtitle":"Go from a slightly uncertain, confused newbie to a confident, skilled manager who builds and leads effective teams.","image":"https://img-c.udemycdn.com/course/240x135/429062_6e2a_7.jpg","price":1949670,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["A step by step guide to your first 94 days as a manager","Communicate directly and clearly","Give and receive constructive feedback","Recognize different stages in a group's development","Adjust own behavior related to the development stage of the group","Understand the need for and use of different leadership styles","Set clear and effective guidelines for team behavior","Distinguish between management and leadership","Understand and manage conflicts","Clarify expectations and focus efforts of the team","Acknowledge colleagues in a way that supports healthy work relationships","Understand how values influence relationships and leadership","Work with reflection and learning, individually and in a team","Motivate individuals and teams in a productive way","Build trust and successful work relationships","Excel in the management role with its unique demands and expectations","Planning the operations of your team","Coaching your coworkers to better performance, well-being and results","Effective delegation of tasks"],"requirements":["To get the greatest benefit from the course make sure you have notebook or personal journal to accompany you during the course. This is completely optional, but highly recommended.","It can be in a digital format or on good old paper.","This will allow you to make notes of your lessons learned and experiences you have with applying the course in your everyday work, making sure you get the greatest possible benefit from the course."],"description":"<p>Learn the basic concepts, tools and skills that you will need to become successful as a manager. Learn how to build and lead effective teams through both the easy and the hard times.</p><p><strong>Build a strong foundation for your successful leadership with this comprehensive course</strong></p><ul><li><p>Get a great start with a detailed guide to your first 94 days as a manager</p></li><li><p>Learn to communicate clearly and how to work with constructive feedback.</p></li><li><p>Recognize and use group dynamics for better results.</p></li><li><p>Manage conflicts and relationships in a productive, energy efficient way.</p></li><li><p>Build motivated and self-learning teams with a high level of trust.</p></li><li><p>Learn how to best manage the demands and expectations of the management role.</p></li><li><p>Learn practical skills such as operations planning with your team, delegation and coaching</p></li></ul><p><strong>Time and Energy Saving Knowledge and Skills at Your Disposal</strong></p><p>This course is built on more than 25 years experience with training new and experienced managers from all corners of the world.</p><p>Successful managers have all invested in their leadership skills. These skills are often what makes or breaks a new manager. </p><p><strong>Content and Overview</strong></p><p>I designed this course to be easily understood and applied by absolute beginners. The course has over 35 downloadable resources that you can use for future reference, including guides, checklists, textbooks, illustrations and assessments.</p><p>It is complete with easy-to-digest theories, models and practical examples. A total of 16 sections with over 120 lectures filled with proven tips and tricks. And there is a quiz at the end of each section to help you grasp the key concepts.</p><p>You will walk away from this course with a solid toolbox of skills and knowledge that you can use to succeed in your new management role.</p><p>You will be able to communicate more clearly, give and receive constructive feedback and manage conflicts. You will understand group dynamics and be able to adjust your leadership to the development stage of your team.</p><p>You will avoid energy drains by clarifying expectations, guidelines for behavior and working with values. You will be able to motivate yourself and others, build trusting and effective relationships while managing the challenges related to the management role.</p><p>You will be able to plan and execute the work of yourself and your team, both in the day to day operations and in the long-term.</p>","suitableLearners":["If you will be promoted to manager in the near future, just got promoted to your first management position or have been a manager for say 1-2 years, then this course is intended for you.","This is a new manager training for developers, designers and others. It is not limited to a certain industry or occupation.","No prior management or leadership knowledge is required.","If you have been a manager for more than 2 years and have attended several other courses on management and leadership then this course is probably not for you. Or if you are looking for a course on how to create an engaging slideshow presentation or how to plan the budget of a project, then it is not for you either."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-02-18T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-02-21T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fbd9c9b04f3f624d68c"],"topics":[],"reviews":[],"meta":{"ratingCount":6634,"studentCount":22013,"avgRatingScore":4.3738894,"contentVideoLength":17480},"basicInfo":{"udemyCourseId":1139966,"slug":"isoiec-27001-information-security-management-system","title":"ISO/IEC 27001. Information Security Management System.","subtitle":"Learn how your company can protect its information and get certified to ISO/IEC 27001","image":"https://img-b.udemycdn.com/course/240x135/1139966_21be_3.jpg","price":1949670,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["Understand the requirements of ISO/IEC 27001 and the information security controls","Participate in information security audits","Understand information security principles and concepts","Have a solid knowledge of the requirements for information security controls required by ISO/IEC 27001","Understand what is required for an organization to obtain ISO/IEC 27001 certification","Participate in the implementation of an Information Security Management Systems","Understand information security controls and guidelines for their implementation according to ISO/IEC 27002"],"requirements":["No specific prior knowledge required.","Familiarity with management systems is helpful.","Knowledge about information security principles and concepts is useful."],"description":"<p><strong>ISO/IEC 27001 is one of the world's most popular standards</strong><strong></strong> and this ISO certification is very sought after, as it demonstrates a company can be trusted with information because it has sufficient controls in place to protect it.</p>\n\n<p><strong>Google, Apple, Adobe, Oracle and many other tech giants, financial institutions, health services providers, insurance companies, education institutions, manufacturing and service companies, large and small business around the world have decided to implement this standard and to get this certification as a proof of their capability to protect the confidentiality, integrity and availability of the information they process.</strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong>My course explains the requirements of ISO/IEC 27001 along with the controls in Annex A of this standard to help you understand how an information security management system can be implemented, what are the requirements of this standard and what are the solutions to ensure conformity.</strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong>My course is structured into 2 parts:</strong></p>\n\n\n\n\n\n\n\n\n\n<p>- <strong>the first one is about the management system requirements of ISO/IEC 27001.</strong> Context of the organization, leadership, information security policy and objectives, information security risk assessment and treatment, competence and awareness, documented information, operational planning and control, internal audit, management review, nonconformity and corrective action  along with all the other requirements of the standard are discussed.</p>\n\n\n\n\n\n\n\n\n\n<p><strong>- the second part of the course is all about the controls from Annex A of ISO/IEC 27001 - there are 114 information security controls and all are addressed in the lessons</strong>. The topics cover aspects like: Information security policies, organization of information security, mobile devices and teleworking, security of human resources, asset management, classification of information, media handling, access control, user responsibilities, system and application access control, cryptography, physical and environmental security, equipment security, operations security, protection from malware, backup, logging and monitoring, control of operational software, technical vulnerability management, communications security, network security management, information transfer, system acquisition, development and maintenance, security in development and support, supplier relationships, incident management, information security as part of business continuity management, redundancies and compliance.</p>\n\n\n\n\n\n\n\n\n\n<p><strong>After going through all the lessons of this course you will have a solid knowledge of what is required for an information security management system, how can an organization implement such a system and get certified to ISO/IEC 27001.</strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong>With the information here you can:</strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong>- work as a consultant for the implementation of this system in different companies;</strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong>- participate in audits (internal or external) on ISO/IEC 27001;</strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong>- work in a company that implemented an information security management system or</strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong>- if you are  manager or owner of a business you will know what is the international standard for information security and start </strong><strong>implementing it in your company.<br></strong></p>\n\n\n\n\n\n\n\n<p>If none of the options above suits your profile you can use the information in my course for awareness on information security and get to know what are the security requirements that so many organizations around the world have decided to adopt.<br></p>\n\n\n\n\n\n\n\n\n\n<p>From my course you will get condensed information that you can re-visit anytime you need and after going through this course Udemy offers the possibility to download a certificate for successful completion so you can demonstrate your competence in the information security field.</p>","suitableLearners":["Information security managers","Information security consultants and auditors","Information security officers","Information security risk specialists","Managers and business owners","People involved in the implementation and administration of information security management systems according to ISO/IEC 27001"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2019-10-02T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2019-10-05T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fbd9c9b04f3f624d68c"],"topics":[],"reviews":[],"meta":{"ratingCount":6234,"studentCount":19835,"avgRatingScore":4.445939,"contentVideoLength":10724},"basicInfo":{"udemyCourseId":1239906,"slug":"okr-goal-setting-101-achieve-more-goals-than-ever-faster","title":"OKR Goal Setting 101 - Achieve more goals than ever! Faster!","subtitle":"Achieve 'impossible' goals, be highly motivated & set goals effectively with OKR. Define & measure what really matters","image":"https://img-c.udemycdn.com/course/240x135/1239906_d533_4.jpg","price":1949670,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["#1 OKR course on Udemy (including 38-page workbook, real examples, BEST practices) - you will know exactly how to use OKRs in your business (20,000+ attendees)","You confidently set and achieve your goals by writing purposeful, measurable key results (and have more success)","You clearly communicate OKR-based goals and cascade them up and down the organisation","You avoid the 10 most common mistakes when setting and working towards goals","You write strong, metric-driven, motivating OKR to manage yourself and your team","Your remote, virtual, or hybrid team is perfectly aligned using OKRs","You lead your team, project, or company using Googles success principle and achieve your goals","You master the OKR framework and are a role model in using Objectives and Key Results"],"requirements":["NO goal-setting experience required!","If you want to achieve your goals, this course is for you!","If you don't want to settle for less any more, the OKR method will help you to achieve more goals faster!"],"description":"<p><em>\"The course is more in-depth than John Dooer's book, 'Measure What Matters.' It has checklists and lays out plans of action, steps to follow.\"</em></p><p>The comprehensive <strong><em>38-page workbook</em></strong> will be your guide throughout the course <strong>and your reference in your daily practice.</strong></p><p><strong>*** NO&nbsp;GOAL&nbsp;SETTING&nbsp;EXPERIENCE&nbsp;REQUIRED&nbsp;***</strong></p><p>Take the shortcut <strong>from 0 to OKR-Hero </strong>with this bestselling OKR course - you will <strong>set OKRs in the most effective way</strong>, <strong>lead</strong> yourself and your team based on real-world best practices, and <strong>have fun</strong> along the way. </p><p><strong>What you should know: Our OKR-Experts answer your individual OKR-related questions!</strong></p><p><br></p><p>What <strong>attendees</strong> say about the<strong> #1 most popular OKR course on Udemy:&nbsp;</strong></p><ul><li><p><em>\"This course is very helpful and knowledgable. I literally found all what I was looking for there and even more ? It is really AWESOME to learn from the experts. I like the examples and how the course tackle everything related to OKR such as performance management and SCRUM. Thank you and well done.\"</em></p></li><li><p><em>\"The course and tips were helpful to set your goals you wanted to achieve or make a difference, it changes your mindset to improve yourself and other people around you.\"</em></p></li><li><p><em>\"Claridad y enfoque. Con ejemplos prácticos en un mundo real. Presentación amena que facilita la comprensión.\"</em></p></li><li><p><em>\"After reading 3 OKR's books I can tell this is a very clear, concise and direct introduction to OKRs\"</em></p></li><li><p><em>\"Muy bien abordado!!! super concreto con ejemplos muy claros.\"</em></p><p><br></p><p><strong> </strong></p></li></ul><p><strong>***&nbsp;GLOBAL&nbsp;NUMBER&nbsp;1 OKR FUNDAMENTALS&nbsp;COURSE ***</strong></p><p><strong>*** 20,000+ attendees ***</strong></p><p><strong>More than 20,000 attendees so far,&nbsp;the <em>OKR Goal Setting 101</em> course is a compulsory course in many small, medium, and large organisations worldwide. Benefit from the #1 OKR course worldwide focusing on practical tips you can implement immediately.</strong></p><p><br></p><p><br></p><p>After visiting this course <strong>you confidently define and thrive using OKRs</strong> and benefit from the best goal-setting process for individuals, teams, and large organizations.</p><p>If you use our </p><ul><li><p><strong>step-by-step guide</strong>, </p></li><li><p>deepen your knowledge with our <strong>real-world examples</strong>, </p></li><li><p>and use the downloadable <strong>documents</strong> as templates for your business, you will be the OKR pro in your organisation. Even if you have no goal setting- or OKR-experience so far. </p></li></ul><p>This course is perfect for leaders, team members, and individuals.</p><p><br></p><p><strong>In this online course you are going to learn:</strong></p><ol><li><p>What are OKRs and WHY they help you to really achieve your goals</p></li><li><p>What are the best practices of OKRs and how are OKRs used in different industries</p></li><li><p>How can I set goals with OKR in my business life /&nbsp; job&nbsp;</p></li><li><p>How can I lead my team, how can I lead my company with OKRs</p></li><li><p>How to use OKR for goal setting on a company level as an executive</p></li><li><p>How do I align department, team and individual OKR with company OKR (your path for consistent and aligned goal setting through the company)</p></li><li><p>How can I use OKR s to set long term / annual and BIG goals</p></li><li><p>Many practical examples for different environments: for yourself, for a small team&nbsp;or&nbsp;for a global&nbsp;corporate</p></li><li><p>Which are the 10 biggest mistakes people make when defining goals and how can I avoid them</p></li><li><p>How do I make sure to actually do the work and take the steps necessary to achieve my goals - instead of defining them and waiting for a miracle to happen (or \"the right time to come\")</p></li></ol><p><br></p><p>This course is facilitated by Axel Rittershaus, Executive Coach, who supports individuals, teams, and organizations around the globe to write strong goals and benefit from the value of OKRs. </p><p><strong>It is designed for people at all levels</strong>, from individual team members to managers, who achieve their targets (and more) by writing strong goals for themselves and cascade goals within their organization.</p><p><br></p><p><br></p><p><strong>If you are new to OKRs:</strong></p><p>Forget everything you heard about goal setting. Ditch SMART.&nbsp;</p><p><strong>Go for the champion and set your goals using&nbsp;OKR at our OKR&nbsp;bootcamp</strong>. </p><p>In this <strong>bestselling </strong>OKR 101 course, you'll learn everything you need to know to set goals with OKRs, incorporate them into your life, and improve your future in both business and life.</p><p>Goal setting is great, but that's only the first step. Achieving a goal is much harder and takes much longer.&nbsp;</p><p><strong>Most goal setting techniques fail completely</strong> when it comes to helping you achieve your goals.</p><p><strong>OKRs is&nbsp;most likely the number one 'goal-setting-and-achieving-method' </strong>the world is talking about. Google used Objectives and Key Results (OKR) almost from day one (they started with OKR in 1999 and still use it, helping them grow their employee base from 60 to more than 80,000 in 17 years) and they still use it - from the intern to the CEO.</p><p>No matter if you work on your own, in a small team, or&nbsp; a corporate environment:</p><p><strong>OKRs</strong> are your way to more productivity and better results - no matter your business!</p><p><strong>With OKRs you're going to achieve goals</strong> you always struggled with or never dared to approach.</p><p><strong>In this course you'll get</strong></p><ul><li><p>Videos</p></li><li><p>Examples for personal and business OKR</p></li><li><p>Checklists</p></li><li><p>Working materials</p></li><li><p>Templates for your own goal setting</p></li></ul><p>to use OKRs effectively. </p><p><strong>After completing this course</strong></p><ul><li><p>You’ll know exactly&nbsp;<strong>what OKRs are, how they work, and how you will benefit </strong>from them</p></li><li><p>You’ll&nbsp;<strong>define your professional and private goal </strong>based on the OKR principle</p></li><li><p>You’ll implement the simple but highly effective steps to&nbsp;<strong>take action to realize your goals</strong></p></li><li><p>And, if you’re a leader, you’ll know exactly how to&nbsp;<strong>use OKRs as a leadership tool</strong></p></li></ul><p>The earlier you define your OKR, the sooner you will achieve your goals.</p><p>The Q&amp;A board will assist you on your path from beginner to OKR master!</p><p><br></p><p>Your coach, OKR expert Axel Rittershaus, is working with highly successful executives, corporates, and individuals in 30 countries as a leadership coach and advisor. The most successful of them use OKR. </p><p>Let's get started and make you more successful and happy by setting and achieving your goals with OKR.</p><p><br></p>","suitableLearners":["Employees, team managers, executives, entrepreneurs who want to master the OKR-method and benefit by using OKRs them from day 1","For you, if you want to achieve (more) goals in life and business","For you, if you want to benefit from using OKRs, the most effective goal setting tool in the world","For you as a leader, if you want to cascade your goals and align your organisation to focus on the right priorities","For you, if you are tired of ineffective goal setting tools like SMART"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-03-23T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-03-26T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fbd9c9b04f3f624d68c"],"topics":[],"reviews":[],"meta":{"ratingCount":6210,"studentCount":39101,"avgRatingScore":4.453679,"contentVideoLength":16281},"basicInfo":{"udemyCourseId":482564,"slug":"2022-the-complete-management-skills-certification-course","title":"[2022] The Complete Management Skills Certification Course","subtitle":"Used at Amazon®, Unilever®, Walmart®, and other top firms. Learn leadership, productivity, communication skills & more!","image":"https://img-c.udemycdn.com/course/240x135/482564_6fdc_15.jpg","price":1949670,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["Innovate, execute on good ideas, and diffusing the ideas throughout the organization","Unlock more strategic information and find better ways of working together","Succeed in a world where smart, orchestrated networks and tiny firms that do not need much capital to compete with larger organizations","Make their organizations more agile, responsive, and creative"],"requirements":["You should already be somewhat familiar with fundamental business practices and be interested in learning to achieve more by working with and through other people"],"description":"<p><strong><em>This course is used at top companies like Amazon®, Unilever®, Walmart®, Nissan®, and Citibank®.</em></strong></p><p>Course Version 7.4 |&nbsp;Updated January 2022</p><p><br></p><p>5/5 Stars:&nbsp;<em>\"I thoroughly enjoyed the practicality of this course. Theory is great but it's implementation of theory that makes a difference in the workplace. Great assignments and awesome interviews. I have recommended this course to my network and am sure you will too once you have comepleted this course. Great work Davis and team.\"</em> - Justin Underhill</p><p>5/5 Stars:&nbsp;\"The entire course was very detailed in each module. It was definitely not for a beginner. I am pretty sure the senior manager or the mid-level manager will appreciate this course. Illustration helped a lot too. I truly enjoyed the course.\" - Yoshika Okamura</p><p><br></p><p>Similar to <strong>MIT’s Advanced Management Program</strong> (which runs a whopping $65,000!), and available here for a tiny fraction of the cost. By taking this course, you can develop a higher level of leadership and management skills to help you reach your fullest potential and deliver extraordinary value to your team, your organization, and the communities you serve. &nbsp;&nbsp;&nbsp; &nbsp;</p><p><strong><br>Advanced Management Training for Business Leaders</strong>&nbsp; &nbsp;</p><p><strong>Take the next step in your career! </strong>Whether you’re an up-and-coming professional, a savvy entrepreneur, or an experienced executive, this remarkable course is a tremendous opportunity to <strong>deepen your leadership and management abilities, increase your personal achievement, and make a positive and lasting impact on the people around you</strong>.&nbsp; &nbsp;<br></p><p>With this course as your guide, you learn how to:&nbsp; &nbsp; </p><ul><li><p>Transform your leadership style for the current business climate&nbsp; &nbsp;</p></li><li><p>Discover powerful solutions for common management challenges&nbsp; &nbsp;</p></li><li><p>Communicate and persuade effectively in the age of digital&nbsp; &nbsp; </p></li><li><p>Create a win-win negotiation that promote a long-term relationship&nbsp; </p></li><li><p>Maximize your personal productivity and handle time constraints&nbsp; &nbsp;</p></li><li><p>Understand management issues from a macroeconomic perspective&nbsp; &nbsp;</p></li><li><p>Invest in yourself today and reap the benefits for years to come &nbsp; </p></li></ul><p><strong>The Newest Frameworks for Leadership and Management </strong>&nbsp; &nbsp;</p><p><strong>Engaging video lectures, expert interviews, and interactive exercises.</strong> This course is based on cutting-edge research from Harvard, Stanford, MIT, and other top-flight institutions.<strong> </strong>You’ll gain powerful leadership insights and develop must-have management capacities. The result? You can <strong>reach your career goals and become a more effective change agent moving forward</strong>.&nbsp; &nbsp;</p><p><strong>BONUS!</strong> In this Advanced Leadership Course, you’ll get insightful interviews with Brian Burwell, the leader of one of the world’s premier management consulting firms. Brian has <strong>performed consulting engagements with Fortune 100 companies from all over the world</strong>, and helps you contextualize each course lecture with his 35+ years of real-world experience.&nbsp;&nbsp; &nbsp;&nbsp;\n\n&nbsp; </p><p><strong>Better Team Building, Communication, Negotiation, and More</strong>&nbsp; &nbsp;</p><p>This course features highly informative and beautifully designed lectures, little-known secrets from superstars of leadership and management, and interactive exercises to make these career-changing concepts come to life. The course itself is divided into three sections: &nbsp;&nbsp; &nbsp;</p><p><strong>In the early sections of the course</strong>, you’ll discover how to handle the most common management challenges, how to lead high-performing teams across different situations, and how to communicate effectively in the current era. Today’s business leaders must communicate in person and through digital mediums. You’ll learn about delivering effective messages through multiple channels using communication models like the ELM, Minto Pyramid, and more. <strong>&nbsp;&nbsp;</strong>&nbsp; &nbsp;</p><p><strong>In the middle sections of the course, </strong>you’ll learn how to improve your negotiation skills and increase your personal productivity. With negotiation, you’re likely to face complex scenarios during your career. You’ll develop go-to strategies for thinking “win-win” and claiming value from every high-stake negotiation. You’ll also learn how to use tools like the BATNA and Eazl’s negotiation preparation tools. From a productivity standpoint, you’ll learn to be dramatically more efficient and to work successfully with the many claims on your time and energy.&nbsp; &nbsp;</p><p><strong>In the final sections of the course</strong>, you’ll develop the ability to look at key management issues from a macroeconomic perspective. This will allow you to anticipate macroeconomic events and important changes in government policies. Last but not least, you’ll develop your own leadership style by creating leadership guideposts and then building your own tools – ones that you can use to understand your own people and work better with your own teams.&nbsp; &nbsp;\n\n&nbsp; </p><p><em>Since giving you the most possible value is so important to us, Eazl is offering this course with our 30-day guarantee. If you’re not totally wowed by the content, feel free to ask for a refund. We will give you one immediately, no questions asked. Sound good?&nbsp; </em>\n\n&nbsp; </p><p><strong>Who is the target audience?</strong>&nbsp; &nbsp;</p><ul><li><p>New managers looking to transition successfully from a production to a management role &nbsp; </p></li><li><p>Existing managers looking to get more engagement and innovation from their teams and organizations &nbsp; </p></li><li><p>Entrepreneurs who need to use \"soft power\" to motivate people to achieve exceptional outcomes with limited resources</p></li></ul><p><em><br>Course Version Release Notes:</em></p><ul><li><p>What's new in version version 1.1? </p><ul><li><p>Added welcome video to pose key questions and introduce key learning outcomes</p></li></ul></li><li><p>What's new in version 2.0?</p><ul><li><p>Lucky you! If you enrolled prior to June 2015, you've just been upgraded to masterclass! Over the summer of 2015, entire sections on macroeconomics for managers, negotiation, personal productivity, communication strategies, and teambuilding will be rolled out! Stay tuned!</p></li><li><p>All new intros are now included to support the conversion to a masterclass.</p></li><li><p>Woohoo! The section on macroeconomics for managers is live.</p></li></ul></li><li><p>What's new in version 2.1?</p><ul><li><p>Rock on! There's a great new section on negotiation for you!</p></li></ul></li><li><p>What's new in version 2.2?</p><ul><li><p>Woohoo! There's an awesome new section of modules on personal productivity!</p></li></ul></li><li><p>What's new in version 2.3?</p><ul><li><p>Check out the new section on persuasive, internal, and visual communication strategies for managers!</p></li></ul></li><li><p>What's new in version 3.0? We're proud to launch a fully upgraded version of the course! In version 3.0, you now have:</p><ul><li><p>A brand new section that provides detailed recipes for handling common management challenges. This section includes a guide to candidate interviewing and an entire additional set of modules.</p></li><li><p>We've now added contextual interviews with Brian Burwell, one of the world's business leaders. Though we can't tell you the name of the company Brian leads, you can certainly look it up on the web. Brian has led multimillion dollar management consulting engagements for some of the world's largest and most sophisticated firms (Fortune 100 companies) and you're very lucky to see and hear his perspective on the topics covered in each section of the course. </p></li><li><p>The content has been reordered, old introductions have been removed, and other changes have been made to upgrade your learning experience. Enjoy!</p></li></ul></li><li><p>What's new in version 3.1?</p><ul><li><p>Woohoo! Brand new section intros to make your learning experience even better!</p></li></ul></li><li><p>What's new in Version 4?</p><ul><li><p>In version 4.0, you'll have access to a first-of-it's-kind interactive business simulation that mixes video, data, and reactions to the decisions you make based on the concepts studied in the course. Stay tuned!</p></li></ul></li><li><p>What's new in version 5? </p><ul><li><p>You asked and we delivered! We've now optimized this learning experience for you to receive your advanced management certificate when you complete 100% of the course. This feature has been popular with members of Eazl's growth marketing community because it enables you to use your time and energy taking this course to earn a verifiable certificate created, hosted, and issued by Eazl.</p></li><li><p>The course now includes brand new footage at the beginning of each section that deliver the key concepts that you'll build in the section. Overall in the 5.0 upgrade, we have embraced the sophisticated management science research that drives this learning experience. In order to make that research meaningful, you need to be comfortable with relatively advanced concepts relating to negotiation, communication, etc. so we've made that a bigger part of the new lectures.</p></li></ul><ul><li><p>A cloud-based study guide now accompanies version 5 of the course. This should make your learning experience more interactive and seamless if you're using a mobile device.</p></li></ul></li><li><p>What's new in version 6? (Published November 3, 2018)</p><ul><li><p>Our students asked for more opportunities to apply their learning, so we have used Udemy's new Assignments feature to build case-study exercises for each topic area of the course. For example, in the practical management topic area, you'll have a chance to manage the expectations of one of the high-performing members of your team. In the negotiation section, you'll read the case of the botched Time-Warner / CBS&nbsp;negotiations and have a chance to apply your learnings to what went wrong with this failed round of negotiations. Each assignment includes readings from world-class business journals and/or peer-reviewed management science-related academic journals, an animated case study, and possible solutions to the questions you're invited to answer. We hope you enjoy the big update!</p></li></ul></li><li><p>What's new in version 7? (Published November 1, 2019)</p><ul><li><p>You asked and we delivered! This year, we've added full, professionally-developed captions to the course. These captions should help you better-retain the management science concepts you're learning in the course, and, if you speak English as a second language, improve your English language skills and build your vocabulary.&nbsp;We hope you enjoy version 7!</p></li></ul></li><li><p>What's new in version 7.1? (Published April 13, 2020)</p><ul><li><p>We've updated links to many of the external resources associated with your learning experience. If you find any dead links, send us a message!</p></li></ul></li><li><p>What's new in version 7.2? (Published November 1, 2020)</p><ul><li><p>You spoke and we listened!&nbsp;Your expert interviews in this course have been completely re-made and re-imagined. Many of you suggested that more concise, takeaway-driven interview editing would keep your learning experience more engaging.&nbsp;So, all of the expert interviews you'll find in the course are now presented in the \"Fantastic Four Takeaways\"&nbsp;approach; four of the biggest takeaways from the interview. This should keep your learning experience exciting. You can also now dive into any of these expert interviews deeper, if you like. The full version of all of your expert interviews are now available on the Eazl YouTube channel.</p></li><li><p>Your course experience will now be much more streamlined. As a part of re-imagining how you experience interviews, the overall length of your learning experience (in terms of minutes / hours watched)&nbsp;will now decrease substantially.&nbsp;Whereas the course was ~8 hours in previous incarnations, now the course is ~4.5 hours long.</p></li><li><p>The section introductions have been re-created so that now, when you learn a new concept (like \"Integrative Bargaining\"), a complementary animation or piece of footage exists alongside the delivery of that concept. This should enable you to learn more quickly, and retain more of what you learn.</p></li></ul></li><li><p>What's new in version 7.3 (Published November 1, 2021)</p><ul><li><p>In this update, we've added a suite of \"Voices from the Field\" videos, which is a lecture format that presents answers to management-related questions from a variety of people who work in management back-to-back to one another. For example, we've used this new lecture format to help new managers with common challenges like building trust, giving employees feedback, and coaching a struggling employee. We've also used this lecture format to add more content to the negotiation section of your course. Specifically, we've tried to enable you to gain skills in gaining leverage in negotiations and in communicating when you're negotiating.</p></li></ul></li><li><p>What's new in version 7.4 (Published January 1, 2022)</p><ul><li><p>In this update, we've added professionally-developed English-language subtitles to accompany all lectures and interviews that were published in the most recent update.&nbsp;This will be helpful for our community of ESL&nbsp;learners!</p></li></ul></li></ul>","suitableLearners":["New managers looking to transition successfully from a production to a management role","Existing managers looking to get more engagement and innovation from their teams and organizations","Entrepreneurs who need to use \"soft power\" to motivate people to achieve exceptional outcomes with limited resources"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-10-27T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-10-30T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fbd9c9b04f3f624d68c"],"topics":[],"reviews":[],"meta":{"ratingCount":5957,"studentCount":16194,"avgRatingScore":4.611705,"contentVideoLength":9505},"basicInfo":{"udemyCourseId":357350,"slug":"lean-problem-solving-for-team-members-and-leaders","title":"Lean Problem-Solving for Team Members and Leaders","subtitle":"Problem Solving Is The Core Activity of Continuous Improvement that Every Team Member Should Know","image":"https://img-c.udemycdn.com/course/240x135/357350_2d70_19.jpg","price":1949670,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["You will develop the attitudes and habits of team problem-solving that produce performance improvement.","You will learn three models of problem-solving associated with Toyota Production System or \"lean management.\"","You will learn and apply a simple and direct approach to root cause analysis and situation analysis.","You will develop and practice the skills of brainstorming and consensus reaching.","You will practice a simple and effective model of action planning and follow through that is critical to achieving results."],"requirements":["There is nothing you need to know or do before the course."],"description":"<p>Your personal success depends on your ability to lead teams! High performing team leaders are promoted and are successful entrepreneurs. Leading teams is the critical competence for leaders at all levels today. And, problem-solving is the basic methodology that drives improvement by teams and lean organizations. This short course provides the basic skills and philosophy of effective problem solving. It is based on 45 years of experience developing teams and implementing lean management or Toyota Production System. I recommend that you go through the course with your team so that you can together practice each of the methods in your real work setting. This is not an “academic” course, but rather it is based on working in manufacturing, healthcare and other industries with hundreds of teams tackling real world problem and engaging in continuous improvement.</p><p>Toyota Production System, or lean management and culture, are based on the practice of continuous improvement through problem solving. This lectures reviews the basic principles of lean that apply to problem solving.</p><p>The principles of lean that are important to how we solve problems include the following:</p><ul><li><p>Respect for People</p></li><li><p>Continuous Improvement</p></li><li><p>Going to Where the Work Get's Done - the Gemba</p></li><li><p>Know the Facts - Graphing the Data and Understanding Trends</p></li><li><p>Applying the Scientific Method of Experimentation</p></li></ul><p><strong><em>The course covers the following:</em></strong></p><p>The Lean philosophy of problem-solving and continuous improvement.</p><p>Healthy attitudes toward problem solving.</p><p>Simple situation analysis.</p><p>Root cause analysis - the \"five why's?\"</p><p>Brainstorming causes of problems.</p><p>The PDCA problem solving model.</p><p>The A3 problem solving model.</p><p>The skill of brainstorming.</p><p>Pareto or the 80/20 rule.</p><p>Action-Planning and follow-up</p><p><br></p>","suitableLearners":["Any manager, team leader, or team member wishing to develop the critical skills of improving performance.","Anyone engaged in lean management or continuous improvement."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2018-08-30T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2018-09-02T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fbd9c9b04f3f624d68c"],"topics":[],"reviews":[],"meta":{"ratingCount":5586,"studentCount":20519,"avgRatingScore":4.5267124,"contentVideoLength":12747},"basicInfo":{"udemyCourseId":684890,"slug":"decision-making-solve-problems-with-emotional-intelligence","title":"Decision Making: Solve Problems with Emotional Intelligence","subtitle":"Evaluate your problem solving and decision making by managing emotions and using creativity and intuition objectively","image":"https://img-c.udemycdn.com/course/240x135/684890_35b1_4.jpg","price":1949670,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["Identify how to make better decisions through critical thinking and creative problem solving.","Recognize and remove barriers to creativity to foster an innovative work environment producing practical solutions.","Discover ways to move beyond familiar ways of thinking and seeing the world, and become open to new ways of listening, leading, responding, and innovating.","Use mindfulness to evaluate all of the attributes of the different options, and make more informed decisions.","Develop and build your emotional intelligence."],"requirements":["You should have an interest and understanding of emotional intelligence but no prior knowledge and experience is needed to benefit from the course.","An interest in how to use your emotions and manage impulses to effectively solve problems and make optimal choices.","A keenness to learn more about innovation, creativity and mindfulness as techniques to use in problem solving and making decisions.","You should have a willingness to complete the practical activities to grow and develop your decision making and your emotional intelligence skills"],"description":"<p><em>How effective are you at processing information from your environment and using emotion to drive your decision making?</em></p><p><em>How rational and objective are you in problem solving and decision making?</em></p><p>From the decision to rise in the morning to the decision go to&nbsp;close your eyes and go to sleep&nbsp;at night, you are constantly solving problems and making decisions.&nbsp; Throughout each day you are confronted with a variety of <strong>problems and decisions </strong>that require a <strong>rational</strong>, <strong>thoughtful response</strong> underpinned with good<strong> emotional awareness</strong>.</p><p>This course is about <strong>proactively working towards solutions </strong>that help you to <strong>make timely decisions</strong> as you solve work problems to bring value to your company and your customers. In addition, the skills, processes and tools taught in this course can bring value to other aspects of your life.</p><p><strong>Good decision making </strong>means that you can grasp problems and mindfully devise effective solutions. It means that you can <strong>deal realistically with situations</strong> as they arise and <strong>manage emotions and impulses</strong> that may disrupt effective decision making.</p><p>Both <strong>creativity</strong> and <strong>mindfulness</strong> form a basic part of <strong>solving problems </strong>along with <strong>intuition</strong>. Intuition is a decision making process that is often overlooked in business. Applied in a mindful way, and used well, it can add richness and speed to developing realistic solutions to problems.&nbsp; &nbsp;<strong>Critical thinking&nbsp;</strong>to work in an emotionally intelligent manner&nbsp;forms&nbsp;a major component of the skills of decision making&nbsp;to overcome unconscious bias.&nbsp; This is covered in detail within the course.</p><p>The course is based around the <strong>Decision Making</strong> component of Reuven Bar-On's comprehensive assessment of emotional intelligence.&nbsp; You do not need any knowledge of this model or about emotional intelligence to take the course.&nbsp; <em>(It is important for me to stress that I have no commercial affiliation with Reuven Bar-on and the EQ-i 2.0 assessment.)</em></p><p>This course is a standalone course for anyone interested in understanding how to solve problems and make good quality decisions more effectively.&nbsp; It forms part of a comprehensive course that explores <strong>emotional intelligence</strong> in more depth.</p><p>The course covers the ways to stimulate creativity and looks in detail at the fashionable business technique of mindfulness.&nbsp; Within this course, mindfulness is applied to decision making.</p><p>You'll receive all the information that you need and will be <strong>coached</strong> using<strong> loads of practical hints</strong> that you can use straight away.</p><p>The course is made up of a series of lectures and contains course notes. There are a series of interactive <strong>practical activities</strong>&nbsp;that involve some interaction&nbsp;with other people and some reflection.</p><p>The course material makes up a one to two day workshop so is equivalent to 8 -12 hour's training. It forms part of our <strong>advanced emotional intelligence course</strong> endorsed by the <strong>Institute of Leadership and Management</strong>.</p><p>By completing this course, you will be able to</p><ul><li><p>Identify how to make better decisions through critical thinking and creative problem solving</p><p><br></p></li><li><p>Recognise and remove barriers to creativity to foster an innovative work environment producing practical solutions</p><p><br></p></li><li><p>Discover ways to move beyond familiar ways of thinking and seeing the world</p><p><br></p></li><li><p>Investigate new ways of listening, leading, responding, and innovating</p><p><br></p></li><li><p>Use mindfulness to evaluate all attributes of the different options available and make more informed decisions</p><p><br></p></li></ul><p><em>PLEASE&nbsp;NOTE&nbsp;-&nbsp;This course is&nbsp;</em><strong><em>NOT</em></strong><em>&nbsp;for you if you are not prepared to work through the practical activities that make up a fundamental part of the course. &nbsp;Your decision making&nbsp;cannot be developed&nbsp;just&nbsp;by&nbsp;watching the video lectures. &nbsp;It requires you to do some reflective thinking, to&nbsp;get some feedback and to discuss your development with others. &nbsp;I'm afraid that you won't get the best from the course unless you are prepared to do this.</em></p><p>There are <strong>EIGHT&nbsp;</strong>practical activities included within the course that are designed to help you to develop your decision making capabilities.&nbsp; These are</p><ol><li><p>Reflecting about the Emotional Intelligence Course</p></li><li><p>Assess your Decision Making</p></li><li><p>Understanding your Reality</p></li><li><p>Problem Solving with SCAMPER</p></li><li><p>Impulses and Gratification</p></li><li><p>Mindfulness: What Affects your&nbsp;Energy?</p></li><li><p>An Exercise in Critical Thinking</p></li><li><p>Learning Review</p></li></ol><p>For example, by completing the practical activity \"<em>Problem Solving with SCAMPER</em>\" you will enable to come up with new ideas when you're trying to develop or improve a product or service.</p><p>This course is being&nbsp;continually refined and updated to ensure it remains current and relevant.</p><p><br></p><p>The course contains a series of Lightbulb Moments resource cards, which have been created to provide you with handy reminders of key points around topics covered within the course.</p><p>All PDFs are Section 508 / ADA Accessibility compliant.</p><p>All videos are High Definition recorded in 1080p.</p><p>All videos have grammatically correct English captions.</p><p><strong><em>Latest update - March 2022</em></strong></p>","suitableLearners":["This course will support the development of your emotional intelligence by helping you to make better quality decisions.  It will be of interest to anyone who is looking to develop their problem solving and decision making skills. It will help you to understand your reality and how it differs from others, how your emotions can influence your impulses,  and how you can use mindfulness and creativity to drive your decisions and solve problems.","This course will NOT give you quick fixes or answers to your problems but help you in developing your capability to do this for yourself."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-04-07T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-04-10T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fbd9c9b04f3f624d68c"],"topics":[],"reviews":[],"meta":{"ratingCount":5584,"studentCount":34288,"avgRatingScore":4.5174356,"contentVideoLength":19732},"basicInfo":{"udemyCourseId":2013542,"slug":"advanced-product-management-vision-strategy-metrics","title":"Advanced Product Management: Vision, Strategy & Metrics","subtitle":"Learn the skills Product Managers use every day. Vision, strategy, & advanced metrics for Product Managers","image":"https://img-c.udemycdn.com/course/240x135/2013542_4203_7.jpg","price":1949670,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["The difference between vision and strategy","How famous leaders use vision to succeed","How to use a vision framework for your company and product","How to use OKRs to track progress","How product development hierarchies work","How to understand agile roadmapping","How to tie your metrics to your overall business strategy","When to use data and when to use intuition","How to debug metrics with origin source sorting","How to recognize cohort anomalies","How to design a cohort analysis","How to design and run a t-test on cohort data","The difference between a leading and lagging metric","How metrics differ in multiple industries, including e-commerce, mobile, &  marketplaces"],"requirements":["Familiarity with Product Management concepts is suggested"],"description":"<p>In this truly modern course, you'll learn all of the <strong>advanced skills and techniques</strong> that <strong>successful product managers</strong> use in their day-to-day working lives. From how to <strong>implement vision and strategy</strong> to getting a better understanding of <strong>how to use data</strong>, these lectures are designed for for founders, CEOs and, of course, product managers. With <strong>real world examples</strong> demonstrating exactly how to execute each approach, you'll find out exactly what to do (and what not to do) to <strong>build your company up</strong> to the level it deserves.</p><p>You already know the basics of being a product manager and securing that all-important job. But ensuring the success of your products is an entirely different ball game. You need to know the framework that transforms any product from zero to hero <em>and</em> the metrics measuring techniques that will allow you to figure out a product's successes and pitfalls. After all, there's nothing that can't be improved.</p><p>The first section of this course will take you through two hugely important elements of product management: vision and strategy. Whether you're a founder of a company or the product manager at said company, we'll teach you the difference between the two and how to implement them into the development of your products. The second section goes into a lot more detail on metrics. We'll take you through how to figure out what data to measure and how to fully understand the data that you track. There's also a deep dive into three different industries to demonstrate how metrics can change depending on the product that you're working on.</p><p>At the end of it all, you'll have the tools needed to make better, and more profitable, decisions in your product manager role. </p><p><strong>Your instructors</strong></p><p><strong>Cole Mercer</strong>&nbsp;has been a Senior Product Manager at Soundcloud, Bonobos, Mass Relevance, and has taught the Product Management course at General Assembly in Manhattan, NYC. He is now a full-time Product Management and Strategy consultant.</p><p><strong>Evan Kimbrell&nbsp;</strong>is a top rated Udemy instructor with 19 courses on everything Entrepreneurship. His courses have over 630,000 students and over 32,000 five star reviews. For the past few years, he has also been running a digital agency that has produced over 100 web and mobile products.</p><p><br></p><p><strong>What you’ll learn</strong></p><ul><li><p>What vision and strategy actually mean.</p></li><li><p>The importance of vision and strategy in product management.</p></li><li><p>What makes a great visionary and how to set a clear vision.</p></li><li><p>How the product development hierarchy works.</p></li><li><p>The most common types of strategy.</p></li><li><p>How to set out an effective roadmap.</p></li><li><p>How to use a more modern and agile form of roadmapping.</p></li><li><p>What metrics actually are.</p></li><li><p>The types of metrics you should be monitoring and optimizing.</p></li><li><p>The various metrics that relate to e-commerce, mobile and marketplace products.</p></li><li><p>How leading and lagging metrics tie into product management.</p></li><li><p>How to analyze metrics using cohorts.</p></li><li><p>Gain an understanding of origin source sorting and how this can skew product metrics.</p></li><li><p>When to use data versus when to use your intuition.</p></li><li><p>Real world examples demonstrating all of the above.</p></li></ul><p><strong>Are there any course requirements or prerequisites?</strong></p><ul><li><p>As this is an advanced course, a basic understanding of Product Management would be beneficial. </p></li></ul><p><strong>Who this course is for</strong></p><ul><li><p>Anyone looking to learn advanced Product Management techniques.</p></li><li><p>Product Managers and CEOs who want to gain more effective decision-making skills.</p></li></ul>","suitableLearners":["Students looking to transition into Product Management","Existing Product Managers who want to augment their skills & understanding","Entrepreneurs that want to learn the discipline of Product Management"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-04-07T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-04-10T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fbd9c9b04f3f624d68c"],"topics":[],"reviews":[],"meta":{"ratingCount":5468,"studentCount":13635,"avgRatingScore":4.4869795,"contentVideoLength":1970},"basicInfo":{"udemyCourseId":1556346,"slug":"effective-delegation-for-new-managers","title":"Effective Delegation for New Managers","subtitle":"How to delegate tasks the right way (and free up your busy schedule to focus on more important activities)","image":"https://img-b.udemycdn.com/course/240x135/1556346_94c1_4.jpg","price":687970,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["Understand how to delegate efficiently","The \"Highest Rated\" course on Udemy about delegation!","Free up time to focus on more strategic tasks","Avoid common errors in delegation","Improve clarity and reduce miscommunication","Develop subordinates to take on more responsibilities"],"requirements":["This course is for new managers who recently started managing one or more employees","No special knowledge is required to enroll in the course"],"description":"<p>**The \"<strong>Highest Rated</strong>\"&nbsp;course on Udemy about<strong> delegation </strong>and a<strong> bestseller </strong>in the<strong> \"Manager Training\"&nbsp;</strong>category** </p><p>*This is a <strong>super-short course</strong> (approx <strong>30 minutes</strong>) that gives you everything you need to learn <strong>how to delegate</strong> without wasting your time on useless high-level strategies or impractical delegation matrices**</p><p><em>**Over </em><strong><em>11,000+ leaders</em></strong><em> have taken this course with successful results**</em></p><p><br></p><p>Learn <strong>simple concepts</strong> that help you <strong>become a better team leader</strong> and manager through delegation.</p><p><br></p><p><strong>Master Simple Tips That You Can Implement Straightaway</strong></p><ul><li><p>Assign activities&nbsp;using the right authority level</p></li><li><p>Use specific phrases that motivate your subordinates</p></li><li><p>Set clear tasks and timelines to reduce ambiguity</p></li><li><p>Check-in and give meaningful feedback throughout the process</p></li></ul><p><br></p><p><strong>Avoid the Common Mistakes That New Managers Make</strong></p><p>New managers make a lot of mistakes when they first start&nbsp;delegating, including micromanaging their employees, seeking instant gratification, and believing they can do it all themselves.</p><p>After taking this course, you'll avoid most of these pitfalls, and you'll learn that delegation is a long-term process that is a win-win for you and your employees. You'll benefit by saving time and focusing on more strategic tasks, and your employees will benefit by growing and developing in their own careers.</p><p><br></p><p><strong>Content and Overview</strong></p><p>The course contains over 10 lectures and 30 minutes of content. It is designed for any employee or entrepreneur&nbsp;who recently became a new manager of one or more team members.&nbsp;</p><p>The content includes three main sections (before delegation, during delegation, and after delegation), and each section includes simple steps that you can follow.</p><p>The course is delivered in a format that is easily digestible for busy professionals (each video lecture is around 2 minutes long).&nbsp;</p><p>Here's are the steps that are covered in the course:</p><p><br></p><p>BEFORE&nbsp;Delegation</p><ul><li><p><strong>Step 1</strong>: Determine What to Delegate</p></li><li><p><strong>Step 2</strong>: Determine Who to Delegate to</p></li></ul><p><br></p><p>DURING&nbsp;Delegation</p><ul><li><p><strong>Step 1</strong>: Explain the Task Clearly</p></li><li><p><strong>Step 2</strong>: Describe Goals, Not Actions</p></li><li><p><strong>Step 3</strong>: Give a Clear Timeline</p></li><li><p><strong>Step 4</strong>: Describe the Authority Level</p></li><li><p><strong>Step 5</strong>: Put it in Writing</p></li></ul><p><br></p><p>AFTER&nbsp;Delegation</p><ul><li><p><strong>Step 1</strong>: Check-In</p></li><li><p><strong>Step 2</strong>: Give Meaningful Feedback</p></li></ul><p><br></p><p>By&nbsp;the end of this course, you'll be armed with&nbsp;a comprehensive&nbsp;end-to-end process that you can implement right away with your employees.</p><p>There are no requirements necessary to enroll in the course, and you can learn the material at your own pace.<br></p><p><br></p><p>------------------------------------------------------------------------</p><p><strong>Student Testimonials:</strong></p><p>★★★★★ <em>\"Having been on the receiving end of many a poorly/incompletely delegated assignments, I think that the pointers here are excellent advice, and could not be any more clean and simple. </em><strong><em>In only 30 minutes too - did this one over lunch and still had time for a walk after!</em></strong><em>\" -</em> Kristin Easley</p><p>★★★★★ <em>\"This course is </em><strong><em>fast-paced and very practical</em></strong><em>. It provides useful tips for delegating in a way that will yield more success. Well done.\" </em>- George Hacker</p><p>★★★★★ <em>\"Great delegation is not about just giving your team an easily achievable task but to ask them to take over challenging projects and accomplish them as well with utmost dexterity. Thank you Hassan for the </em><strong><em>effective course</em></strong><em>.</em>\"<em>- </em>Austin Amaravati</p><p>------------------------------------------------------------------------</p><p><br></p><p><strong>30 Day Money Back Guarantee</strong></p><p>If you are not satisfied with the course for <strong>any reason</strong>, you may return the course within 30 days of the purchase date.</p><p><br></p><p><strong>Ready to Start?</strong>\nClick on the \"<strong>Buy Now</strong>\"&nbsp;or \"<strong>Enroll Now</strong>\" button in the top right corner of this page and start learning how to delegate effectively.</p><p><br></p>","suitableLearners":["New managers who want to learn more about how to delegate","Team leaders who are interested in freeing up some of their work"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-04-05T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-04-08T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fbd9c9b04f3f624d68c"],"topics":[],"reviews":[],"meta":{"ratingCount":5417,"studentCount":11870,"avgRatingScore":4.432952,"contentVideoLength":3978},"basicInfo":{"udemyCourseId":2615622,"slug":"mastering-conflict-management-and-resolution-at-work","title":"Mastering Conflict Management and Resolution at Work","subtitle":"Discover what happens to you in conflict, use tools to resolve any conflict, and strengthen your relationships","image":"https://img-c.udemycdn.com/course/240x135/2615622_fa26.jpg","price":4587770,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["Define conflict and identify your conflict handling style","Use strategies to manage your defensiveness","Tools to help you resolve any conflict and remain calm in heated arguments","Methods for recovering from conflict, rebuilding trust, forgiving, and apologizing"],"requirements":["There are no requirements for this course. Everyone has had a conflict with someone. You will reflect on your past experiences with conflict in this course."],"description":"<p>Does interpersonal conflict make you cringe? Don't worry; you're not alone. Many of us would rather get a root canal than have to confront someone about a conflict. But avoiding conflict never helped anyone. This course will make it easier for you to manage conflict and by the end of this course, you may even welcome the chance to work through a tough conflict.</p><p>In this course, you will:</p><ul><li><p>Look at some of your past conflicts to understand how you typically handle conflict (and whether it's effective!)</p></li><li><p>Gain valuable tools to handle any conflict immediately</p></li><li><p>Learn how to recover from conflict, and what to do after the conflict is over to repair a relationship</p></li></ul><p>This course is designed to be actionable, fun, reflective, and thought-provoking. In my experience as a psychologist and executive coach, I’ve helped many people navigate conflict. Throughout the course, I’ve included exercises and tools that I’ve found to be the most helpful when working through conflict so that you’re prepared to resolve any conflicts that may arise in your life right away.</p><p>It won't always be easy, but it will be worth it. Let's face it: conflict is inevitable, and people who have the tools to handle it effectively are more productive, fulfilled, and influential. So if you're ready, fasten your seat-belt and get ready to learn!</p><p><br></p><p><strong>CPE (Continuing Professional Education)</strong></p><p><strong>Learning Objectives</strong></p><ol><li><p>Identify how to resolve conflict and attend to a relationship effectively.</p></li><li><p>Name the 5 conflict handling behaviors.</p></li><li><p>Recognize why effective conflict resolution is important for meaningful relationships.</p></li><li><p>Identify reasons people have conflict with each other.</p></li><li><p>Name the typical reasons people are challenged by interpersonal conflicts.</p></li><li><p>Recognize the three aspects of the conflict handling spectrum.</p></li></ol><p>For additional information, including refunds and complaints, please see <strong>Udemy Terms of Use</strong>, which is linked from the footer of this page.</p><p>For more information regarding administrative policies, please contact our support using the <strong>Help and Support</strong> link at the bottom of this page.</p>","suitableLearners":["Early and mid-stage career professionals who want to improve their workplace communication and emotional intelligence","Professionals who want to learn strategies for resolving workplace conflict and fostering strong relationships with their colleagues."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-02-24T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-02-27T00:00:00.000Z"},"promotions":{"enabled":false}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fbd9c9b04f3f624d68c"],"topics":[],"reviews":[],"meta":{"ratingCount":5410,"studentCount":13918,"avgRatingScore":4.545675,"contentVideoLength":2623},"basicInfo":{"udemyCourseId":1347004,"slug":"understanding-and-developing-emotional-intelligence","title":"Understanding and developing Emotional Intelligence","subtitle":"What Emotional Intelligence is, why It matters, and how to develop it.","image":"https://img-c.udemycdn.com/course/240x135/1347004_bd4d_2.jpg","price":1146770,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["You will be able to understand and apply the principles of Emotional Development in both personal and professional spheres.","The knowledge to mentor or coach others towards greater Emotional Intelligence.","Greater personal insight into the links between thoughts and feelings, and be able to distinguish between them in order to make more informed choices.","More resilient responses to challenges, stress, pressure and high demand."],"requirements":["The course does not require learners to have any specific software, just basic computer-operating skills.","No special materials or prior knowledge necessary - everything is provided."],"description":"<p>This engaging course outlines the concept of Emotional Intelligence, explains why it is important for personal and professional development, and describes how to apply the ideas to assess and improve your own confidence and performance by developing your EI. </p>\n\n\n\n<p>As the different aspects are explained via our video lectures, each section is supported by downloadable exercises and other resources to help you revise and consolidate the learning.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>We all know what intellectual intelligence is, and we also know it can be misleading because that sort of intelligence doesn’t accurately reflect how well someone functions and manages at work or in life.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>We also all know of highly intelligent people who don't handle themselves very well; they are not good in social relationships, for example, or that have difficulty communicating.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Just as important as conventional IQ – the sort of intelligence that gets measured in those tests many of us did in school – is Emotional Intelligence. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Emotional Intelligence is a set of aptitudes which determine how well you handle yourself in life, and how well you are able to understand and get on with others.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>In an ever-more complex and demanding world, technical expertise – knowing how to do your job – is not enough. We are all experiencing higher demand, more stress, and more fluid working relationships. Now we can all do with being more proactive, engaging with others, and learning how to manage our own energy levels, our relationships, and other people.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The skills of Emotional Intelligence show you how to do these things and how to develop the insight and confidence to handle your own and others' expectations and emotions effectively.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This course features easily learned elements supported by practical exercises, all clearly explained by Barry Winbolt, lecturer and psychotherapist, based on his 30 years' experience of helping people to improve workplace relationships and performance in many different settings and cultures.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>In a series of engaging videos, he explains the strengths of Emotional Intelligence and why we should develop them in ourselves and others. He shows you how to make the skills part of your repertoire. He then provides a comprehensive toolkit for creating positive working relationships, and managing yourself, as well as the increasing demands of the workplace. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>By the end of this course, you'll have a better understanding of Emotional Intelligence, which will help you become more confident in your decisions and your working relationships. It will place you ahead of the pack; Emotional Intelligence is a key component in effective management and leadership.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Emotional Intelligence is based on a set of learnable skills. It is backed up by a huge body of research which shows that these skills can help you:</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Get on better with others</li><li>Communicate more effectively </li><li>Make better decisions</li><li>Handle stress and pressure</li><li>Motivate yourself</li><li>Reduce anxiety</li><li>Manage others more effectively.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>You’ll also learn why EI is now seen as the defining characteristic among successful managers and leaders. </p>","suitableLearners":["Aimed primarily at managers, aspiring managers and others in a supervisory role, the content is applicable to anyone who wants to understand Emotional Intelligence for personal or professional development","People who want to improve their career prospects by developing their Emotional Intelligence","HR and other professionals who want to guide and coach others to improve their performance","Leaders who want to know how to 'win hearts and minds'"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2020-02-16T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2020-02-19T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fbd9c9b04f3f624d68c"],"topics":[],"reviews":[],"meta":{"ratingCount":5331,"studentCount":10740,"avgRatingScore":4.505425,"contentVideoLength":4867},"basicInfo":{"udemyCourseId":2092642,"slug":"the-superboss-playbook-for-managers","title":"The Superboss Playbook for Managers","subtitle":"Discover how top managers develop high potential talent, lead by teaching, and foster creative, high-performance teams.","image":"https://img-b.udemycdn.com/course/240x135/2092642_52dc_2.jpg","price":687970,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["Discover the concept of the \"superboss\" and the characteristics that help them succeed","Assess your superboss abilities and pinpoint the superboss traits you have and need to develop","Use unconventional methods to identify and recruit exceptional talent","Inspire and motivate your team of \"chosen ones\" by conveying a powerful vision","Unleash creativity by embracing change, taking risks, and learning from mistakes","Adopt a master-apprentice relationship with your direct reports to allow for hands-on teaching","Build high-functioning teams using a combination of collaboration and competition","Manage a network of your past employees to stay in contact and cultivate chances for further partnership"],"requirements":["There is no prerequisite knowledge or materials required for this course.","You should currently be a manager or have plans to become a manager in the future in order for this course to be most useful."],"description":"<p>Do you want to know how the best managers generate and re-generate exceptional talent? Are you ready to learn how to lead from the best of the best? If so, <strong>The Superboss Playbook for Managers is your opportunity to learn the best practices used by top industry leaders to shape unconventional, creative, and high-performance talent.</strong></p><p>So what is a superboss? <strong>In short, a superboss is a leader who creates other leaders.</strong> They have particular characteristics and leadership styles that help them develop talent in ways unlike your average manager. Superbosses are always at the top of their industries and aim to get the best out of the people that work for them, in turn producing other industry leaders. You may recognize the names of some famous superbosses, such as Ralph Lauren, Lorne Michaels, and Larry Ellison, but you don't need to be a household name to be a superboss. <strong>ANYONE CAN BE A SUPERBOSS, and this course gives you a step-by-step playbook to adopt the most important superboss practices.</strong></p><p>My name is <strong>Sydney Finkelstein</strong>, and I've been a professor at the Tuck School of Business at Dartmouth College for 25 years. My book <em>Superbosses: How Exceptional Leaders Master the Flow of Talent</em> was the result of a 10-year research project into the secrets of the superboss. I&nbsp;interviewed hundreds of individuals, spanning many industries, but superbosses all have one thing in common - they spawn top-tier talent. <strong>I've created this course to give you insight into how these managers work with their employees to achieve phenomenal success and how you can too.</strong></p><p>Specifically, this course will cover:</p><ul><li><p>What a superboss is, including the characteristics and types of superbosses</p></li><li><p>How to determine the superboss traits you currently have and those you can develop</p></li><li><p>Recruiting exceptional (and often unusual) talent</p></li><li><p>Energizing and motivating your team using high expectations and an uncompromising vision</p></li><li><p>Unleashing creativity by embracing change, taking risks, and learning from mistakes</p></li><li><p>Embracing your role as a teacher and developing your employees using a master-apprentice relationship</p></li><li><p>Building collaborative and competitive teams and lucrative employee networks</p></li></ul><p>I've also included activities in every section to help you put these lessons into practice immediately within your teams. While the lectures are meant to give you insight into how other superbosses have succeeded, <strong>the activities are your chance to start establishing your own superboss identity.</strong> Use the activities as stepping stones to figure out which superboss practices work well for you and your team.</p><p>I know that this course will not only introduce you to how the best managers lead their teams and industries, but will provide you with actionable tips to start leading like a superboss today.<strong> If you're ready to take your leadership and talent management to the next level, please join me in this course!</strong></p><p><strong>CPE&nbsp;(Continuing Professional Education)</strong></p><p><strong>Learning Objectives</strong></p><ol><li><p>Describe the characteristics of a superboss.</p></li><li><p>List the three different types of superbosses.</p></li><li><p>Recognize what superbosses look for in the people they hire.</p></li><li><p>Explain why superbosses are attracted to untapped talent pools.</p></li><li><p>State how superbosses motivate their employees.</p></li><li><p>Describe why vision is important.</p></li><li><p>Describe how superbosses unleash the creativity of the people around them.</p></li><li><p>Define the term “opportunity spotter.”</p></li><li><p>Recognize what superbosses do differently than other bosses when it comes to developing talent.</p></li><li><p>Describe why superbosses value their networks so much.</p></li></ol><p>For additional information, including refunds and complaints, please see <strong>Udemy Terms of Use</strong>, which is linked from the footer of this page.</p><p>For more information regarding administrative policies, please contact our support using the <strong>Help and Support</strong> link at the bottom of this page.</p>","suitableLearners":["Experienced managers who want to adopt new techniques to develop and teach their employees","New managers looking to learn the best practices for managing high-performance teams","Aspiring managers who want to prepare themselves with a game plan to successfully lead direct reports","If you do not currently manage employees or plan to do so in the future, this course is not for you."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2020-12-16T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2020-12-19T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}}]