[{"status":"active","categories":["622c1fa5a2de424e23bbe971","625e7a54fb82b80788574146"],"topics":[],"reviews":[],"meta":{"ratingCount":375,"studentCount":13151,"avgRatingScore":4.028472,"contentVideoLength":12930},"basicInfo":{"udemyCourseId":1313410,"slug":"how-to-make-a-wordpress-website-elementor-page-builder","title":"How To Make A Wordpress Website -Elementor Page Builder","subtitle":"Learn How To Create an AMAZING Wordpress Website! Master Wordpress and Elementor Page Builder!","image":"https://img-b.udemycdn.com/course/240x135/1313410_3280.jpg","price":458570,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["Learn How To Create Their Own Website","Learn How To Master The Elementor Page Builder","Create Websites For You, Your Business, Or anyone else!"],"requirements":["None, Just Have A PC And An Internet Connection!"],"description":"<p><strong>Why Take This AMAZING Course?</strong></p><ul><li><p><strong>Highest Rated Instructor Here On Udemy For WordPress Lessons</strong></p></li><li><p><strong>Master WordPress and Elementor Page Builder. Complete Beginners Guide</strong></p></li><li><p><strong>Use and MASTER&nbsp;The Elementor Page Builder for FREE</strong></p></li><li><p>I Am A&nbsp;<strong>TOP RATED INSTRUCTOR</strong>&nbsp;on Udemy. Find out Why!!</p></li><li><p>Get a&nbsp;<strong>Modern</strong>&nbsp;And&nbsp;<strong>Amazing</strong>&nbsp;Look For Your Website That Will Impress!</p></li><li><p>Learn From A Professional Who Creates Websites For a Living with over 30,000 Monthly Visits!</p></li><li><p><strong><em>THE MOST UPDATE AND MODERN TUTORIAL</em></strong>. Don't Settle For Outdated Content!</p></li><li><p>Get A fully Responsive Website And Mobile Responsive</p></li></ul><p>Unlike Other Lectures. I Cover Everything. Don't be left in the dark with other lectures that are only one hour long. I help my students and make sure they are 100% informed on all WordPress features.&nbsp;<strong>This lecture is very detailed and will make you fully understand how you can create your WordPress website from scratch as a beginner.&nbsp;</strong></p><p><strong>What Will I Learn From This Course?</strong></p><ul><li><p>Setting up your domain and hosting</p></li></ul><ul><li><p>Create Modern,beautiful, and STUNNING Websites!</p></li><li><p><strong>Create Pages With Elementor and WordPress</strong></p></li><li><p>Create Pre-Made layouts for clients</p></li><li><p><strong>Master The Elementor Page Builder and even start your own business!</strong></p></li><li><p>Master The #1 FREE Page Builder - Elementor</p></li><li><p><strong>LEARN HOW TO USE THE DRAG AND DROP MODULES + VISUAL BUILDER. EASY!</strong></p></li><li><p>Master WordPress. Create Your Own Website Simply And Easily.</p></li></ul>","suitableLearners":["Anyone who wants to learn how to make a website with no experience!"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2019-12-05T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2019-12-08T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["622c1fa5a2de424e23bbe971","625e7a54fb82b80788574146"],"topics":[],"reviews":[],"meta":{"ratingCount":1856,"studentCount":13597,"avgRatingScore":3.7704153,"contentVideoLength":14534},"basicInfo":{"udemyCourseId":1354088,"slug":"microsoft-powerapps-flow-build-business-apps-without-code","title":"Microsoft PowerApps & Flow: Build Business Apps Without Code","subtitle":"You will learn how to build Apps without code using Microsoft PowerApps and Microsoft Flow.  A powerful alternative","image":"https://img-b.udemycdn.com/course/240x135/1354088_80cf_2.jpg","price":2179070,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["Build basic business apps for your organization or clients without code","In this course, students will get familiar with the concepts of Microsoft PowerApps and Microsoft Flow","learn how to use these services to create business apps and flows without needing any development skills.","Work as a freelancer and provide services to clients. Build your business & earn money!"],"requirements":["No prior knowledge to PowerApps or Flow is required","Must be Tech Savvy","Must have excellent internet connection speed","Your own email address with a domain account","Familiar with Microsoft Excel Formulas","Some knowledge of Office 365 environment"],"description":"<p><strong>Course Description:</strong></p><p><strong>Build Business Apps Without Code</strong> That's right no programming skills required.</p><p><strong>[Updates - October 2021] New lectures added on Microsoft PowerApps Artificial Intelligence (AI) Builder</strong></p><p><strong>[Updated - March 2022] Added PowerApps formula reference section</strong></p><p>In the world of the information worker you will handle information that is probably stored across different software suites, like SharePoint, Salesforce, Excel file, Access database. Typically, you would like your end-users to be able to browse and/or modify this data in a general user-friendly, and preferably mobile, way.&nbsp;Microsoft <strong>PowerApps&nbsp;</strong>allows people, without any development skills, to build applications that are mobile friendly on top of their data. Allowing other people to use the built application to browse the data and maybe even modify it.</p><p>We’ll explore the capabilities when building an app using&nbsp;PowerApps online, since studio has been deprecated.&nbsp;PowerApps allows you to create business apps involving data and other resources that might be critical for the enterprise and need to be restricted to specific audiences. Using the <strong>PowerApps Admin Center</strong>, an organization can establish boundaries and policies around the use of PowerApps on their data.<br></p><p><strong>Join thousands of other students and share valuable experience</strong></p><p>Get started today and join thousands of our happy students, many of whom have changed careers, created second incomes or added critical new skills to their tool kits. Our students have become successful <strong>cloud&nbsp;web app developers</strong> managing applications and learning valuable skills. Some are freelancing and earning even more with high scaled projects.</p><p><strong>Main Topics:</strong></p><ul><li><p>What is PowerApps?</p></li><li><p>PowerApps components</p></li><li><p>Related technologies</p></li><li><p>Licensing and pricing conditions</p></li><li><p>PowerApps connections</p></li><li><p>App samples and templates</p></li><li><p>Introduction to PowerApps Studio</p></li><li><p>Creating apps from templates</p></li><li><p>Creating apps from scratch</p></li><li><p>Screens and Pages</p></li><li><p>Screen components: Forms, DataCards, Controls</p></li><li><p>Handling bindings</p></li><li><p>Versioning, publishing and sharing apps and much more</p></li></ul><p><strong>Why take this course?</strong></p><p>If you’re currently involved in content management, app development or as a power user&nbsp;— this course will enable you to build on that experience, and master the most cutting edge tools and practices in developing business apps raising productivity levels within your organization.&nbsp;For students who might be new to the field,<strong> this is an excellent course and provides a quick learning curve to get you up to speed with building apps</strong></p><p>So, what are you waiting for? Enroll now and get your skills to the next level.</p><p>Syed and Team ClayDesk</p>","suitableLearners":["Anyone who wants to develop business apps without code","This course also targets power users, content managers, business analysts and many more who want to learn how to quickly and easily","If you work with SharePoint or Power BI, this course is for you","Freelancers who wish to add another service offering to their portfolio","SharePoint & Power BI Users to build basic business apps for their organization"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2020-07-22T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2020-07-25T00:00:00.000Z"},"promotions":{"discountPrice":321160,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["622c1fa5a2de424e23bbe971","625e7a54fb82b80788574146"],"topics":[],"reviews":[],"meta":{"ratingCount":1526,"studentCount":6130,"avgRatingScore":4.2847977,"contentVideoLength":17742},"basicInfo":{"udemyCourseId":1223634,"slug":"wix-master-course-make-a-website-with-wix-full-4-hours","title":"Wix Master Course: Make A Website with Wix (FULL 4 HOURS)","subtitle":"Easily Build a Wix Website Start to Finish - For Yourself, For Your Business, or For Someone Else","image":"https://img-c.udemycdn.com/course/240x135/1223634_e5b9_4.jpg","price":687970,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["Easily Design a Wix Website from Start to Finish","Easily Maintain Your Wix Website & Make Routine Updates","Have a website published and live that can also be seen on Google","Pass on your knowledge of how to create and maintain Wix Websites"],"requirements":["No Prior Knowledge Is Required, This Is Perfect For Website Beginners"],"description":"<p><strong>Wix Master Course: Make A Website in 1 Day with Wix!</strong><br></p>\n\n<p><strong>Learn how to build a Wix Website Start to Finish in 1 Day with the owner of a top web design firm.</strong> I can easily help create an awarding winning website and can also provide service afterwards if you need it!<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>BENEFITS OF WORKING WITH ME:</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ol><li>Full Interactive Course with tons of resources that will help you <strong>learn Wix in 1 Day</strong></li><li><strong>I've</strong><strong> created thousands of websites</strong> so have the eye for design to help you create an impressive website just like I've done for many clients. <strong>Check Out My Company: Luxurious Web Design on Google</strong></li><li>This course will also help you master online marketing and be found via Google -- there's no point in creating a website if it can't be found. You will <strong>RECEIVE </strong><strong>FREE</strong> a 12 Page guide called Master Online Marketing Extreme, to help with online marketing</li><li>Once you purchase this course I will keep videos updated with the newest content, so you're not looking at outdated videos while trying to work on an updated platform</li><li>Save tons of money by doing your website yourself</li><li> If you need service after the course I can gladly assist you with quick fixes, website redesigns, full website design, graphic/logo design, and online marketing/search engine optimization.</li></ol>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>THIS COURSE IS PERFECT IF YOU WANT TO LEARN HOW TO:</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Create a Wix Website from start to finish in 1 Day</li><li>Learn how to plan for creating your website (organizing your wording &amp; photos)</li><li>Learning the basic features of Wix and the advanced features of Wix</li><li>Learn what search engine optimization is (SEO) and how you can be found on Google, Yahoo, etc.</li><li>Learn how to maintain your website and keep it up to date</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong></strong></p>","suitableLearners":["Beginners interested in creating a website on Wix.com. No Coding Required, No Confusing Tools or Software, and No Technical Words you don't understand involved."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-04-06T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-04-09T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["622c1fa5a2de424e23bbe971","625e7a54fb82b80788574146"],"topics":[],"reviews":[],"meta":{"ratingCount":1463,"studentCount":5053,"avgRatingScore":4.8211064,"contentVideoLength":38325},"basicInfo":{"udemyCourseId":2484544,"slug":"the-bubble-beginners-bootcamp-2019-visual-programming","title":"The Bubble Beginners Bootcamp (2019) - Visual Programming","subtitle":"The only course you need to get up and running with Bubble visual programming as quickly as possible.","image":"https://img-c.udemycdn.com/course/240x135/2484544_06cc_4.jpg","price":1949670,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["Learn a ground breaking new technology called Bubble, which is changing the way we develop applications without code.","Build a real world project & task management system called 'Teambase\" with an interactive features such as creating, assigning and completing tasks.","Go from a total beginner to an intermediate skill level by the end of the course.","Learn from an instructor who has built successful applications with Bubble, raised VC funding and monetised applications."],"requirements":["A bubble hobby account.","No technical skills necessary.","Lots of motivation"],"description":"<p><strong>**Learn from an experienced Bubble developer &amp; coach who has helped multiple founders build successful applications without code using Bubble technology**</strong></p><p><br></p><p>In 2016 I had a vision of building a marketplace application. The only problem was that I had no technical skills and not enough money to pay a developer. I&nbsp;was lucky enough to discover Bubble and <strong>within 6 months I had learned Bubble to an advanced degree, was accepted too and completed a tech accelerator program and within 1 year raised VC funding and launched my startup.</strong> I did all of this along side other startup companies who were spending tens of thousands on developers. I'd like to teach you how this is possible with the right attitude and motivation. </p><p><br></p><p>In this course we'll be <strong>building a project &amp; task management application</strong> that includes:</p><ul><li><p>Building a dashboard style application</p></li><li><p>Creating user accounts</p></li><li><p>Signup &amp; login workflows</p></li><li><p>User generated profile pages</p></li><li><p>Project &amp; team collaboration</p></li><li><p>Task management</p></li><li><p>Search functionality</p></li><li><p>User Management</p><p><br></p></li></ul><p>The <strong>technical &amp; design skills</strong> you will learn include:</p><ul><li><p>The Bubble Editor</p></li><li><p>Page layout and design</p></li><li><p>Workflow logic</p></li><li><p>Database design</p></li><li><p>Using styles</p></li><li><p>Utilizing plugins</p></li><li><p>Custom States</p></li><li><p>Repeating group filtering and sorting</p></li><li><p>Dynamic data integration</p></li><li><p>Basic SEO settings</p></li><li><p>Image processing with Imgix</p></li><li><p>Conditional statements</p></li><li><p>Privacy settings</p></li><li><p>Responsive design</p></li><li><p>Deploying your app live!</p></li></ul>","suitableLearners":["Founders who don't want to pay for expensive developers and would rather build their own applications quickly.","People that want to learn about Bubble and new direction that development is taking.","People who are curious about building software."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2019-09-13T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2019-09-16T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["622c1fa5a2de424e23bbe971","625e7a54fb82b80788574146"],"topics":[],"reviews":[],"meta":{"ratingCount":1080,"studentCount":5477,"avgRatingScore":4.713765,"contentVideoLength":23221},"basicInfo":{"udemyCourseId":2578302,"slug":"learn-elementor-wordpress-front-end-development-course","title":"Learn Elementor - WordPress Front-End Development Course","subtitle":"Elementor page builder gives you total control to design and create the site you've always wanted, without restrictions.","image":"https://img-c.udemycdn.com/course/240x135/2578302_aa50_4.jpg","price":1949670,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["Why learning Elementor is a great option if you want a page builder and/or theme creator.","The differences between the free & Pro versions of Elementor.","Where to get inspiration for your website design, colour & fonts.","What the box model is, and why it's so important as you design your site.","How to use Elementor as a page builder.","How to create a use (and re-use) templates.","How to use Elementor Pro to create your own theme.","How to use motion effects in your design.","How to ensure your site looks great on desktop, tablet and mobile phone.","How to use custom fields and custom post types for better website design and easier maintenance."],"requirements":["A working knowledge of WordPress.","Elementor plugin is required for this course.  If you want to design your own theme, then you will need the Pro version."],"description":"<p>Learn Elementor and unleash a powerful&nbsp;&amp; free page builder for WordPress with this Elementor course.&nbsp; With it, you can drag and drop your way to a powerful website design.&nbsp; Elementor works a little differently from most page builders.&nbsp; For a start, you design live on the front-end of your site, not in the back-end Dashboard.</p><p>The free version is a page-builder that comes with dozens of beautiful widgets and templates that you can use to build your web page content with pixel perfect precision. &nbsp;It's an impressive and well-established page-builder. </p><p>The Pro version of Elementor will blow you away!&nbsp; If you have ever been frustrated trying to make your WordPress theme look like the demo you saw on the theme's homepage, you are not alone.&nbsp; &nbsp;Most themes require extra plugins and an in-depth knowledge of the support documentation to make it look anything like the one that drew you to it in the first place. &nbsp;With Elementor Pro, you don't need to ever feel that frustration again.&nbsp; Elementor Pro gives you the same drag and drop page builder, but also allows you to create your own WordPress theme, designed exactly as you want it.</p><p>This Elementor course covers both the free and paid versions of Elementor.&nbsp; </p><p>After a discussion of why you should learn Elementor, you'll install the plugin and a theme. &nbsp;We'll then cover:</p><ul><li><p>How to borrow inspiration from other websites, to craft your own unique design.&nbsp; That includes choosing the right fonts and colours for your site.</p></li><li><p>We'll look at the box model and you'll learn how padding and margin can affect placement of elements on the page.&nbsp; </p></li><li><p>We'll take a look at Hex colour codes.</p></li><li><p>We'll go through all of the back-end settings, including how to install custom fonts and icons (for Pro users).</p></li><li><p>You'll become familiar with the front-end Elementor interface as we go through all of the menu and settings.</p></li><li><p>You'll get to know how an Elementor page is structured using sections, columns and elements.&nbsp; At this stage, I'll set you a few design tasks and then go over the solutions in detail.</p></li><li><p>You'll learn how to use templates so that you can create a design element once, and re-use it as many times as you want.&nbsp; You can even export your templates from one site and import them into another.</p></li><li><p>You'll see why global widgets are a powerful asset in your toolbox.</p></li><li><p>For Pro users, we'll look at building an entire theme with Elementor, based on the inspiration we got earlier in the course.&nbsp; We'll see how different templates can be created and used in different areas of the site design.&nbsp; We'll create templates for the site header, footer, blog page, 404 page, single post template &amp; archive page template. &nbsp;Will design the homepage. &nbsp;We'll design a landing page. &nbsp;We'll even design a popup and set the trigger conditions to define when it shows on your site.</p></li><li><p>Elementor offers you some great tools, including motion effects. &nbsp;These can be used to bring movement to your pages, so we'll look at those.</p></li><li><p>How (and why) we can use and integrate advanced custom fields and custom post types into our site design.</p></li><li><p>And finally, we'll look at mobile optimization.&nbsp;&nbsp;This powerful set of tools will allow you to check (and fix) your site design so that it looks great on a desktop, tablet AND&nbsp;mobile phone.</p><p><br></p><p>Elementor was created for every site owner that wants to create beautiful web content.&nbsp; It was created to allow you to design the site YOU&nbsp;want.&nbsp; This course teaches you how to use it!</p><p> </p></li></ul>","suitableLearners":["WordPress users that are frustrated trying to get a WordPress theme to look good.","Any WordPress user who want flexible website design, and total control over the placement of design elements.","Any WordPress user that wants to learn Elementor."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-12-08T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-12-11T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["622c1fa5a2de424e23bbe971","625e7a54fb82b80788574146"],"topics":[],"reviews":[],"meta":{"ratingCount":875,"studentCount":3505,"avgRatingScore":4.7318883,"contentVideoLength":29411},"basicInfo":{"udemyCourseId":862478,"slug":"build-your-startup-with-no-coding-design-develop-ship","title":"Build Your Startup with No Coding (Design, Develop & Ship)","subtitle":"Learn to design, structure, and deploy a SaaS startup with Bubble.","image":"https://img-c.udemycdn.com/course/240x135/862478_cde3_3.jpg","price":687970,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["Developing with Bubble","Structuring Data for Production","Designing Interfaces and Experiences","Architecting User Flows","Integrating External APIs","Deploying to the World"],"requirements":["No coding languages will be used.","Development knowledge or experience not required.","This course is for all types of learners, students, peers. "],"description":"<p>Hello there! Are you entrepreneurial and yearning to build the next big thing without a developer? Have an idea in your back pocket that you want the world to see? Maybe you don't like current solutions and want to build one on your own but without coding? That's what this course is for - you'll be able to develop your startup through harnessing the power of Bubble and exploring numerous apps that we'll make together. (plus more apps will be made every month!)</p><p><strong class=\"redactor-inline-converted\">What is this course?</strong> If you've ever had a SaaS startup idea of your own that you really wanted to execute but didn't have a developer by your side, then this course enables you to realize how to build it from design to shipment without writing a single line of code.</p>\n\n<p><strong class=\"redactor-inline-converted\">Who's teaching it?</strong> Good question. I've been involved with startups since I was 16. After founding, funding and exiting my own local commerce startup, I learned a thing or two. Currently, as a user experience lead at a well-funded startup and a passionate instructor, I'm helping people build their ideas themselves. </p>\n\n<p><strong class=\"redactor-inline-converted\">Why would I take it?</strong> There is nothing like the feeling that you can build anything. When I started learning web development, I felt overwhelmed by all that I had to learn though I still wanted to. If you're ever felt that way or don't have too much time to invest in learning, then this course will convince you that is very possible to take your ideas and make them into realities.<br></p>\n\n<p><strong class=\"redactor-inline-converted\">What will I do?</strong> Once I get you caught up with a platform called Bubble, I'll show you how you can not only design, but structure, architect and execute your startup ideas. Who knows? You could someday be a millionaire, all because you said <em>yes</em> to learning how to develop your startup without any coding. </p>\n\n<p><strong class=\"redactor-inline-converted\">How much time? </strong>Not much at all. The platform you'll be using makes it easy not only for me to explain to you what things to consider when developing a startup, but also for you to pick things up and get going entirely on your own.<br></p>\n\n<p>What are you waiting for? Starting learning how to build your startup without any coding and tons of more apps with free lifetime updates! Looking forward to seeing you.</p><p>Cheers.</p>","suitableLearners":["Entrepreneurs who want to build the next big thing","Investors looking to quickly validate concepts","Designers interested in making their work come alive","Development beginners who seek to understand SaaS startups","Anyone wanting to get into the rapidly-growing world of startups"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2016-09-27T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2016-09-30T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["622c1fa5a2de424e23bbe971","625e7a54fb82b80788574146"],"topics":[],"reviews":[],"meta":{"ratingCount":698,"studentCount":3214,"avgRatingScore":4.6174817,"contentVideoLength":33107},"basicInfo":{"udemyCourseId":1357116,"slug":"elementor-build-amazing-wordpress-pages-with-elementor","title":"Elementor - Build Amazing WordPress Pages With Elementor","subtitle":"Master how to use the Elementor plugin to build amazing pages and implement great design on your WordPress website","image":"https://img-b.udemycdn.com/course/240x135/1357116_218c_2.jpg","price":1949670,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["Build fantastic looking web pages without using any code","Master the art of using the Elementor page builder plugin"],"requirements":["The Student should know how to use WordPress","General experience with building websites is an advantage"],"description":"<p><strong><em>** UPDATED&nbsp;FEBRUARY 2022 WITH BRAND NEW COURSE CONTENT **</em></strong></p><p>Would you like to learn how to build amazing&nbsp;responsive pages for your WordPress website with <strong>ZERO </strong>coding? If so then you have come to the right course.&nbsp;</p><p>With more than a million downloads already, Elementor is one of the very best and most popular plugins for building pages in WordPress. The plugin is extremely fast and comes with a variety of widgets and elements making it very easy to build any kind of web page imaginable without using any code.</p><p><strong>Course Content:</strong></p><p>The course is divided into two main sections.</p><p>In the first section, we are going to use the <strong>FREE</strong> version of Elementor to build a full<strong> one page website for a fictional company </strong>known as the White Hat Hackers. This company specializes in cyber security and they help companies fight against cyber attacks and hackers. </p><p>In the process of building this website, you will learn the following </p><ul><li><p>How to work with sections, columns and widgets</p></li><li><p>How to build a header section complete with the site logo and social media icons</p></li><li><p>How to work with&nbsp;title widgets</p></li><li><p>How to work with video and text boxes</p></li><li><p>How to build an image carousel</p></li><li><p>How to insert number counters as well as toggle elements</p></li><li><p>How to add a Google map to your web page</p></li><li><p>How to create and insert a contact form</p></li><li><p>How to build a complete footer section for your WordPress website</p></li><li><p>How to build responsive web content and structure</p></li><li><p>How to work with page templates</p></li><li><p>and so much more</p></li></ul><p>In section two, we are going to use the PAID&nbsp;version of Elementor to further enhance the functionality and design of the website. In addition to learning about the extra features that come with Elementor pro, you will learn about the following as well -&nbsp;</p><ul><li><p>How to add a countdown timer to your page</p></li><li><p>How to create an animated headline</p></li><li><p>How to add a contact form</p></li><li><p>How to enhance design and style using flip boxes</p></li></ul><p>This course will be updated continually to ensure that it always describes how to use the latest features of Elementor. </p><p>By the end of the course, you would have mastered how to use the Elementor plugin to build any type of web page that you want.</p><p><br></p>","suitableLearners":["WordPress students who want to learn how to use a page builder plugin","Web developers who want to learn how to use the Elementor page builder plugin"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-02-13T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-02-16T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["622c1fa5a2de424e23bbe971","625e7a54fb82b80788574146"],"topics":[],"reviews":[],"meta":{"ratingCount":613,"studentCount":6285,"avgRatingScore":4.5387616,"contentVideoLength":34326},"basicInfo":{"udemyCourseId":3885700,"slug":"modern-artificial-intelligence-with-zero-coding","title":"Modern Artificial Intelligence with Zero Coding","subtitle":"Build 5 Practical Projects & Harness the Power of AI to solve practical, real-world business problems with Zero Coding!","image":"https://img-c.udemycdn.com/course/240x135/3885700_2995_8.jpg","price":1949670,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["Build, train and deploy AI models to detect people emotions using Google Teachable Machine","Explain the difference between learning rate, epochs, batch size, accuracy and loss.","Predict Insurance Premium using Customer Features such as age, smoking habit and geo-location using AWS AI AutoPilot","Build, train and deploy advanced AI to detect cardiovascular disease using DataRobot AI","Leverage the power of AI to recognize food types using DataRobot AI","Develop an AI model to detect and classify chest disease using X-Ray chest data using Google Teachable Machines","Evaluate trained AI models using various KPIs such as confusion matrix, classification accuracy, and error rate","List the various advantages of transfer learning and know when to properly apply the technique to speed up training process","Understand the theory and intuition behind residual networks, a state-of-the-art deep neural networks that are widely adopted in business, and healthcare","Learn how to train multiple AI models based on XG-Boost, Artificial Neural Networks, Random Forest Classifiers and compare their performance in DataRobot","Understand the impact of classifier threshold on False Positive Rate (Fallout) and True Positive Rate (Sensitivity)","Learn how to use SageMaker Studio AutoML tool to build, train and deploy AI/Ml models which requires almost zero coding experience","Differentiate between various regression models KPIs such as R2 or coefficient of determination, Mean absolute error, Mean Squared error, and Root Mean Squared Error","Build, train and deploy XGBoost-based algorithm to perform regression tasks using AWS SageMaker Autopilot"],"requirements":["The course has no prerequisites and is open to anyone with no or basic programming knowledge. Students who enroll in this course will master AI fundamentals and directly apply these skills to solve real world challenging problems."],"description":"<p><strong><em>Do you want to build super-powerful applications in Artificial intelligence (AI) but you don’t know how to code?</em></strong></p><p><strong><em>Are you intimidated by AI and don’t know where to start?</em></strong></p><p><strong><em>Or maybe you don’t have a computer science degree and want to break into AI?</em></strong></p><p><strong><em>Are you an aspiring entrepreneur who wants to maximize business revenue and reduce costs with AI but don’t know how to get there quickly and efficiently?</em></strong></p><p><br></p><p>If the answer is yes to any of these questions, then this course is for you!</p><p>Artificial intelligence is one of the top tech fields to be in right now!</p><p>AI will change our lives in the same way electricity did 100 years ago.</p><p>AI is widely adopted in Finance, banking, healthcare, transportation, and technology. The field is exploding with opportunities and career prospects.</p><p>This course solves a key problem which is making AI available to anyone with no coding background or computer science degree.</p><p>The purpose of this course is to provide you with knowledge of key aspects of modern AI without any intimidating mathematics and in a practical, easy, and fun way. The course provides students with practical hands-on experience using real-world datasets.</p><p>In this course, we will assume that you have been recently hired as a consultant at a start-up in San Francisco. The CEO has tasked you to apply cutting-edge AI techniques to 5 projects. There is only one caveat, your key data scientist quit on you and do not know how to code, and you need to generate results fast. In fact, you only have one week to solve these key company problems. You will be provided with datasets from all these departments and you will be asked to achieve the following tasks:</p><ul><li><p>Project #1: Develop an AI model to detect people's emotions using Google Teachable Machines <strong><em>(Technology)</em></strong>.</p></li><li><p>Project #2: Develop an AI model to detect and classify chest disease using X-Ray chest data using Google Teachable Machines <strong><em>(HealthCare)</em></strong>.</p></li><li><p>Project #3: Predict Insurance Premium using Customer Features such as age, smoking habit, and geo-location using AWS AI AutoPilot <strong><em>(Business)</em></strong>.</p></li><li><p>Project #4: Detect Cardiovascular Disease using DataRobot AI <strong><em>(HealthCare).</em></strong></p></li><li><p>Project #5: Recognize food types and explore AI&nbsp;explainability using DataRobot AI<strong><em> (Technology).</em></strong></p></li></ul><p><br></p><p><br></p><p><br></p>","suitableLearners":["Seasoned consultants who don’t possess coding skills (or have basic coding skills) and wanting to transform businesses by leveraging AI.","Visionary business owners who want to harness the power of AI to maximize revenue, reduce costs and optimize their business.","AI Practitioners wanting to advance their careers and build their portfolio.","Tech enthusiasts who are passionate about AI and want to gain real-world practical experience."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-07-20T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-07-23T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["622c1fa5a2de424e23bbe971","625e7a54fb82b80788574146"],"topics":[],"reviews":[],"meta":{"ratingCount":596,"studentCount":6160,"avgRatingScore":4.485247,"contentVideoLength":35370},"basicInfo":{"udemyCourseId":2017762,"slug":"complete-bubble-developer-course-build-apps-without-coding","title":"Complete Bubble Developer Course: Build Apps Without Coding","subtitle":"Learn how to build fully functional web and mobile applications without code - go from beginner to advanced.","image":"https://img-c.udemycdn.com/course/240x135/2017762_4ace_2.jpg","price":1949670,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["Build fully functional web and mobile apps without coding completely on your own.","Create beautiful user interfaces with an amazing user experience.","Deploy your app to the world and launch your startup.","Design elegant workflows, databases, APIs and a whole lot more."],"requirements":["No previous coding or development knowledge required.","A registered free hobby account with Bubble.","An open mind and the willingness to learn."],"description":"<p><strong>Welcome to the \"Complete Bubble Developer Course\" where you will learn how to build fully functional apps without coding.</strong> Do you have an idea for an app? But you're not a software developer, and you don't know how to code? Until now, there was only two ways you can build an app:</p><p>1. <strong>Learn</strong> how to code - which has a steep learning curve and is very time consuming for non-technical people. </p><p>2. <strong>Hire</strong> a developer to build your app for you - however, development and on going maintenance costs are very expensive.</p><p>I had the same problem as you until I discovered this incredible tool called Bubble. <strong>Bubble is a revolutionary visual programming platform</strong> that enables people with <strong>absolutely no technical background</strong> to build complete web or mobile applications without code using<strong> drag and drop and workflows</strong>.</p><p>In this course <strong>you will learn</strong>:</p><ul><li><p>User interface design</p></li><li><p>User experience design</p></li><li><p>Payment gateways</p></li><li><p>Social media sign in</p></li><li><p>Databases structuring</p></li><li><p>Create, read, update and delete data</p></li><li><p>Workflow logic</p></li><li><p>Conditionals</p></li><li><p>Custom states</p></li><li><p>Data constraints</p></li><li><p>Linking data objects</p></li><li><p>Nested search</p></li><li><p>Paths and navigation</p></li><li><p>Parameters</p></li><li><p>User inputs</p></li><li><p>Auto-binding</p></li><li><p>API calls and integration</p></li><li><p>API Keys and authentication</p></li><li><p>User testing</p></li><li><p>Debugging</p></li><li><p>Privacy settings</p></li><li><p>Accessing user location</p></li><li><p>Optimizing performance</p></li><li><p>Responsive screen settings</p></li><li><p>Deploying your app to the world</p></li><li><p><strong>And more!</strong></p></li></ul><p>If you don't know what any of those words mean, don't worry we <strong>start right from the beginning</strong>. In this course, we get hands-on and <strong>build several applications from scratch</strong>. Plus as our main project, we will be building a clone of the Tinder dating app explaining every detail and step while building the app.</p><p>I am a qualified Industrial and Systems Engineer, experienced Bubble developer and Udemy instructor since 2015. I've incorporated everything I've learned in my years of engineering and teaching to make this course not only more effective but more engaging. The course includes:</p><ul><li><p>Over <strong>100</strong> Lectures and <strong>10</strong> hours of on-demand video content.</p></li><li><p><strong>11</strong> Interactive assignments.</p></li><li><p><strong>4</strong> Projects.</p></li><li><p><strong>5</strong> Quizzes.</p></li><li><p><strong>12</strong> Downloads.</p></li><li><p><strong>1</strong> E-book.</p></li><li><p><strong>17</strong> Articles.</p></li><li><p>And the best part… Templates!</p></li></ul><p>As an extra, I will give you the templates of all the apps we build <strong>completely free</strong> including the Tinder clone app.&nbsp; You can use these templates and modify them to build your own unique applications.</p><p><strong>At the end of this course not only will you be able to build your own fully functional apps but you will be able to start that online business you've always wanted. </strong></p>","suitableLearners":["People who don't know how to code but still want to build software.","Anyone who has an idea for an app and want's to bring the idea to life.","Anyone curious about app development."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2020-06-28T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2020-07-01T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["622c1fa5a2de424e23bbe971","625e7a54fb82b80788574146"],"topics":[],"reviews":[],"meta":{"ratingCount":580,"studentCount":109125,"avgRatingScore":4.3869457,"contentVideoLength":17303},"basicInfo":{"udemyCourseId":3415214,"slug":"build-an-amazon-affiliate-e-commerce-store-from-scratch","title":"Build an Amazon Affiliate E-Commerce Store from Scratch","subtitle":"Earn Passive Income by Building an Amazon Affiliate E-Commerce Store using WordPress, WooCommerce, WooZone, & Elementor","image":"https://img-c.udemycdn.com/course/240x135/3415214_1915_2.jpg","price":802670,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["Registering a Domain Name & Setting up Hosting","Installing WordPress CMS on Your Hosting Account","Navigating the WordPress Interface","The Advantages of WordPress","Securing a WordPress Installation with an SSL Certificate","Installing Custom Themes for WordPress","Installing WooCommerce, Elementor, & WooZone Plugins","Creating an Amazon Affiliate Account","Importing Products from Amazon to an E-Commerce Store using WooZone Plugin","Building a Customized Shop with Menu's, Headers, Branding, & Sidebars","Building WordPress Pages, such as Blogs, About Pages, and Contact Us Forms","Customizing Product Pages on a WordPress Power E-Commerce Site","Generating Traffic and Sales for Your Newly Published Amazon Affiliate Store"],"requirements":["Basic Computer Skills"],"description":"<p>Thank you for tuning into our latest course. This time, we’ve teamed up with Developer, and pro affiliate marketer, Hemlata Singh, to show you how to build a complete Amazon Affiliate E-Commerce Store from scratch. <br><br>By taking this course not only will you be able to build a complete e-commerce site, but you’ll also learn how to populate it with thousands of top rated Amazon products. You’ll earn a generous commission on each sale, through the Amazon Associate Affiliate program. If you’re new to the world of affiliate marketing, then you’re definitely in the right place. The reason this course focuses on the Amazon Affiliate program, is quite simple - it’s arguably the best one out there. Amazon offers the largest selection of products and some of the best commission rates for affiliates. It’s also open to just about anyone in the world, regardless of your physical location. Another great feature of this business model, is that it’s infinitely scalable. You can start by selling just a few products a week, and easily scale to selling thousands. Once your store is set up, it requires nearly no maintenance. If you’re interested in building passive income streams, this is about as close as you’ll get.</p><p>The course starts with an introduction into the benefits of joining the Amazon Affiliate network. From there, you’ll learn to build a fully customized online store, using WordPress, WooCommerce, Elementor and the WooZone Plugin. Each of these powerful utilities offer you the ability to build a fully customized e-commerce store with thousands of products, without ever writing a single line of code. Your online store will also be fully secure with SSL encryption. We’ll show you how to install popular themes and edit them on the fly, including free custom logos, professional branding, and favicons. <br><br>The store developed in this course, will be second to none in terms of functionality. You’ll have a fully integrated search feature, categorized product menu, and just about every other feature you find on even the most advanced e-commerce sites. The course also includes a bonus section with a comprehensive overview on generating sales using proven digital marketing techniques.<br><br>Let’s go through a quick overview of exactly what you will learn in this course:</p><ul><li><p><strong>Section 1: </strong><br>Includes an introduction to the Course with an Overview on the benefits of the Amazon Affiliate Program.<br></p></li><li><p><strong>Section 2</strong>: <br>Covers a number of important tips on registering a domain name and setting up your hosting account. We use services that make the development process as quick and simple as possible. <br></p></li><li><p><strong>Section 3</strong><br>Students learn to install and configure WordPress on the hosting service of their choice. We also go through a comprehensive overview of the WordPress interface, and detailed analysis of the advantages of using WordPress. Students learn to secure their WordPress installation with a Free SSL certificate, before installing all the required themes and plugins.<br></p></li><li><p><strong>Section 4:</strong><br>Covers the entire process of building out the online affiliate store. We start with setting up an Amazon affiliate account and importing products using the WooZone plugin. From there we build a fully customized shop, with menus, headers, branding, and sidebars. We also customize the product pages for increased conversion and user-friendly navigation. The shop will also consist of a Blog, About Page, and Contact Us form to process support requests. <br></p></li><li><p><strong>Section 5:</strong> <br>We offer several great strategies on driving traffic to your Amazon Affiliate store and generating sales.</p><p><br></p></li></ul><p>As you can see, we haven’t skipped a single beat in the production of this curriculum. If you’re excited about building e-commerce platforms, affiliate marketing and generating a passive income source, enroll today and get started!</p><p><br></p>","suitableLearners":["Students interested in Drop-Shipping","Students Interested in Affiliate Marketing","Students interested in the the Amazon Associate Affiliate Program","Students interested in Building a Fully Customized E-Commerce Store","Students interested in Learning WordPress with WooCommerce & Elementor Integration"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2020-08-18T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2020-08-21T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["622c1fa5a2de424e23bbe971","625e7a54fb82b80788574146"],"topics":[],"reviews":[],"meta":{"ratingCount":488,"studentCount":2317,"avgRatingScore":4.531035,"contentVideoLength":43100},"basicInfo":{"udemyCourseId":1435098,"slug":"wix-web-design-2022level-1beginner-wix-certified-trainer","title":"Wix Web Design 2022:Level 1:BEGINNER *Wix Certified Trainer","subtitle":"Learn from a Wix Certified Trainer how to build an engaging website that converts visitors to leads -- guaranteed!","image":"https://img-c.udemycdn.com/course/240x135/1435098_705a_6.jpg","price":1146770,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["Build a professional website and publish to the internet"],"requirements":["You should be able to access the internet and have basic PC skills"],"description":"<p><strong>New content coming for 2022!</strong></p><p><strong>I will walk you through some of the latest and highest converting Wix templates</strong></p><ul><li><p>Latest templates:</p><ul><li><p>Remote Learning Classroom</p></li><li><p>Business Resume with animated logo</p></li></ul></li></ul><p>BONUS: Walk-through tutorials&nbsp;of 14 top-selling Wix templates to save you time and frustration.</p><p>Earn money during the pandemic working from home as a Web Designer for your own business or service or a Digital Agency building sites for others.</p><p>This Web Design Beginner Course will take you from concept to publication of a professional and stunning website, all without writing code.&nbsp;Build a site for yourself, for your business, or make money building them for others.&nbsp; Don't just watch random videos on Web Design. This class will take you step-by-step. New content is added to keep the information current and your designs cutting edge.</p><p>NO&nbsp;WEB&nbsp;DESIGN&nbsp;EXPERIENCE&nbsp;IS NECESSARY</p><p>You will learn:</p><ul><li><p>SMART goals</p></li><li><p>Knowing Your Target Audience</p></li><li><p>Call-to-Action Buttons</p></li><li><p>Website Mapping</p></li><li><p>Wix Artificial Design Intelligence</p></li><li><p>Building Custom Sites</p></li><li><p>Choosing the right Domain Name</p></li><li><p>Publishing to the web</p></li><li><p>Search Engine Optimization Essentials</p></li><li><p>Using the Google Search Console</p></li></ul><p><em>Intro Video Transcript:</em></p><p>Hello, welcome to the Webmaster Academy. My name is Michael Wood and I am the owner and chief web designer at Captivatim Multimedia. </p><p>Over the years I have built websites for small businesses, entrepreneurs, and non-profit organizations. I realized during those years that people had a wealth of ideas, dreams, and goals they wanted to pursue...but there was one thing they all have in common… they all need a website. Think about it. Your website is the first impression people have of your business or service. But more than that...websites drive your customers to take action. You know, to buy your latest product, make an online appointment for your services, or even make reservations for an event your hosting. What I’m saying is that your website should be MORE than just a fancy business card. It should be the front lines of your business. It should be actively updated. It should work hard for your business so you can grow your audience and get your message out.</p><p>As a Wix Certified Trainer, I decided to design a course that is easy enough for anyone with basic computer skills to build a professional website without writing code. In this 101 course, we will plan out your website, decide on some SMART goals, identify your target audience, and then we will build a website using Wix.</p><p>How fast do you need your site? As they say, time is money. Do you have 15 minutes? I will show you how to use Wix&nbsp;Artificial Design Intelligence to create a stunning website in less time than it takes a pizza to be delivered to your house. </p><p>People who have taken this course often say they wish they had this information 10 years ago. And if you already have a website, let’s make it better.</p><p>I can’t wait to see the Webmaster you will become at the end of this. So, let’s get started. </p>","suitableLearners":["Anyone who wants to learn web design without writing code. Build a site for yourself, your business, or for others"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-01-02T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-01-05T00:00:00.000Z"},"promotions":{"discountPrice":367040,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["622c1fa5a2de424e23bbe971","625e7a54fb82b80788574146"],"topics":[],"reviews":[],"meta":{"ratingCount":463,"studentCount":4714,"avgRatingScore":4.1904354,"contentVideoLength":33782},"basicInfo":{"udemyCourseId":3330728,"slug":"the-complete-no-code-developer-course-build-23-projects","title":"The Complete 'No Code' Developer Course: Build 23 Projects","subtitle":"Learn How To Build A Range Of Products Without Writing Code! Learn How To Use: Webflow, Zapier, Figma, Parabola & More.","image":"https://img-b.udemycdn.com/course/240x135/3330728_0753_5.jpg","price":2752570,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["How To Scrape Data From Websites - With No Code","How To Work With APIs - With No Code","How To Build Automations - With No Code","How To Create Bots - With No Code","How To Analyze Big Data - With No Code","How To Develop Voice Apps For Amazon's Alexa - With No Code","How To Build One Page Websites - With No Code","How To Develop Mobile Apps - With No Code","How To Build Membership Websites - With No Code","How To Build 3D Games - With No Code","How To Monetise Your No-Code Skills"],"requirements":["Just A Willingness To Learn Through Practical Assignments."],"description":"<p>Good job on landing here, on this no-code development course!<br><br>You can check out the full curriculum below :)<br><br>I think you're going to like this course; because in the development space, there is a steep learning curve. Many of us don't need to waste our time with that.<br><br>I'm not one to make you sit through theoretical lectures.<br><br><strong>I'm a no-code developer who is good at helping people to learn by building...<br><br></strong>So much so, I created this no-code development course.<br><br>As the creator of this course (and Command Codeless), I've built numerous products far more cost-effectively and quicker than it would take someone to 'code' them.<br><br>Now the chances are...<br><br>You've tried software development, but you're not happy with your progress.<br><br>To put it simply, you're not following the path of least resistance!<br><br>You don't need to join this course, but if you're like many others, <strong>there's a strong chance you want to be able to build products without a technical partner</strong>.<br><br>I promise that if you take the time, you'll walk away from this course understanding how to build websites, mobile apps and software quicker than it would take you to learn how to code. You will grasp many of the programming concepts faster via this no-code course.<br><br>Instead of theory, <strong>you'll learn practical skills as we work through projects</strong>, such as:<br><br><strong>✔</strong> Scraping Websites<br><br><strong>✔</strong> Working With APIs<br><br><strong>✔</strong> Building Voice Apps For Alexa<br><br><strong>✔</strong> Creating One-Page Websites<br><br><strong>✔</strong> Developing Mobile Apps<br><br>And, more.<br><br>This course would have saved me a lot of; confusion, money (<em>I spent $5,000+ on a coding bootcamp - don't do the same</em>) and wasted hours while on my journey of learning development.<br><br><strong>Go from zero to building up a portfolio of products</strong>, and gain lifetime access to the lectures, and worksheets this course has to offer you.<br><br>For a small investment, you can re-ignite your passion for building and be sure never to waste your time again. <strong>And if you don't love the course, take advantage of Udemy's refund policy</strong>.<br><br><strong>It's time to decide</strong>; are going to continue struggling with building products, or are you going to dive in with zero risks, and all to gain by learning a new skill?</p>","suitableLearners":["Hobbyists Who Want To Build Passion Projects By Themselves","Entrepreneurs Who Want To Launch A Start-Up Without A Technical Co-Founder","Freelancers Who Want To Learn An Emerging Skill To Maximise Their Earnings"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-01-25T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-01-28T00:00:00.000Z"},"promotions":{"discountPrice":412920,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["622c1fa5a2de424e23bbe971","625e7a54fb82b80788574146"],"topics":[],"reviews":[],"meta":{"ratingCount":451,"studentCount":2308,"avgRatingScore":4.6384015,"contentVideoLength":56740},"basicInfo":{"udemyCourseId":3686390,"slug":"the-complete-guide-to-bubble-visual-programming","title":"The Complete Guide to Bubble Visual Programming","subtitle":"Learn how to build sophisticated web applications like AirBnB Yelp Twitter with no code using Bubble Visual Programming","image":"https://img-c.udemycdn.com/course/240x135/3686390_a590_2.jpg","price":1949670,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["Bubble Visual Programming ecosystem to create websites and web applications using a No-Code platform","Build functional and professional grade web applications, websites, and apps","All elements of Bubble, including responsive design, databases, workflows, users, and much more","Build a fully functional project and task management web application with a complete walkthrough","Build a thin version of AirBnB, complete with Google Maps integration and user-to-user messaging","Responsive web design that adapts to the user's screen and looks beautiful","Database management system that easily stores, organizes, and shows all your data","Workflow management system that allows complex interaction between the front-end and back-end, similar to what many other web applications like Twitter and Yelp do","How to go from having an idea to building a fully functional MVP, with many examples in between","Interacting with the Bubble community to continue learning and building your skillset"],"requirements":["No Bubble or web development experienced is required"],"description":"<p><strong>Build amazing professional web applications like Twitter, Asana, Todoist, AirBnB, Trip Advisor, Yelp and launch your startup, SaaS, or any web product in days instead of months with no code using the Bubble ecosystem</strong></p><p><br></p><p><strong>Learn from over 16 hours worth of relevant instructional video content on Bubble</strong> to become an expert and start building today! No coding required!</p><p><br></p><p>Are you an entrepreneur who wants to build the next big thing without a full-time developer? Do you want to quickly create an MVP for your startup idea, or quickly build your side hustle? Then <strong>harness the power of No-Code web application development using Bubble.</strong></p><p><br></p><p><strong>Bubble is rated as the #1 No-Code Tool of 2020.</strong> Apps built on Bubble have raised more than $1B dollars (see: Plato, Dividend Finance, Plato, all of which were made using Bubble). With Bubble, you can create everything from sophisticated marketplaces like AirBnb, to SaaS like Trello, to simple landing pages. This is No-Code development at its finest!</p><p><br></p><p>People use Bubble to quickly create professional web applications.<strong> In fact, one student used Bubble to launched their application in only 3 days, and then subsequently sold it to USA Today (see: GiveLocal).</strong></p><p><br></p><p><strong>This course is the only comprehensive guide you'll ever need to Bubble.</strong> It covers everything from Beginner topics like pages, inputs, and elements to more advanced topics like plugin implementation, messaging, and data manipulation. The course also takes you step-by-step and assumes you have no experience at all with building web applications or with Bubble.</p><p><br></p><p>The course is designed so you become an expert at Bubble.<strong> We first learn all the building blocks required, and then create our own functional Bubble applications from complete scratch.</strong> We also continuously update the course!</p><p><br></p><p>If you're looking for something that will teach you how to create professional grade web applications using no-code from beginner to advanced, then this is the course for you!</p><p><br></p><p><br></p><p><strong>What is Bubble?</strong></p><p><strong>Bubble is a no-code platform that allows you to build sophisticated and professional-grade web applications.</strong> It's the best way to develop your application in days, not months. It contains responsive web design, element manipulation, database functionality, workflow management, and a whole host of community-built plugins and third-party APIs that can enhance your application like Stripe, Plaid, and more! <strong>Bubble has been rated as the #1 No-Code platform of 2020.</strong></p><p><br></p><p><strong>What are the main features of Bubble? / Why should I learn Bubble?</strong></p><ul><li><p><strong>No-Code platform:</strong> Bubble uses a drag-and-drop and logic gates system instead of complicated code, but is still powerful and comprehensive to run AirBnB or even Facebook; it's the next evolution of web development.</p></li><li><p><strong>Build it quickly:</strong> Since Bubble is a No-Code platform, you can make your application in days and not months</p></li><li><p><strong>Total freedom:</strong> Bubble allows you total 100% freedom with your website - modify, add, delete, and change anything and everything about your web application</p></li><li><p><strong>Sophisticated / comprehensive:</strong> Bubble comes with a robust scalable database management system, and workflow integration that allows you to create virtually any application - it also contains Responsive Design and so is lightning fast!</p></li><li><p><strong>Collaboration:</strong> Bubble comes with its own version control system, that lets you manage changes and lets you collaborate with up to 40 other individuals</p></li><li><p><strong>Community of plugins:</strong> Plugins that are developed by the Bubble community extend your application by allowing third-party elements, like payment, SEO, analytics, and more! You can even integrate with your own REST API.</p></li></ul><p><br></p><p><strong>Why take this course?</strong></p><ul><li><p><strong>Comprehensive guide:</strong> This is the only 100% start to finish, zero to hero, basic to advanced guide on Bubble. This course assumes you have zero experience with Bubble and develops you to a Bubble power user!</p></li><li><p><strong>Instructional with examples:</strong> The course is structured in a way to maximize your learning. We first go through learning \"Building Blocks\" where we develop our Bubble toolkit. We then apply the toolkit to future modules through app development from complete scratch.</p></li><li><p><strong>Great resources:</strong> There are hours of content and resources in this course. There is more than 16 hours of video content available. You also have lifetime access to not only the videos, but to me as well through the Q&amp;A feature</p></li></ul><p><br></p><p><strong>Course and Module Overview</strong></p><ol><li><p><strong>Introduction to Bubble: </strong>In this section, you will learn everything about Bubble! What it is, when to use it, what it can and cannot do, and we will go through the course overview</p></li><li><p><strong>BB - Environment Setup:</strong> In this section, you will set up your Bubble environment, which means creating a free Bubble account and entering the Bubble environment</p></li><li><p><strong>BB - Editor:</strong> In this section, you will learn about the Bubble editor</p></li><li><p><strong>BB - Pages and Elements:</strong> In this section, you will learn how to set up your Bubble pages and how to add Bubble elements to your pages</p></li><li><p><strong>BB - Responsive Design:</strong> In this section, you will learn about the responsive design features that are available with Bubble</p></li><li><p><strong>BB - Data:</strong> In this section, you will learn how Bubble manages its data environment</p></li><li><p><strong>BB - Workflows:</strong> In this section, you will learn about Bubble workflows and how they can be used to enhance your Bubble application</p></li><li><p><strong>BB - Design with Data:</strong> In this section, you will learn how to make web pages by mixing design principles with data and workflows, including repeating groups</p></li><li><p><strong>BB - Users:</strong> In this section, you will learn about Bubble's default and powerful user management system</p></li><li><p><strong>BB - Settings and Publishing:</strong> In this section, you will change your Bubble settings, and how to publish your web application</p></li><li><p><strong>BB - Advanced Features and Plugins:</strong> In this section, you will learn about some of the advanced features with Bubble like plugins</p></li><li><p><strong>App - ProjectIO:</strong> In this section, we will build a project and task management application from scratch</p></li><li><p><strong>App - BubbleBnB:</strong> In this section, we will build a very thin version of AirBnB, complete with Google Maps integration, messaging, and more, and all from scratch</p></li><li><p><strong>Conclusion:</strong> In this section, we'll wrap everything up and talk about next steps</p></li></ol><p><br></p><p>We're looking forward to having you in the course and hope you earn the certificate. Please let me to know if you have any questions!</p><p><br></p><p>Music: bensound</p>","suitableLearners":["Entrepreneurs who want to build sophisticated web applications and websites quickly and without code","Students who want to learn a revolutionary new way to create web applications","Individuals who want to create and launch an MVP","Individuals who do not know how to code and want to focus on function over form","People who want to create any SaaS product","Entrepreneurs who want to create an online MVP to secure funding","Anybody who wants to turn a startup idea into reality","Beginner, intermediate, and advanced users of Bubble"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-01-21T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-01-24T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["622c1fa5a2de424e23bbe971","625e7a54fb82b80788574146"],"topics":[],"reviews":[],"meta":{"ratingCount":396,"studentCount":2346,"avgRatingScore":4.5310597,"contentVideoLength":3979},"basicInfo":{"udemyCourseId":1475836,"slug":"master-wix-create-a-wix-website-in-1-hour","title":"Master Wix - Create a Wix Website in 1 hour","subtitle":"Wix for Beginners: Create Responsive Wix Websites. No Coding or Wix Experience Required!","image":"https://img-c.udemycdn.com/course/240x135/1475836_b37f_2.jpg","price":687970,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["Create Responsive Wix Websites","Master Wix Website Builder","Learn Wix Website Customization","Start Wix Freelancing Career"],"requirements":["No Coding or Wix Experience Required","Basic Computer Skills"],"description":"<p>In this course, I will be providing you with a step by step guide on how to create a Wix website in 1 hour with absolutely zero coding or Wix experience required! </p>\n\n<p><strong>Who is this course for?</strong></p>\n\n\n\n<p>This Wix website course is aimed at anyone who wants to create a powerful yet elegant Wix website on their own. I cover everything, so even if you've never used Wix in your life, you will be able to quickly jump in.</p>\n\n\n\n<p><strong>We will learn how to</strong></p>\n\n\n\n<ol><li>Setup a FREE Wix Account</li><li>Install a FREE Wix Template</li><li>Customize our Wix Template</li><li>Learn Wix SEO</li><li>Create Wix Blog</li><li>Setup Pages on our Wix Website</li><li>Install Wix Apps</li><li>Setup Custom Domain Name</li><li>Create Social Logins</li><li>Select Wix Premium Plan</li></ol>\n\n\n\n<p>And more…\n</p>\n\n\n\n<p>Why you will love this Wix website course!</p>\n\n\n\n<p><strong>TIME-SAVING</strong></p>\n\n\n\n<p>I made this Wix website course with speed &amp; simplicity in mind. I will show you how to create a Wix website in <strong>within 1 hour!</strong></p>\n\n\n\n<p><strong>AMAZING SAVINGS</strong></p>\n\n\n\n<p>Websites can be expensive, but with this Wix course and a little creativity you can build any Wix website for very little money.</p>\n\n\n\n<p><strong>FOR BEGINNERS</strong></p>\n\n\n\n<p>This Wix website course is completely beginner-friendly. You don’t need to know anything about Wix, coding or programming (but make sure you have basic computer skills).</p>\n\n\n\n<p><strong>FREE WIX SUPPORT</strong></p>\n\n\n\n<p>I am here to help you with any Wix website problems you may come across. Post your questions &amp; I will respond to your Wix queries ASAP.</p>\n\n\n\n<p><strong>FLEXIBILITY</strong></p>\n\n\n\n<p>This course teaches you how to make <strong>ANY </strong>Wix website. You are not restricted to a specific style. You are free to create anything you want using the tools used in this Wix website course. </p>\n\n\n\n<p>I look forward to seeing you in this Wix website course!</p>\n\n\n\n<p>Cheers,</p>\n\n\n\n<p>Divit</p>","suitableLearners":["Anyone who wants to create a Wix website, and possibly start their own business."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2018-01-05T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2018-01-08T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["622c1fa5a2de424e23bbe971","625e7a54fb82b80788574146"],"topics":[],"reviews":[],"meta":{"ratingCount":395,"studentCount":4735,"avgRatingScore":3.7157228,"contentVideoLength":15558},"basicInfo":{"udemyCourseId":912996,"slug":"the-bubble-course-create-complete-web-apps-without-coding","title":"The Bubble Course - Create Complete Web Apps without Coding","subtitle":"Create Complete Web Apps without Coding using the Bubble Framework","image":"https://img-c.udemycdn.com/course/240x135/912996_7b2e_5.jpg","price":687970,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["Use Bubble to Create Web Applications","Use Bubble to create awesome web UI","Use Bubble to create backend data models"],"requirements":["Students should have a basic understanding of web pages and elements"],"description":"<p><strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">\"It is EXACTLY what I dreamed about when I saw this course: everything from scratch, very clear and at the right pace. Both thumbs up!\"  - student</em></strong></p>\n\n\n\n<p><em><strong>\"Clear and concise while showing real life solutions not dummy scenarios.\" - a different student</strong></em></p>\n\n\n\n<p>This course is all about using Bubble to visually create Web Applications.  We jump right in by signing up for Bubble and creating our first app.  The first app is a Contact Management simple application.  This course is growing and I will continue to add to it. </p>","suitableLearners":["Users who want to know how to visually program should take this course","This course is meant to serve new users of Bubble","Programmers who want to code should not take this course"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2016-12-09T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2016-12-12T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["622c1fa5a2de424e23bbe971","625e7a54fb82b80788574146"],"topics":[],"reviews":[],"meta":{"ratingCount":393,"studentCount":39108,"avgRatingScore":4.1771317,"contentVideoLength":20073},"basicInfo":{"udemyCourseId":3624338,"slug":"wordpress-for-beginners-2022","title":"WordPress for Beginners [2022]","subtitle":"Build a professional WordPress Website step by step. No Experience Required!","image":"https://img-b.udemycdn.com/course/240x135/3624338_cf1f.jpg","price":458570,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["How to Build a corporate/introductory WordPress Website","How to create menus in WordPress","How to build a Blog Website using WordPress","How to design custom design WordPress Pages","How to optimize a WordPress Website for mobile devices","How to optimize a WordPress Website for tablet devices","How to migrate website between different hosts"],"requirements":["A computer/laptop with Windows/Mac/Linux OS","Chrome Web Browser","Internet Access","No Experience Needed. You will learn everything you need to know"],"description":"<p><strong>You're here because you want to master WordPress, right?</strong></p><p>This <strong>WordPress</strong> Course was created for you!</p><p><strong>Take this course if either of these applies to you:</strong></p><ol><li><p>You own a business and need more clients OR</p></li><li><p>Your Idea involves making a website OR</p></li><li><p>You want to learn <strong>WordPress</strong></p></li></ol><p>75 million users use <strong>WordPress</strong> making it Number One website content management system (CMS) worldwide. This course explains the most basic features of <strong>WordPress</strong>. By the end of this <strong>WordPress</strong> online training, you will have enough knowledge to create a Professional <strong>WordPress</strong> website of your own, and not only that but you can create websites for your clients.</p><p>WordPress is the perfect tool for creating a fully customized website for any purpose. Whether you want to create a blog, a personal portfolio, a corporate business site, a forum, a classified website, an eCommerce site, or a business website to sell your products and services, you can do it with WordPress.</p><p>While it's <strong>never been easier</strong> to build a website, many people get lost when it comes to creating a <strong>stylish WordPress website</strong>. By following this Complete WordPress course, you will <strong>build powerful WordPress websites with different plugins and get ahead on your journey as an entrepreneur.</strong></p><p><br></p><p><strong>Why am I Worth Your Time?</strong></p><p>Through this course, I'll teach you everything I've learned and mastered through 10 years of building, managing, migrating, and hosting WordPress websites.</p><p><strong>I'll walk you through every step in how to use WordPress through a series of videos</strong>. I've also included useful resource documents for you to reference.</p><p>~I know where you're at.</p><p>~I know where you're coming from.</p>","suitableLearners":["Business owners who want to build their own website","Students who want to start their career with WordPress Web Design"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-01-01T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-01-04T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["622c1fa5a2de424e23bbe971","625e7a54fb82b80788574146"],"topics":[],"reviews":[],"meta":{"ratingCount":205,"studentCount":1332,"avgRatingScore":4.6129193,"contentVideoLength":13595},"basicInfo":{"udemyCourseId":3596860,"slug":"power-apps-learn-powerapps-with-a-hands-on-example","title":"Power Apps: learn PowerApps with a hands-on example","subtitle":"Want to learn Power Apps? Learn Microsoft PowerApps by creating this low code app yourself!","image":"https://img-c.udemycdn.com/course/240x135/3596860_0f0f_10.jpg","price":917370,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["Understand how the Low Code development platform Microsoft Power Apps works","Create real and functioning apps that can run on Android, iOS and internet browsers","Create a new Microsoft Power Apps account and connect to a datasource","Learn while developing practical applications with PowerApps"],"requirements":["Personal computer","Internet access","Be willing to learn PowerApps"],"description":"<p>What about creating an app without complex code? What about without coding at all??</p><p><br></p><p>Welcome to the Low Code universe, let's explore the Microsoft Power Apps world!!</p><p><br></p><p>Microsoft PowerApps let you create <strong>mobile-friendly applications</strong> based on your data where you can easily add, edit, and delete data from your data source.</p><p>This course aims to help you start developing applications with Power Apps, understanding the concepts behind, and bringing <strong>practical examples</strong> to be followed, helping you in your studies.</p><p><br></p><p>In this course, we are going to build an Inventory Management<strong> app from scratch </strong>with the Low Code platform, Microsoft Power Apps.</p><p><br></p><p>DON'T STAY BACK!</p><p><br></p><p>Learn how to make <strong>multiplatform applications</strong> <strong>quickly and easily </strong>with Microsoft Power Apps.</p><p><br></p><p>Without theoretical classes, learn to use resources while developing applications<strong> IN PRACTICE</strong>: Let's get our hands dirty!</p><p><br></p><p>INCREASE YOUR EMPLOYABILITY</p><p><br></p><p>The <strong>demand </strong>for applications using Microsoft Power Apps is growing and a <strong>trend for the future</strong>, since every business has some activity that can be digitized: data logging, spreadsheets, day-to-day tasks, etc.</p><p><br></p><p>Building Low-Code applications encompasses many skills that are already and will be increasingly essential in the era of <strong>Industry 4.0</strong>!</p><p><br></p><p>HELP YOUR BUSINESS</p><p><br></p><p>Build applications with high potential for impact on your business that will <strong>save you time and money</strong>.</p><p><br></p><p>This course will be a complete guide for you to develop practical solutions and reap benefits quickly. ]</p><p><strong>You will learn the concepts as well as their applications!</strong></p><p><br></p><p>HAVE THIS MATERIAL ALWAYS AVAILABLE</p><p><br></p><p>This course will help you now and in the future, serving as a reference where you can review concepts and learn new things!</p><p><br></p><p>See you on the course!</p><p><br></p><p>Rudimar.</p><p><br></p><p>Keywords: powreapps, powerapp, power app, power apps, microsoft powerapps, microsoft power apps, powerapps tutorial, power apps from scrath, build an app, low code, no code, power platform, excel</p>","suitableLearners":["Beginners in Low-code development: PowerApps","People with an interest in innovation and who want to improve processes within their company","Interested in evolving professionally, learning a new skill"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-12-18T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-12-21T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["622c1fa5a2de424e23bbe971","625e7a54fb82b80788574146"],"topics":[],"reviews":[],"meta":{"ratingCount":178,"studentCount":15519,"avgRatingScore":3.7182364,"contentVideoLength":9857},"basicInfo":{"udemyCourseId":2099870,"slug":"liferay-for-beginners-create-your-website-without-coding","title":"Liferay for Beginners Create Your Website Without Coding","subtitle":"Crash Course - Learn to create your first Website Without the need to Code Anything","image":"https://img-c.udemycdn.com/course/240x135/2099870_5406.jpg","price":1949670,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["Creating Your Website In Liferay with Zero Coding","Liferay Overview and Features","Liferay Installation and Prerequisite setup on Windows or Linux","Understanding Liferay Folders/Structures/Logs and Housekeeping","Liferay Web User Interface Navigation","Understanding Liferay Portlet, Panels and Themes","Liferay Web Pages Creation","Understanding Different Types of Web Pages in Liferay","Content Creation and Management in Liferay","Creating and Managing Blogs in Liferay","Creating and Managing Forums in Liferay","Creating Polls in Liferay","Creating and Managing Forms in Liferay","Users and Groups Creation and Management in Liferay"],"requirements":["This course is for Absolute Beginners"],"description":"<p>This course is for absolute beginners of Liferay. In this course you will be learning below items:</p><ul><li><p>Creating your Webiste without the need to code anything</p></li><li><p>Liferay Overview</p></li><li><p>Liferay Features</p></li><li><p>Understanding Liferay Architecture</p></li><li><p>Understanding Web Server (Tomcat)</p></li><li><p>Prerequisites</p></li><li><p>Liferay Installation on Windows</p></li><li><p>Liferay Installation on Linux</p></li><li><p>Understanding Liferay Folder Structure</p></li><li><p>Understanding Logs</p></li><li><p>Understanding Housekeeping</p></li><li><p>Understanding The Critical Folders</p></li><li><p>Introduce Portlet</p></li><li><p>Creating a Web Page in Liferay</p></li><li><p>Understanding Liferay CMS</p></li><li><p>Understanding Liferay Content Creation and Management Basics</p></li><li><p>Liferay Menu Bar Creation and Management</p></li><li><p>Liferay Blogs</p></li><li><p>Creating Polls in Liferay</p></li><li><p>Liferay Forums</p></li><li><p>Liferay Users and Group Management</p></li></ul>","suitableLearners":["Anyone who is willing to Learn and Create Their First Website"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2020-09-10T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2020-09-13T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["622c1fa5a2de424e23bbe971","625e7a54fb82b80788574146"],"topics":[],"reviews":[],"meta":{"ratingCount":170,"studentCount":693,"avgRatingScore":4.79842,"contentVideoLength":0},"basicInfo":{"udemyCourseId":4318068,"slug":"servicenow-it-service-management-cis-itsm-tests-rome-2022","title":"ServiceNow IT Service Management (CIS-ITSM) Tests: Rome 2022","subtitle":"Practice for the ServiceNow Certified Implementation Specialist - IT Service Management (CIS-ITSM) exam: Latest Release!","image":"https://img-c.udemycdn.com/course/240x135/4318068_e4ea.jpg","price":1949670,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["Gain the skills and essential knowledge to contribute to the configuration, implementation, and maintenance of the ServiceNow ITSM applications","Access the most comprehensive set of practice questions with detailed explained answers, all built in the latest ServiceNow release","Learn the new, updated and changed features and functionality with the introduction of each ServiceNow release","Get familiar with the exam format and structure, and practice your knowledge in a similar simulated exam environment"],"requirements":["Prerequisite: Completion of the 'IT Service Management (ITSM) Implementation' course","Recommended study: Product documentation and release notes for IT Service Management","Recommended experience: 6+ months ServiceNow implementation and general platform experience","Recommended knowledge: General familiarity with general industry terminology, acronyms, and initialisms"],"description":"<p><strong>Exam Purpose </strong></p><p>Prepare for the ServiceNow Certified Implementation Specialist exam in IT Service Management (CIS-ITSM) with the most comprehensive set of practice questions with detailed explained answers, all built in the latest ServiceNow release!</p><p>The CIS-ITSM exam certifies that you have the skills and essential knowledge to contribute to the configuration, implementation, and maintenance of ServiceNow ITSM applications.</p><p><strong>Exam Preparation </strong></p><p>Exam questions are based on official ServiceNow training materials, the ServiceNow documentation site, and the ServiceNow developer site. It should not be considered the official study or exam materials and should only be used to practice for the actual mainline exam.</p><p><strong>Exam Scope</strong></p><ol><li><p>Incident Management (<strong>25%</strong>)</p></li><li><p>Problem Management (<strong>15%</strong>)</p></li><li><p>Change and Release Management (<strong>25%</strong>)</p></li><li><p>Knowledge Management (<strong>5%</strong>)</p></li><li><p>Request Fulfillment (<strong>25%</strong>)</p></li><li><p>Configuration Management Database (<strong>5%</strong>)</p></li></ol><p>It is recommended to know the following for each ITSM application:</p><p><em>Baseline Application Functionality</em></p><ul><li><p>Basic and advanced features in baseline installation of the current release</p></li><li><p>Functionality and features added or changed in the current release</p></li><li><p>State model and default process flow</p></li><li><p>Basic and advanced operations performed by users and the system</p></li></ul><p><em>Architecture and Security</em></p><ul><li><p>Key tables used in the application</p></li><li><p>Relationships among application tables</p></li><li><p>Roles and default Access Controls</p></li><li><p>Primary application components (Script Includes, Business Rules, etc.)</p></li><li><p>Integration capabilities</p></li></ul><p><em>Business Cases / Use Cases</em></p><ul><li><p>Value proposition</p></li><li><p>Key Performance Indicators and Benchmarks</p></li><li><p>Selection of appropriate features and functions to meet business requirements</p></li></ul><p><em>Proven Practices for Implementation</em></p><ul><li><p>Implementation approaches to meet requirements that preserve upgradability, scalability, and maintainability</p></li><li><p>Implementation solutions that work in conjunction with baseline application functionality</p></li></ul><p><strong>Exam Structure</strong></p><p>The exam consists of approximately (60) questions. For each question on the examination, there are multiple possible responses. You should review the response options and select the most correct answer to the question. </p><ul><li><p><em>Multiple Choice (single answer)</em></p><p>For each multiple-choice question on the exam, there are at least four possible responses. You should review the response options and select the one response most accurately answers the question. </p></li></ul><ul><li><p><em>Multiple Select (select all that apply)</em></p><p>For each multiple-select question on the exam, there are at least four possible responses. The question will state how many responses should be selected. You should review the response options and select ALL responses that accurately answer the question. Multiple-select questions have two or more correct responses.</p></li></ul>","suitableLearners":["New users of ServiceNow IT Service Management","ServiceNow administrators, IT admins, and ITSM implementers","ServiceNow customers, partners and employees","Everyone interested in becoming a ServiceNow ITSM Certified Implementation Specialist"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-03-04T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-03-07T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}}]