[{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7feb9c9b04f3f624d6b5"],"topics":[],"reviews":[],"meta":{"ratingCount":3235,"studentCount":9862,"avgRatingScore":4.1443024,"contentVideoLength":4601},"basicInfo":{"udemyCourseId":564552,"slug":"operations-and-supply-chain-management","title":"Operations and Supply Chain Management","subtitle":"Master Supply Chain Management in Manufacturing and Service Organizations","image":"https://img-c.udemycdn.com/course/240x135/564552_d365_3.jpg","price":2179070,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["sequence the components of the supply chain and identify the key drivers of supply chain management","identify the characteristics of supply chain management in service organizations","match supply chain strategies of service organizations with their key characteristics","identify criteria for selecting and combining different supply chain strategies and match supply chain areas with key indicators of their performance"],"requirements":["No special requirements. General knowledge about operations management will help."],"description":"<p>The <strong>Operations and Supply Chain Management</strong> is part of the larger series of short courses on Operations Management. The first one was Product and Service Management, but this is a modular series, so that you can easily learn various aspect of Operations Management.</p><p>The supply chain is a network of operations running across an organization, which are needed to design, make, deliver, and service products or services for customers. Production, inventory, location, transportation, and information are performance drivers that can be managed to produce the capabilities for a given supply chain.</p><p>As a part of their overall strategy, organizations also employ many supply chain strategies to survive and compete in a dynamic and competitive marketplace. However, it is also essential from an organization's point of view to use effective performance measures to ensure continuous improvement of the supply chain and also to set directions of its current supply chain strategies.</p><p>After completing this course, <strong>you will be able to:</strong></p><ul><li>sequence the components of the supply chain,</li><li>identify the key drivers of supply chain management,</li><li>identify the characteristics of supply chain management in service organizations,</li><li>match supply chain strategies of service organizations with their key characteristics,</li><li>identify criteria for selecting and combining different supply chain strategies, and</li><li>match supply chain areas with key indicators of their performance.</li></ul><p>You will have not much more than 2 hours of video lessons, written documents, quizzes, examples and exercises, and a small course project.</p><p>This course provides a basic understanding of supply chain management in manufacturing and service organizations. Key characteristics of common supply chain strategies and criteria for their selection are also presented. This course also introduces key performance metrics for supply chain management.</p><p>Anyone working in operations management or another functional area, who is looking to gain a working understanding of the operations functions in a service or manufacturing organization will benefit from this course.</p><p>You have 30 days money back guarantee! No questions asked. Now, go ahead, and press that \"Take the Course\" button! Or, take the free preview and decide later!</p>","suitableLearners":["Anyone working in operations management or another functional area, who is looking to gain a working understanding of the operations functions in a service or manufacturing organization"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-01-07T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-01-10T00:00:00.000Z"},"promotions":{"discountPrice":321160,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7feb9c9b04f3f624d6b5"],"topics":[],"reviews":[],"meta":{"ratingCount":3207,"studentCount":17102,"avgRatingScore":4.4052925,"contentVideoLength":108854},"basicInfo":{"udemyCourseId":936952,"slug":"logistics-and-supply-chains-fundamentalsdesignoperations","title":"Logistics and Supply Chains - Fundamentals,Design,Operations","subtitle":"Tactics, Tools, and Techniques for Moving Your End-to-End Global Supply Chain into the 21st Century","image":"https://img-c.udemycdn.com/course/240x135/936952_aa4c_3.jpg","price":1949670,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["You’ll have a thorough understanding of the role played by the logistics and supply chain function, particularly in terms of its key activities and ultimate aim","You’ll learn how to develop, plan, and implement logistics and supply chain strategies that address capacity, external integration, and global operations","You’ll understand the factors involved in facilities location decisions, including costing and scoring models","You’ll be able to use tactical methodologies like MRP and JIT for capacity planning and supply chain control","You’ll discover the best ways to improve purchasing, procurement, and transportation functions by learning how to choose suppliers and cost modes of transport","You’ll understand the significance of the roles played by warehouse activities, equipment, and layout and operations","You’ll know how to manage, calculate, and control inventory costs, economical order quantities, lead times, periodic review systems","You’ll discover how to effectively measure and analyse your supply chain performance and operations in order to improve logistics and increase market resiliency","You’ll understand best practices for managing returns and achieving social, economic, and environmental responsibility","You’ll learn all the essential lean tools and techniques you need to improve your business process, achieve customer delight, and realise operational excellence"],"requirements":["Basic knowledge of logistics and supply chain operations and terminology."],"description":"<p>In today’s competitive marketplace, companies are under constant pressure to perform in a business environment of reduced capital, slowing growth rates, and increased shareholder demands. Now more than ever, it’s important that your organisation learns to maximise the power of its working capital by cutting costs and reducing the expenses associated with its <strong><em>Supply Chain Operations</em></strong>.</p><p>Every organisation, whether it manufactures goods or provides services, needs a reliable flow of materials. <strong><em>Global logistics operations</em></strong> play an essential role in the commercial supply chain function, and are responsible for all aspects of material movement. In fact, wise business owners and managers are quickly realising that, rather than being an isolated operation, their supply chain occupies a unique position in linking external suppliers with customers. If you want your organisation to benefit from a more competitive position, it’s crucial that you take steps to develop and implement an effective <strong><em>logistics strategy</em></strong> as part of your <strong><em>supply chain integration</em></strong>.&nbsp; &nbsp;</p><p>Logistics and Supply Chain Management is a particularly fast-moving field whose ultimate goal is to delight and satisfy the customer. The methods and management strategies your business adopts for everything from <strong><em>procurement</em></strong> of goods to control of <strong><em>inventory</em></strong> will have a profound impact on costs, customer service, and your company’s overall profitability.&nbsp; &nbsp; </p><p>No business works in isolation, and recent developments in how companies operate in terms of integrating fresh technologies, exploiting global markets, and serving and communicating with customers are making new demands on <strong><em>planning and controlling the flow of materials</em></strong>. This course has been designed to give business owners and managers a current view of supply chain management, and an introduction to the best methods for responding to modern demands through improvements in areas like <strong><em>capacity</em></strong>, <strong><em>warehouse</em></strong>, and <strong><em>transportation</em></strong> strategies.&nbsp;&nbsp; &nbsp; </p><p>This course will teach you everything you need to know to successfully manage the end-to-end, forward and backward flow of materials and information across your supply chain. Together, we’ll examine the concepts, tactics, and applications of various logistics tools and technologies in order to promote a big-picture understanding that extends well beyond internal operations.&nbsp; &nbsp;</p><p>By the end of this course, you’ll have a valuable and practical skill set that will allow you to create, implement, and oversee the activities of a global supply chain involving suppliers, distributors, and customers world-wide. You’ll know how to consistently adhere to best practices, and you’ll understand the common terminology that’s used in corporate communications. By showing you how to modernise your approach to supply chain management, this course will make it possible to improve your position in the marketplace through the efficient flow of goods and materials from the supplier, to your business, to the customer – and back again.</p>","suitableLearners":["This course is designed for beginners and intermediate students/professionals in logistics, supply chain and operations management who want to improve and broaden their scope of knowledge on the subject.","This course is designed for more seasoned professionals looking for a quick refresher and test their knowledge and application of logistics and supply chain management."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-11-30T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-12-03T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7feb9c9b04f3f624d6b5"],"topics":[],"reviews":[],"meta":{"ratingCount":2442,"studentCount":8450,"avgRatingScore":4.5966463,"contentVideoLength":5899},"basicInfo":{"udemyCourseId":1410180,"slug":"the-practical-bpmn-20-master-class","title":"The Practical BPMN 2.0 Master Class","subtitle":"Learn to craft expressive BPMN flow charts through dozens of real-world business cases and exercises!","image":"https://img-b.udemycdn.com/course/240x135/1410180_489f_5.jpg","price":1146770,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["Create your own, clean and expressive BPMN models","Add business process management to you business analytics skill set","Fully comprehend the principles of BPMN 2.0 through learning by doing","Gain precious insights from real business use cases","Learn how to use a free, light weight BPMN modeler"],"requirements":["No pre-knowledge required","No tools required, we will use an easy to use light weight BPMN web modeler"],"description":"<p>This course will get you from zero to hero in BPMN 2.0. I will teach you how to apply all the fundamental BPMN elements with the help of processes from exiting business use cases. </p>\n\n<p><strong>We will take a look at:<br></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li><p>An industrial production processes of a private space ship manufacturer</p></li><li><p>The compliance procedures of a holiday visa application to an island</p></li><li><p>A digital transformation process in the health &amp; beauty industry.</p></li><li><p>A process of manual tasks applied as work instruction in the retail industry</p></li><li><p>And many more</p></li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Each of these real life scenarios will then be concluded by an exercise that enables you to <strong>try out the freshly learned BPMN elements yourself. </strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong></strong>For this we use Cawemo, a <strong>free, lightweight and very user friendly BPMN web modeler</strong> that also allows you to share your process models.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>In the last section you model completely independently. <strong>You can send me the result to review! I am happy to provide you with personal feedback and advice on your final piece of work!</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Of course, before every exercise and practical, real business use case I will introduce you every new BPMN element through a <strong>brief theory parts.</strong> In these theory parts you will learn about the following BPMN Elements</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Tasks</li><li>Sequence Flows</li><li>Pools &amp; Lanes</li><li>Exclusive Gateway</li><li>Parallel Gateway</li><li>Inclusive Gateway</li><li>Event Based Gateway</li><li>Start and End Event</li><li>Message Event</li><li>Timer Event</li><li>Conditional Event</li><li>Link Event</li><li>Attached Events</li><li>Collapsed Pools </li><li>Sub Processes </li><li>Call Activities </li><li>Data Object </li><li>Data Store </li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>All of these elements will the be applied to a practical real business process. </strong></p>","suitableLearners":["Anyone who wants to learn BPMN 2.0 from scratch","Anyone who wants to refresh his or her knowledge in BPMN 2.0","Anyone who is in touch with business process management","Anyone who wants to pursue a career in business analysis and consulting","Any consultant, business analyst or process owner who wants to optimize processes","Anyone who wants to understand the power of process management"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-03-05T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-03-08T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7feb9c9b04f3f624d6b5"],"topics":[],"reviews":[],"meta":{"ratingCount":2359,"studentCount":7290,"avgRatingScore":4.44549,"contentVideoLength":3251},"basicInfo":{"udemyCourseId":120978,"slug":"customer-success-how-to-exceed-your-customers-expectations","title":"Customer Success | How to Exceed Your Customers Expectations","subtitle":"Create More Real Value Every Day","image":"https://img-c.udemycdn.com/course/240x135/120978_ea9a_8.jpg","price":802670,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["The objective of this course is to help you better understand how to exceed customers expectations by creating more value every day.","Upon course completion, participants will have the knowledge and tools needed to begin to see their current and future customers in an entirely new light."],"requirements":["There are no special requirements for any additional software or other materials for this course."],"description":"<p>In today's hyper competitive market, your company needs a competitive advantage much bigger than just low prices.  That advantage is <em><strong>value</strong></em>.  But value may not be what you've been led to believe it really is.  This course will provide key concepts, frameworks, and case studies to help you meet and exceed the expectations of your customers.</p>\n\n<p>In this course you will learn how:</p>\n\n\n\n\n\n\n\n<ul><li>The Value Universe effects every customer on their journey from expectation to loyalty</li><li>People decide what their real needs are</li><li>Hyundai Motors used customer insight to create an entirely new vehicle</li><li>Jobs to Be Done thinking will revolutionize your company</li><li>Costco delivers extreme value to millions of customers</li><li>Customer Lifetime Value will change the way you evaluate the real value of your customers</li></ul>\n\n\n\n\n\n\n\n<p>  \t  Every student who successfully completes this course will be better prepared to engage in the battle for new customers.  This knowledge will also prepare you for a more successful career.</p>\n\n\n\n\n\n\n\n\n\n<p><br></p>","suitableLearners":["If you work with customers and are interested in the topics of marketing, market research, sales, customer service, and strategy, this course is for you. It will help you have a deeper understanding of today’s changing and more demanding customer."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2017-08-17T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2017-08-20T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7feb9c9b04f3f624d6b5"],"topics":[],"reviews":[],"meta":{"ratingCount":2148,"studentCount":8203,"avgRatingScore":4.299023,"contentVideoLength":9144},"basicInfo":{"udemyCourseId":1288468,"slug":"supply-chain-planning-of-resources-detailed-scheduling","title":"Supply Chain:  Planning of Resources & Detailed Scheduling","subtitle":"Master the essentials of the Manufacturing, Planning and Control Hierarchy and become a recognized Supply Chain Leader","image":"https://img-c.udemycdn.com/course/240x135/1288468_4f1a_4.jpg","price":1605570,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["Manufacturing, Planning and Control (MPC) Hierarchy.","Role of Strategic & Business Planning.","Role of Demand Management.","Sales & Operations Planning (S&OP) and Resource Planning.","Master Scheduling and Rough Cut Capacity Planning (RCCP).","Understanding Load Profiles and dealing with Overload & Underload situations.","Understanding forecasts, forecast horizon and forecast interval.","Review of forecasting techniques.","Types of Inventory, classifications and sub-classifications.","Valuating inventory.","Supplier Relationship Management (SRM).","Types of Buyer relationships.","Supply Chain Best Practices:  Managing Risk, Social Responsibility, Accreditations & Certifications,"],"requirements":["Course:  Supply Chain Fundamentals Understanding the Basics.","A computer with an internet connection.","The willingness to learn."],"description":"<p>If you're looking to take your supply chain skills to the next level, this video course is your starting point.&nbsp; You will learn beyond the basics of supply chain management, gain in depth knowledge to become a Master of Supply Chain.&nbsp; Achieving supply chain excellence is essential for businesses to be successful in today's global economy.&nbsp; Having knowledgeable supply chain professionals are key and with this course you can continue your journey to becoming a sought after Supply Chain professional.</p><p><br></p><p>This course is a continuation of Supply Chain Fundamentals Understanding the Basics.&nbsp; It's not mandatory that you take this course beforehand as it is not a prerequisite but I do recommend it especially if you're new to Supply Chain.&nbsp; There's a lot of terminology and concepts that are covered in the course and it carry's on into this course.&nbsp; &nbsp; &nbsp;</p><p><br></p><p>If your goal is certification, this course covers Master Planning of Resources and Detailed Scheduling and Planning which can assist your exam preparation for ASCM CPIM Part 2.</p><p><br></p><p>You will gain an in depth understanding of the Manufacturing, Planning and Control (MPC) Hierarchy.&nbsp; MPC deals with planning and controlling manufacturing, managing the materials, scheduling the machines, organizing the workers, dealing with your suppliers and coordinating with your customers.&nbsp; Having an effective MPC system is key for any manufacturing company to be successful.</p><p><br></p><p>It's never too late to begin learning and with this course learning has never been so easy.&nbsp; I look forward to seeing you in the classroom.</p>","suitableLearners":["Anyone already in Supply Chain and looking for further knowledge.","Any business professional with a desire to expand their knowledge in Supply Chain.","Senior management and leaders from all business functions seeking to understand Supply Chain."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-12-12T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-12-15T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7feb9c9b04f3f624d6b5"],"topics":[],"reviews":[],"meta":{"ratingCount":2028,"studentCount":8715,"avgRatingScore":4.141674,"contentVideoLength":5179},"basicInfo":{"udemyCourseId":2674440,"slug":"start-improving-customer-service","title":"Start Improving Customer Service","subtitle":"Creating a Customer Service advantage in Your department or business through communication and Customer Management","image":"https://img-b.udemycdn.com/course/240x135/2674440_c0d0.jpg","price":1146770,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["How to Improve Business and Personal Performance through Connecting with and Engaging Customers","How to Turn an Angry Customer into your Best Customer","How to Present your Message with Style and Attention to detail and content","What it takes to Deliver Great Customer service on a Personal level","Build rock solid Working relationships with Colleagues","Communication across a range of Mediums","The Art of Passing work along the Chain that inspires and Motivates people to Do their Best","Putting the measures into Place to Evidence how Customer Satisfaction is the Core of your Business difference"],"requirements":["None"],"description":"<p>Creating a sustainable competitive advantage in your business or department can be a costly exercise if you focus on products or service rather than delivery. </p><p><br></p><p>In this course, Start Improving Customer Service, we take a fundamental look at what makes for good Customer Service, ways to implement a strategy into your team, and how to measure your success. </p><p><br></p><p>In this course you will learn:</p><p><strong>Personal Benefits of Providing great Customer Service</strong></p><p><strong>Communication skills</strong></p><p><strong>Presentation, content, style and purpose of communication</strong></p><p><strong>Complaint Handling</strong></p><p><strong>How to Build Relationships</strong></p><p><strong>Creating great work and great Colleague relations</strong></p><p><strong>Common Causes of Complaints </strong></p><p><strong>Ways and Methods of Measuring your and your teams Successes</strong></p><p><br></p><p>Some of the learning is brought to life through demonstration of the application of the models and there is a range of supporting resources to help you on your journey of growth as a professional interviewer. </p><p><strong>30&nbsp;Day Money Back Guarantee:</strong> Try this course for 30 days risk free. If you don't find the value in it for you, then you get your money back no questions asked. </p><p>Learn this key skill in business and management today and start to build the team around you that will carry your future successes with Customers who promote you every chance they get. </p><p>Good Luck</p><p>Symon</p><p><br></p><p><strong>Who is this course for:</strong></p><p>Front line Managers or Supervisors who are new to customer service or currently feel they lack the skills or confidence. </p><p>Small&nbsp;Business owners looking to grow their business and need a sustainable competitive edge. </p><p>Anyone interested in Customer Service but with limited knowledge on its parameters</p><p><br></p><p><br></p>","suitableLearners":["Section Managers or Supervisors who want to improve their customer service skill","The Sole Trader or Entrepreneur looking to make Customer Service their competitive business advantage"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2019-12-03T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2019-12-06T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7feb9c9b04f3f624d6b5"],"topics":[],"reviews":[],"meta":{"ratingCount":2006,"studentCount":7282,"avgRatingScore":4.5712957,"contentVideoLength":36267},"basicInfo":{"udemyCourseId":2676528,"slug":"root-cause-analysis-and-the-8d-corrective-action-process","title":"Root Cause Analysis and the 8D Corrective Action Process","subtitle":"A Comprehensive Approach to Problem Solving: Analysis, Containment, and Permanent Corrective Action","image":"https://img-c.udemycdn.com/course/240x135/2676528_2e0f.jpg","price":1720270,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["Root Cause Analysis","The 8D Corrective Action Process","Quantitative tools such as Capability Analysis, Control Charts, MSA, Regression Analysis and more","Qualitative tools such as 5 Why, Concentration Diagrams, Cause and Effect Diagrams and more","Corrective action strategies including andon, shifting means, correlating process and product variables, poke yoke and much more","Control charts and their interpretation","Cross-functional team building","Seven basic tools of quality control"],"requirements":["General knowledge of quality and manufacturing is helpful","General knowledge of Microsoft Excel"],"description":"<p><strong>\"Root Cause Analysis and the 8D Corrective Action Process\"</strong> will show you:</p><ul><li><p>How to assemble an effective problem definition.</p></li><li><p>The value of creating an cross-functional team. </p></li><li><p>How to develop interim containment solutions to shield your customer from receiving further defects.</p></li><li><p>The connection between an organization's traceability system and the RCA and 8D process. </p></li><li><p>How to use popular quality tools to find root cause such as pareto analysis, interviewing, the Ishikawa diagram, the concentration diagram, 5 Why analysis and much more.</p></li><li><p>How to use analytical tools such as capability analysis, regression analysis, measurement systems analysis, control charting and more to further clarify your root causes and develop potential corrective actions.</p></li><li><p>A sampling of corrective action strategies such as andon, shifting the process mean, correlating process to product variables, standardizing work instructions, poke yoke, automated inspection and much more.</p></li><li><p>How to verify your corrective activities for effectiveness.</p></li><li><p>How to develop parallel and preventive activities for maximize the impact of your problem solutions.</p></li><li><p>How to acknowledge your team's success.</p></li></ul><p>\"Root Cause Analysis and the 8D Corrective Action Process\" not only relies on the \"tried and true\" methods developed by the quality gurus of old, but also draws upon decades of real life experience by providing dozens of actual examples from manufacturing and engineering.</p><p>If you need to take your problem solving skills and knowledge of quality engineering practices to the next level, <strong>this is the class for you!</strong></p>","suitableLearners":["Quality Engineers","Industrial Engineers","Production Supervisors","Quality Managers","Process Technicians","Manufacturing Managers"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-03-19T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-03-22T00:00:00.000Z"},"promotions":{"discountPrice":298220,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7feb9c9b04f3f624d6b5"],"topics":[],"reviews":[],"meta":{"ratingCount":1994,"studentCount":6445,"avgRatingScore":4.254448,"contentVideoLength":3532},"basicInfo":{"udemyCourseId":120976,"slug":"customer-success-how-to-put-your-customers-first","title":"Customer Success | How to Put Your Customers First","subtitle":"Succeeding in The Age of Me","image":"https://img-c.udemycdn.com/course/240x135/120976_b4c7_7.jpg","price":458570,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["The objective of this course is to help equip you with principles and frameworks to confront the new market reality that customers are in charge.  Upon course completion, you begin to see current and future customers in an entirely new light.  This will help your companies succeed and your career flourish."],"requirements":["There are no special requirements for any additional software or other materials for this course."],"description":"<p>For far too long, companies have put themselves first, ignoring their customers in the process.  They’ve been happy to take people’s money without really considering their points of view. \n\n  </p>\n\n<p>Now, there’s a real sea change taking place: the most successful enterprises are learning how to put their customers first.\n\n  </p>\n\n\n\n<p>This course, How to Put Your Customers First, lays out the key principles every size and type of business needs to embrace.  It starts with understanding that you are living in a “me first” world.  To succeed in it, you must navigate a new path forward to “we.”\n\n  </p>\n\n\n\n<p>In this course, you are going to learn key elements about putting customers first including:\n\n  </p>\n\n\n\n<p>·       The customer roller coaster every business is on\n\n  </p>\n\n\n\n<p>·       What Jeff Bezos, founder of Amazon, really believes about customers\n\n  </p>\n\n\n\n<p>·       The real brand gap between companies and customers\n\n  </p>\n\n\n\n<p>·       Why you must reframe your issues with customers\n\n  </p>\n\n\n\n<p>·       The Upside Down Org chart\n\n  </p>\n\n\n\n<p>·       The Five C’s on the Path to Trust\n\n  </p>\n\n\n\n<p>·       The three questions that form the Customer Experience Triangle\n\n  </p>\n\n\n\n<p>·       The three simple rules to adopt to show customers they are first\n\n  </p>\n\n\n\n<p>·       Why making things simple is a critical strategy\n\n  </p>\n\n\n\n<p>·       Over forty ways to become simple\n\n  </p>\n\n\n\n<p>·       The stark difference between right and left brain thinking\n\n  </p>\n\n\n\n<p>·       Why understanding human emotions is so important\n\n  </p>\n\n\n\n<p>·       How to tell customer first stories that touch the heart and deliver results\n\n  </p>\n\n\n\n<p>·       The true value of gratitude\n\n  </p>\n\n\n\n<p>You will also see three case studies that demonstrate how to put customers first and why it’s so important to building a better future:\n\n  </p>\n\n\n\n<p>·       TD Bank\n\n  </p>\n\n\n\n<p>·       Safelite Auto Glass\n\n  </p>\n\n\n\n<p>·       Jason Terry / NBA Player\n\n  </p>\n\n\n\n<p>The journey to putting your customers first will pay off for your company for many years to come.  Please enroll today!\n\n  </p>","suitableLearners":["If you work with customers and are interested in the topics of marketing, market research, sales, customer service, and strategy, this course is for you. It will help you have a deeper understanding of today’s changing and more demanding customer."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2017-12-05T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2017-12-08T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7feb9c9b04f3f624d6b5"],"topics":[],"reviews":[],"meta":{"ratingCount":1987,"studentCount":9937,"avgRatingScore":4.6654496,"contentVideoLength":117865},"basicInfo":{"udemyCourseId":936754,"slug":"certified-lean-six-sigma-black-belt-training","title":"Certified Lean Six Sigma Black Belt Training","subtitle":"Complete Course - Internationally Accepted CSSBB, LSSBB Body of Knowledge to Pass Any SSBB exam +Certification","image":"https://img-c.udemycdn.com/course/240x135/936754_70d1_6.jpg","price":1032070,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["Pass your CSSBB , LSSBB exam with super confidence in the first attempt","This course is fully aligned with the Six Sigma Black Belt Body of Knowledge provided by most internationally recognized certification bodies.","Handle complex Six Sigma improvement projects in your organization","Practice tests and quizzes after each section","Life time access to the course material and quizzes."],"requirements":["Preferably should have completed Six Sigma Green Belt course","This is an advanced course. Basic concepts are covered but are covered at a faster pace."],"description":"<p><strong>Note: Students who complete this course have an option to apply for the certification exam by Quality Gurus Inc. and can achieve the Verified Certification from Quality Gurus Inc. <em>It is optional and there is no separate fee for that.</em></strong></p><p>The <strong>Most Comprehensive</strong> Lean Six Sigma Black Belt Course: This course has 36 hours of videos covering the full scope. This is not a course with just a few easy topics with nice stories and beautiful photos. This is based on the internationally accepted Body of Knowledge.</p><p>A Lean Six Sigma Black Belt leads the improvement team and is competent at managing a team and using various improvement and statistical tools.</p><p><br></p><p><strong>Why this course?</strong></p><ul><li><p><strong>Learn Lean Six Sigma from an experienced instructor having 35 years of practical experience in implementing Quality Management and Continuous Performance Improvement.</strong></p></li><li><p><strong>9,000+ satisfied students. </strong></p></li><li><p><strong>This course is fully aligned with the Lean Six Sigma Black Belt Body of Knowledge provided by most internationally recognized certification bodies. This is a single course for the Lean Six Sigma Black Belts covering everything you need ever as a Six Sigma Black Belt.</strong></p></li><li><p><strong>This course covers all you need to know as a Black Belt - whether you want to take the CSSBB, LSSBB or any other certification&nbsp;exam or to become the Black Belt improvement leader&nbsp;in your organization.</strong></p></li><li><p>In this course, you will learn to do manual calculations related to statistical concepts for the exam. In addition, you will learn to use Microsoft Excel and/or SigmaXL for performing complex statistical calculations.</p></li><li><p>Quiz questions in each section. 175+ quiz questions are available.</p></li></ul><p><br></p><p><br></p><p><strong>What are other students saying about this course?</strong></p><ul><li><p>I have taken several Six Sigma Black Belt courses and <strong>this course clearly is the best.</strong> <em>(5 stars by </em>Milan Padukka<em>)</em></p></li><li><p>The complex models and theories were well broken down and through practical examples, they were <strong>easy to understand.</strong> <em>(5 stars by </em>Tobias Trupp<em>)</em></p></li><li><p><strong>I passed my IASSC Black Belt Certification</strong> this week and used his course and slides as main reference points<em>(5 stars by </em>Samrat Dasgupta<em>)</em></p></li><li><p><strong>I passed the CSSBB exam.</strong> I highly recommend this course if you want to crack this tough exam in one go. <em>(5 stars by </em>Sandeep Joshi<em>)</em></p></li><li><p>Excellent course, It was my main study material for <strong>achieving IASCC Black Belt with the first try</strong>. <em>(5 stars by </em>Fotios Stathopoulos<em>)</em></p></li><li><p>Este curso fue una excelente elección debido a que el instructor SANDEEP KUMAR, es un experto en el área de la calidad y transmite sus conocimientos de manera clara y precisa. Además el curso realmente excede todas expectativas planteadas. Cabe señalar que este curso realmente es para BBSS, MBBSS o bien para aquellas personas con una muy buena base de estadística e ingeniería de calidad. Aprovechen y disfrútalo al máximo <em>(5 stars by </em>Juan José Garcia Ochoa<em>)</em></p></li><li><p>I would recommend it for anyone who needs a clear understanding of six sigma concepts at the black belt level. <em>(5 stars by </em>Solomon Charles<em>)</em></p></li><li><p><strong>This course is one of the few you can not get from anywhere.</strong> Sandeep Kumar's approach of teaching is just amazing.<em> (5 stars by </em>Christopher Yakubu<em>)</em></p></li><li><p>I recently <strong>passed the ASQ CSSBB exam </strong>on my first try, and I could NOT have done it without this course. <em>(5 stars by </em>Paul Spaven<em>)</em></p></li><li><p>I <strong>cracked my CSSBB exam </strong>with the help course. Very clear and precise way of presenting the concepts. <em>(5 stars by </em>Tapas Kar<em>)</em></p></li><li><p>After taking Mr. Kumar's course on Udemy, I was able to <strong>pass my ASQ CSSBB Exam on the first try.</strong> <em>(5 stars by </em>Christopher Philip<em>)</em></p></li></ul><p><br></p><p><strong>What is covered in this course?</strong></p><p>Master the Six Sigma advanced concepts at your own pace and add value to your organization by improving existing processes.&nbsp;Topics covered in this course include:</p><p>Section 1: Introduction and Organization-wide Planning and Deployment</p><p>Section 2:&nbsp;Process Management and Measures</p><p>Section 3: Team Management</p><p>Section 4: Define</p><p>Section 5: Measure</p><p>Section 6: Analyze</p><p>Section 7: Improve</p><p>Section 8: Control</p><p>Section 9: Design for Six Sigma&nbsp;</p><p>Section 10: Bonus and other miscellaneous topics&nbsp; &nbsp;</p><p><br></p><p><strong>What are you waiting for?</strong></p><p>This course comes with Udemy's 30 days money-back guarantee. If you are not satisfied with the course, get your money back.</p><p>I hope to see you in the course.</p><p><br></p><p><strong>Note: We are not a representative of ASQ®, IASSC® or any other certification organization.</strong></p><p><strong>ASQ® is the registered trademark of the American Society for Quality.</strong></p><p><strong>IASSC® is the registered trademark of the International Association for Six Sigma Certification.</strong></p><p><strong>We are an independent training provider. We are neither associated nor affiliated with the certification organization(s) mentioned in our courses. The name and title of the certification exam mentioned in this course are the trademarks of the respective certification organization. We mention these names and/or the relevant terminologies only for describing the relevant exam processes and knowledge (i.e. Fair Use).</strong></p>","suitableLearners":["This course is meant for people aspiring to be the organizational Six Sigma Black Belt resource and to be the source of statistical knowledge"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-12-21T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-12-24T00:00:00.000Z"},"promotions":{"enabled":false}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7feb9c9b04f3f624d6b5"],"topics":[],"reviews":[],"meta":{"ratingCount":1987,"studentCount":7371,"avgRatingScore":4.1223164,"contentVideoLength":4513},"basicInfo":{"udemyCourseId":674982,"slug":"supply-chain-inventory-control-safety-stock-calculation","title":"Supply Chain: Inventory Control & Safety Stock Calculation","subtitle":"Reduce Operational Cost by Optimizing in Inventory Levels","image":"https://img-c.udemycdn.com/course/240x135/674982_d748_5.jpg","price":1834970,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["How to calculate Safety Stock  level by multiple formulas.","Inventory Control Significance","More than 10 techniques to reduce cost by controlling inventory levels."],"requirements":["Basic supply chain concepts "],"description":"<p>The course is a vital topic in <strong>supply chain planning</strong> field for all type of planners. Safety stock &amp; inventory control have huge impact on <strong>cash flow &amp; profits</strong> of any manufacturing or trading companies.. </p>\n\n<p>You will be learning, firstly, how to calculate <strong>safety stock </strong>and there will be<strong> </strong><em>different types of equations</em> in order to suit all industries.</p>\n\n\n\n<p>Also we will focus on how to <strong>optimize inventories</strong> levels with <em>ten </em><em>different methodologies.</em></p>\n\n\n\n<p>All planners shall <strong>be able to implement</strong><strong> easily</strong> the materials of this course and drive <strong>saving</strong><strong> from 1,000$ to 100,000$ per month.</strong><br></p>\n\n\n\n<p>Ultimately, market share of your <strong>firm will grow</strong> with more revenues &amp; profits.</p>","suitableLearners":["Supply Planners","Demand Planners","Materials Planners","Production Planners","Distribution Requirement planners"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2018-11-01T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2018-11-04T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7feb9c9b04f3f624d6b5"],"topics":[],"reviews":[],"meta":{"ratingCount":1878,"studentCount":12194,"avgRatingScore":4.437199,"contentVideoLength":24222},"basicInfo":{"udemyCourseId":1957510,"slug":"uipath-rpa-level-2","title":"UiPath RPA - Level 2","subtitle":"Be a confident, job-ready UiPath RPA professional!","image":"https://img-c.udemycdn.com/course/240x135/1957510_2967_10.jpg","price":2064370,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["Use industry standard naming conventions for consistency","Understand a simple, reliable, and pragmatic way to create enterprise-grade automation","Use the state machine to develop software robots","Use snippets & custom activities to shorten robot development time","Download from or publish to the UiPath component marketplace","Use data scraping to quickly & easily get high volumes of data from websites","Use Orchestrator queues & transactions","Split work across multiple RPA developers using TFS source code management"],"requirements":["A modern WINDOWS computer with Internet connection (UIPath has no Mac version)","Be familiar with the roles that MS Excel spreadsheets, MS Word, websites, and software applications fill in daily business life","Take the \"UiPath Level 1\" and optionally \"RPA Overview\" and \"RPA Tech Primer\" courses first"],"description":"<p>In this&nbsp;course, we'll take the skills you learned in the <strong>UiPath Level 1 </strong>course, add some <strong>new, advanced skills</strong>, and lace them all together with <strong>enterprise best practices</strong>. In this <strong>project-based</strong> course, we'll cover all the topics you'll need to be job-ready with UiPath RPA at any enterprise company:</p><ul><li><p>Enterprise naming conventions</p></li><li><p>Source code management with TFS</p></li><li><p>Orchestrator queues &amp;&nbsp;transactions</p></li><li><p>Using multiple robots in parallel to speed up work</p></li><li><p>The State Machine activity and robot architecture</p></li><li><p>Data scraping</p></li><li><p>Snippets &amp;&nbsp;custom activities</p></li><li><p>The new UiPath component marketplace</p></li><li><p>Walk-through robots &amp;&nbsp;components built by others</p><p><br></p></li></ul><p><strong>My goal</strong> is to help you become a <strong>world class RPA&nbsp;developer, architect, or analyst</strong> faster than any other method, so you can start saving time &amp;&nbsp;money at your company, and level up your career!</p><p><br></p><p>==== Because Udemy forces me to type more than is necessary in the description ====</p><p>In this&nbsp;course, we'll take the skills you learned in the <strong>UiPath Level 1 </strong>course, add some <strong>new, advanced skills</strong>, and lace them all together with <strong>enterprise best practices</strong>. In this <strong>project-based</strong> course, we'll cover all the topics you'll need to be job-ready with UiPath RPA at any enterprise company:</p><ul><li><p>Enterprise naming conventions</p></li><li><p>Source code management with TFS</p></li><li><p>Orchestrator queues &amp;&nbsp;transactions</p></li><li><p>Using multiple robots in parallel to speed up work</p></li><li><p>The State Machine activity and robot architecture</p></li><li><p>Data scraping</p></li><li><p>Snippets &amp;&nbsp;custom activities</p></li><li><p>The new UiPath component marketplace</p></li><li><p>Walk-through robots &amp;&nbsp;components built by others</p><p><br></p></li></ul><p><strong>My goal</strong> is to help you become a <strong>world class RPA&nbsp;developer, architect, or analyst</strong> faster than any other method, so you can start saving time &amp;&nbsp;money at your company, and level up your career!</p>","suitableLearners":["Anyone who wants to improve their chances of getting and keeping a white collar job in the near future","Test automation engineers who want to make a larger impact and increase earning potential","Business leaders who want to automate operations","Anyone wanting to save time, reduce errors, and improve efficiency by automating common business tasks"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2020-04-19T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2020-04-22T00:00:00.000Z"},"promotions":{"discountPrice":298220,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7feb9c9b04f3f624d6b5"],"topics":[],"reviews":[],"meta":{"ratingCount":1800,"studentCount":5914,"avgRatingScore":4.5416627,"contentVideoLength":13206},"basicInfo":{"udemyCourseId":1951644,"slug":"certified-lean-specialist-lean-management-accredited","title":"Certified Lean Specialist | Lean Management (Accredited)","subtitle":"Lean Management | Lean Manufacturing | Lean in Service | Lean Specialist | Accredited Lean Certification | Lean Part 1","image":"https://img-c.udemycdn.com/course/240x135/1951644_1ae2_10.jpg","price":1949670,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["Become a Certified Lean Specialist","Get Visibility: Start Solving Business Problems using Lean Tools and Techniques","Explore Gaps in Your Business: Learn to Identify Waste in Your Business Process","Practice Project Management: Drive Lean Projects within Your Organization","Develop Coaching Skills: Coach Peers, Subordinates and Superiors on Lean Tools and Techniques","Learn to Ask Right Questions and Enable Lean Thinking","Achieve Fast-Paced Growth: Execute Lean Projects that Deliver Cost Savings"],"requirements":["No prior knowledge required","Your commitment to watch the lectures, study the information and apply Lean in your organization"],"description":"<p><strong>LEAN SPECIALIST CERTIFICATION |&nbsp;LEAN MANAGEMENT (ACCREDITED)</strong></p><p><em>This Lean Specialist course is </em><strong><em>accredited by internationally recognized Continuing Professional Development (CPD) Certification Service </em></strong><em>(Provider No:&nbsp;14627, Certificate No: A029014-05).</em></p><p>Are you a working professional, tired of your monotone schedule, want to improve your work environment and make a distinguished mark in front of your boss and senior management? Are you a Quality Professional who is looking to advance your process improvement skills by adding Lean Certification to your arsenal of technical qualification? OR&nbsp;are you a fresher who is looking to enhance your resume and stand out of the competition by adding core process improvement and change management expertise to your skill set?</p><p>If so, this is the course for you.</p><p>In this Lean Management program, I'm going to teach you both the theory of Lean tools and techniques as well as their practical applications. The entire program is divided into two different courses. Each course teaches you a number of exclusive Lean tools and techniques. Course # 1, this course is focused on helping you understand the Basics of Lean Management and makes you a specialist to use several Lean tools and techniques. Course # 2 is about taking your skill level from being a Lean Specialist to being a Lean Expert.</p><p>Let's first understand <strong>What is Lean?</strong></p><p>Lean is a Business Process Improvement methodology that is focused on identifying waste and eliminating it. Lean Management has become extremely popular in the recent years due to its ability to bring about rapid improvement in your business process. Lean Management comprises of several tools and techniques including: Value Stream Map, 5S, Poka-Yoke, Genchi Genbutsu, Jidoka, Just-in-Time, and much more.</p><p><strong>Who is a Lean Practitioner? </strong></p><ul><li><p>A Lean Practitioner has hands-on expertise in using Lean tools and techniques</p></li><li><p>He drives Lean projects within his organization</p></li><li><p>He is an expert at identifying waste (using the Lean tools and techniques) and eliminating them</p></li><li><p>He is highly visible at all levels in his organization - from grass root to the top management</p></li><li><p>He is known for asking the right questions and effectively changes the status quo</p></li><li><p>By executing Lean Projects, a Lean Specialist saves cost and improves processes</p></li><li><p>He also has the ability to coach and train other aspiring candidates on using Lean tools and techniques</p></li></ul><p><strong>Do You Want to become a Lean Practitioner? </strong></p><p>You've just stumbled upon the most complete, in-depth online Lean Management Program. This Lean Specialization Training provides you a practical perspective to solve business problems. It provides you the right level of proficiency that enables you to be a hands-on expert who is capable to drive Lean projects within your organization.&nbsp; </p><p><strong>What would you get after taking this Course?</strong></p><ul><li><p>Become a Lean Specialist</p></li><li><p>Become a Problem Solver for your Business</p></li><li><p>Learn to Identify Waste in Your Business Process</p></li><li><p>Drive Lean Projects within Your Organization</p></li><li><p>Coach Peers, Subordinates and Superiors on Lean Tools and Techniques</p></li><li><p>Learn to Ask Right Questions and Enable Lean Thinking </p></li><li><p>Deliver Cost Savings by Executing Lean Projects</p></li><li><p>Become a pro at answering tough interview questions related to Lean</p></li><li><p>Receive trainer assistance using the Q&amp;A Discussion board</p></li><li><p>Add Lean credential to your resume</p></li><li><p>Get access to 25+ downloadable resources and 3.5 hours of on-demand video training</p></li></ul><p><strong>What is covered in this Course?</strong></p><ul><li><p>What is Lean?</p></li><li><p>Who are the Lean Pioneers?</p></li><li><p>What is Toyota Production System?</p></li><li><p>What is Poka-Yoke (Mistake-Proofing)?</p></li><li><p>What is Value?</p></li><li><p>What is a Value Stream Map?</p></li><li><p>What is 5S?</p></li><li><p>What are 8 Wastes?</p></li><li><p>What is Jidoka (Autonomation)?</p></li><li><p>What is Kaizen?</p></li><li><p>What is Genchi Genbutsu?</p></li></ul><p><strong>The Course is very well structured:</strong></p><ul><li><p>You become an expert in practicing the Lean Methodology </p></li><li><p>There entire course is divided in 14 sections</p></li><li><p>Each section is dedicated to a specific Lean concept</p></li><li><p>These concepts are taught in more than 80 lectures</p></li><li><p>Each lecture covers bite-sized information; easy to grasp and apply</p></li><li><p>Each lecture consists of a video screencast</p></li><li><p>Each section is well-rounded with:</p><ul><li><p>A section objective discussed at the beginning</p></li><li><p>Then the concept is discussed at length</p></li><li><p>Then examples are discussed to review concepts from practical perspective</p></li><li><p>This is followed by a real-life case study and an activity and activity solution</p></li><li><p>Each section ends with an apt summary</p></li></ul></li></ul><ul><li><p>There are ample number of activities for each tool taught in this training</p></li><li><p>Each activity or&nbsp;home-work has a subsequent video lecture discussing the activity solution&nbsp;for self-evaluation&nbsp; &nbsp;</p></li><li><p>There are over 25 downloadable resources which are comprehensive and pertinently cover everything you'll need to become a Lean Specialist</p></li></ul><p><strong>***No Prior Experience Needed***&nbsp;&nbsp;</strong></p><p>This&nbsp;Lean Management Program assumes that you have no prior process improvement background. With over 3.5 hours of on-demand video, over 80 lectures, over 25 supplemental resources and with several real-life anecdotes, these comprehensive tutorials cover everything you’ll ever need to become a&nbsp;successful Lean practitioner.</p><p>Whether you want to: &nbsp;</p><ul><li><p>Become an in-demand Certified Lean Practitioner for service/manufacturing organizations </p></li><li><p>Get freelancing assignments and work from home, setting your own schedule and rates&nbsp; &nbsp; &nbsp; &nbsp;</p></li><li><p>Sharpen your process improvement skills to reach the advanced level </p></li><li><p>Simply bring your own ideas to life with your first Lean project &nbsp;</p></li></ul><p>…this complete&nbsp;Lean Management Program is exactly what you need,&nbsp;and more.&nbsp; &nbsp;</p><p><strong>So why wait? Enroll today and become a Certified Lean Specialist!</strong></p>","suitableLearners":["Employees who are looking to become Lean Practitioners","Employees who have Work Experience of at least 2-3 year","Employees who are looking for Fast-Paced Growth/Promotion in their Existing Job","Employees who are looking to Create an Impact in their Business Process and Earn Higher Income","Individuals who are Six Sigma White Belts, Yellow Belts, Green Belts, Black Belts, PMP, Prince2, Scrum Masters, Agile Experts, etc","Employees who are looking for a Job Change","Senior and Middle Managers who are looking to Implement Process Improvement Practices in their Organization","Newbies who are looking for a Job may also apply"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-04-06T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-04-09T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7feb9c9b04f3f624d6b5"],"topics":[],"reviews":[],"meta":{"ratingCount":1722,"studentCount":4775,"avgRatingScore":4.182864,"contentVideoLength":35956},"basicInfo":{"udemyCourseId":2271516,"slug":"dual-course-on-lean-six-sigma-white-belt-and-yellow-belt","title":"Dual Course on Lean Six Sigma White Belt and Yellow Belt","subtitle":"Full Syllabus Course (>10hr+ over 100 Questions ) on Lean Six Sigma White Belt and Lean Six Sigma Yellow belt","image":"https://img-b.udemycdn.com/course/240x135/2271516_5a17_5.jpg","price":687970,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["Learn Six-Sigma DMAIC and DMADV improvement approaches","Know working with basic quality tools with software (Minitab 2017,18,19 compatible) and excel","A knowledge of what all the lean tools means and how you can work with them.","Kaizen, RCA ,PDCA and A3, Smart goals, Pull System, VSM and process mapping, Andon, Jidoka(Autonomation), Work Standardization, Just In Time (JIT), Hosin-Kanri.","Lean defect and waste reduction tools like: 5S, 3M (Muda, Mura, Muri), Poka-Yoke or Mistake Proofing, Heijunka, Overall Equipment Effectiveness.","An overview how big companies are using lean and six-sigma to improve their business as a guidance for you to improve your business.","And this could be a bonus to introduce your skills in resume."],"requirements":["No specific requirements needed. This course is designed from beginner to advanced level without any prior knowledge"],"description":"<p><strong>Updated: July 2021</strong> with over 100 exam questions !</p><p><strong>Updated: March 2021</strong> with improvement in some video lectures on Section 1</p><p><strong>Updated: Dec 2020 </strong>with six sigma green belt preparation section. </p><p><strong>Updated: Nov 2020 </strong>with Resource notes and Handouts and Simulated Case Studies</p><p><strong>Updated: Oct 2020&nbsp; </strong>with Lean resource note at section 7</p><p><strong>Updated: Aug 2020 </strong> with Quizzes at white belt section</p><p><strong>Updated: April 2020 </strong>with Practice test addition</p><p>'<strong>Quality, Content &amp;&nbsp;Training' of two Lean Six Sigma Training Programs ; 'Lean Six Sigma White Belt' and 'Lean Six Sigma Yellow Belt' in the price of one. </strong></p><p>Grow your business and lean management skills with this course with on-demand 5.5 hours course with over <strong>15 Modules (105+ topics) covering 20 lean tools</strong>, <strong>30 downloadable resources, templates and data files,</strong> <strong>4 Case Studies how Fortune 500 companies use Lean and Six Sigma</strong>, 7 QC tools explained with Software integration (<strong>Minitab 17/18/19&nbsp; &amp; Excel</strong>), downloadable <strong>pdfs, 2 practice tests, Quizzes </strong>and plenty more !</p><p>Six Sigma is a continuous, controlled and data driven method of eliminating defects in such a way as to go for six standard deviations between the mean and nearest specification limit in any process throughout the life cycle of the product, business or service. To achieve six sigma, the process shouldn’t produce more than 3.4 defects in a million opportunities. We can thus roughly say that six sigma is a mistake free approach of improving the business or service.</p><p><strong><em>On Six Sigma White Belt</em></strong></p><p>White belt is the introductory level of six sigma belts. This Lean Six Sigma White belt certification prepares you with basics of lean six sigma and software integration. If you already have higher belts of lean six sigma this course may not be for you but it still we challenge that this course definitely has more and new market friendly inclusions that you never realized in other courses before!</p><p><strong><em>On Six Sigma Yellow Belt'</em></strong></p><p>Yellow belt is the first professional level of six sigma belts. This Lean Six Sigma Yellow belt certification prepares you with in depth content of the six sigma DMAIC&nbsp;cycle (Define, Measure, Analyze, Improve and Control). It also introduces you with more than 20 lean tools, 7 Quality tools along with complete <strong>Minitab 18, Minitab 19 and Excel tutorial </strong>to solve the quality problems. </p><p><strong>What is unique with the course that you won’t get elsewhere?</strong></p><p><br></p><ul><li><p>Two training courses 'Lean Six Sigma White Belt' and 'Lean Six Sigma Yellow Belt' and certification opportunities in the price of one. </p></li></ul><ul><li><p>Get acquainted with&nbsp; &gt; 20 problem solving scenario, 30+ templates, articles and data files and two practice exams each for white and yellow belt certification.</p></li></ul><ul><li><p>Guides you for the use of <strong>Minitab 2017,</strong> &nbsp; <strong>Minitab 2018 and Minitab 2019 and Excel</strong> (Which hasn’t been explored by any six sigma course up to date ! )</p></li></ul><ul><li><p>Learn how the <strong>Fortune 500</strong> companies are benefiting from lean and six sigma <strong>(TOYOTA, NIKE, INTEL, BANK OF AMERICA)</strong></p></li></ul><ul><li><p>Learn seven quality control tools (<strong>Pareto Analysis, Check Sheet, Scatter Diagram, Histogram, fish-bone diagram, control chart, flow chart)</strong> <strong>using unique simulated case studies.</strong></p></li></ul><ul><li><p>Introduces yourself with <strong>20 lean tools </strong>for your business and productivity (<strong>Kaizen, 5S, 3M (Muda, Mura and Muri), Work Standardization, Value Stream Mapping, Pull System, Kanban, Key Performance Indicators,Overall Equipment Effectiveness,Root Cause Analysis, Single Minute Exchange of Dies, Andon, Heijunka, PDCA, A3 Report,Mistake Proofing or Poka Yoke, TAKT Time,Six Big Losses, JIDOKA (Automation),Setting Smart Goals,Policy Deployment (Hosin Kanri))</strong></p></li></ul><ul><li><p><strong>Get Certificate</strong> and add this powerful credential to your resume.</p><p><br></p></li></ul><p><strong>Any requirements?</strong></p><p>There is no special requirements for this course as this course prepares you with Lean Six Sigma from a basic level. Even if you have no prior statistical knowledge or knowledge working with software such as MINITAB&nbsp;18, MINITAB&nbsp;19, or MS-Excel, this course helps you to have a complete practical knowledge of using these software for solving specific quality issues and Lean Six Sigma issues.</p><p><strong>Still confused?</strong></p><p>Take a tour of our course with the introductory video, Preview of how to use this course and the entire syllabus if you still have a confusion. </p><p><em>This course comes with Unconditional Udemy </em><strong><em>30 day money-back guarantee</em></strong><em> and that's my personal promise to your success!</em></p><p><strong>Enroll</strong> into the course and I will <strong>see you inside</strong>,</p><p><strong><em>Thank you !</em></strong></p>","suitableLearners":["Student and professionals who new to lean and six sigma","Students/professionals who want business improvement through lean and six sigma","Students/professionals looking for a quick refresher on lean six sigma","Management/Organizations who want to deploy lean and six sigma in their organization and improve their process.","Students looking for lean six sigma white belt and lean six sigma yellow belt certification"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-11-14T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-11-17T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7feb9c9b04f3f624d6b5"],"topics":[],"reviews":[],"meta":{"ratingCount":1705,"studentCount":4952,"avgRatingScore":4.545915,"contentVideoLength":8290},"basicInfo":{"udemyCourseId":2169476,"slug":"blockchain-in-supply-chain-management","title":"Blockchain in Supply Chain Management","subtitle":"Learn how blockchain technology is being used to enable and deliver more secure, transparent and efficient supply chains","image":"https://img-c.udemycdn.com/course/240x135/2169476_b304_2.jpg","price":1949670,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["What blockchain technology is and how it works","Why and how blockchain is used in Supply Chain Management (SCM)","Explore real business use cases and applications of blockchain in SCM","Steps you can take towards implementing blockchain in your own supply chain","Work \"hands-on\" with blockchain demo platforms","Raise your profile as a Supply Chain Management (SCM) professional by adding blockchain to your areas of expertise","Bonus Infographics: \"Seven Steps Towards a Successful Blockchain Project Implementation\" and \"What kind of blockchain should you use?\"","Bonus blockchain online demo platforms: Access to an online blockchain demo platform and cryptographic hash generator"],"requirements":["There are no previous requirements for taking this course","A computer with an Internet browser to be able to use the blockchain demo platforms we will be working with"],"description":"<p><strong>Blockchain in Supply Chain Management</strong></p><p>In the majority of companies,<em>&nbsp;</em><strong><em>over 70% of the costs </em></strong><em>and&nbsp;</em><strong><em>100% of revenues</em></strong>&nbsp;depend on supply decisions and how the supply chain is managed.</p><p>Discover why some of the leading minds in business estimate that&nbsp;<strong><em>the application of blockchain in global supply chain management can result in more than $100 billion in efficiencies</em></strong>, while improving the security and traceability of product supply chains.</p><p>In this highly interactive and informative video course by bestselling blockchain instructor George Levy...</p><p><strong>You will learn:</strong></p><ul><li><p><strong>What blockchain technology&nbsp;is </strong>and&nbsp;<strong>how it works.</strong></p></li><li><p>Why<strong>&nbsp;blockchain is a great fit for Supply Chain Management.</strong></p></li><li><p><strong>hands-on with blockchain demo platforms</strong> to experience it yourself</p></li><li><p><strong>How companies are currently using blockchain</strong>&nbsp;in their supply chains.</p></li><li><p><strong>Key areas where blockchain technology adds the most value</strong>&nbsp;in the supply chain.</p></li><li><p><strong>Leading technology players in blockchain</strong>&nbsp;you should be aware of.</p></li><li><p><strong>The different kinds of blockchains</strong>&nbsp;available and&nbsp;<strong>how to determine&nbsp;which one is right for you</strong></p></li></ul><p><strong><em>…and much, much more!</em></strong></p><p>You will even get to work with a <strong>blockchain supply chain demo platform</strong> available to students of this course.</p><p>With your enrollment, you will get lifetime access to the lessons and a <strong>30 day money back guarantee</strong>!</p><p>You also will <strong>receive upon finishing the course a certificate of completion</strong> showing that you've completed this valuable training.</p><p><strong>Discover how and why blockchain technology is currently already being used</strong>&nbsp;by many leading organizations, including retail giant Walmart, and food and agriculture powerhouse Cargill among many others, to make their supply chains more secure, transparent and efficient.</p><p>You will gain valuable insights on how<strong><em>&nbsp;blockchain is being used to combat the more than $1.2 trillion dollars in counterfeited goods worldwide</em></strong>, and how it is helping enable global supply chains to work more closely together as integrated units.</p><p>There are <strong>no previous requirements to take this course</strong>, and you do not have to be a blockchain or a Supply Chain Management professional to take the course. You will also <strong>have access to the instructor to answer any questions you may have</strong> as you learn the lessons.</p><p>You will also review and understand real case studies of blockchain being used in various supply chains, and you will learn a valuable&nbsp;<strong>seven step process for successfully implementing a blockchain technology</strong>&nbsp;project.</p><p><br></p><p><strong>BONUSES!</strong></p><p><strong>I have included two valuable, printable Infographic guides:</strong></p><p><strong>·&nbsp;<em>Steps Towards a Successful Blockchain Project Implementation</em></strong></p><p><strong>·&nbsp;<em>What Kind of Blockchain Should You Use?</em></strong></p><p><br></p><p><strong>Blockchain is a key technology transforming the future of Supply Chain Management:</strong></p><p>Don't be left behind and&nbsp;<strong>get a first mover advantage for you and your business by enrolling in this course.</strong></p><p>Many global organizations are already incorporating blockchain into their supply chains, and as business continues to become even more global, there is an increasing need for supply chain professionals who understand blockchain technology, and how it can be applied into the supply chains of their organizations.</p><p>Enroll now and learn how to use blockchain in Supply Chain Management to start driving greater business results for you and your business today!</p><p>Remember, there is a <strong>30-day money-back guarantee</strong> so there is nothing to lose and no reason to wait.</p><p>I look forward to seeing you inside!</p><p>Best,</p><p>George Levy, CSBCP, GBP</p>","suitableLearners":["Professionals involved in Supply Chain Management","Students of Supply Chain Management","Business owners seeking to understand how to improve their supply chains","Anyone interested in learning how blockchain technology is being used in Supply Chain Management"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2020-10-20T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2020-10-23T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7feb9c9b04f3f624d6b5"],"topics":[],"reviews":[],"meta":{"ratingCount":1674,"studentCount":7834,"avgRatingScore":4.364393,"contentVideoLength":41425},"basicInfo":{"udemyCourseId":687726,"slug":"six-sigma-statistics-using-minitab-17","title":"Six Sigma Statistics Using Minitab 17","subtitle":"Learn Basics and Confidently Apply Six Sigma Statistical Concepts To Your Green / Black Belt Projects Using Minitab 17","image":"https://img-c.udemycdn.com/course/240x135/687726_af96_17.jpg","price":2064370,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["Will be able to understand the statistical concepts from basic up to Six Sigma Black Belt level.","Will able to use Minitab 17 for conducting the advanced level of statistical analysis","Will help you in understanding statistics to pass certification exams such as ASQ-CQA, CQE, SSGB, SSBB and many more.","Will be able to perform complex statistical analysis."],"requirements":["Willingness to learn","A part of this course on the use of Minitab 17. You will need to have the software to practice. Please note that you can download 30 days trial version of this software from Minitab website"],"description":"<p>By completing this course, you will have a solid understanding of the most commonly used statistical concepts in Six Sigma and you will also be able to apply those using Minitab software. </p><p>The course is not limited to Minitab software. It first explains the statistical concept and then shows how to implement it using Minitab.</p><p><strong>Why this course?</strong></p><ul><li><p><strong>Start your Six Sigma learning with an experienced instructor having 35 years of practical experience in implementing Quality Management and Continuous Performance Improvement.</strong></p><p><br></p></li></ul><p><strong><em>Here is a summary of the topics covered in this course.</em></strong> </p><ul><li><p>Learn statistics in plain and simple terms, from basics to advanced concepts.</p></li><li><p>Learn to perform statistical analysis using Minitab 17 software for your Six Sigma Green / Black Belt projects.</p></li><li><p>A wide range of topics is covered, starting from the basics to advanced topics such as Measurement System Analysis (MSA), Gage R&amp;R, Hypothesis Testing, ANOVA and Design of Experiments.</p><p><br></p></li></ul><p>You will learn the statistical analysis for your Six Sigma projects using Minitab 17 through short and easy-to-understand video lessons and quizzes. A discussion forum on the right side of this course would be used to discuss specific problems and issues. </p><p>Even though Minitab software has been updated a few times since the release of this course, the concepts explained here can still be applied in the latest version of Minitab.</p><p><br></p><p><strong>What are other students saying about this course?</strong></p><ul><li><p>Easy to understand and hands-on exercises. <em>(5 stars by </em>Forest SL Zhang<em>)</em></p></li><li><p>I highly recommend if you want to improve the analysis skill on Minitab 17. Probably is the most complete course about it on Udemy.&nbsp; <em>(5 stars by </em>Marcos de Morais Silva<em>)</em></p></li><li><p>This helped me to get my statistics concepts cleared from the basics! Also, This assisted me to learn various concepts related to MINITAB software.&nbsp; <em>(5 stars by </em>Vishwesh Kumar Jha<em>)</em></p></li><li><p>I'd recommend this course to anybody aspiring for Lean Six Sigma Green Belt or Black Belt. <em>(5 stars by </em>Matt Rold<em>)</em></p></li><li><p>Steady Paced &amp; Interactive Course Content.<em> (5 stars by </em>Shashank Dubey<em>)</em></p></li></ul><p><br></p><p><strong>What are you waiting for?</strong></p><p>This course comes with Udemy's 30 days money-back guarantee. If you are not satisfied with the course, get your money back.</p><p>I hope to see you in the course.</p><p><br></p><p><br></p><p> </p>","suitableLearners":["Quality Managers","Supervisors, Managers and professionals who want to implement Six Sigma process within an organization.","Business Managers who want to understand what numbers are telling","Six Sigma Black Belts","Six Sigma Green Belts"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-12-21T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-12-24T00:00:00.000Z"},"promotions":{"discountPrice":298220,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7feb9c9b04f3f624d6b5"],"topics":[],"reviews":[],"meta":{"ratingCount":1646,"studentCount":5186,"avgRatingScore":4.3996687,"contentVideoLength":13019},"basicInfo":{"udemyCourseId":3370166,"slug":"operations-management-a-z-business-processes-and-systems","title":"Operations Management A-Z: Business Processes and Systems","subtitle":"Operations Management: Supply Chain & Business Processes in Industry for Manufacturing and Services Organizations","image":"https://img-c.udemycdn.com/course/240x135/3370166_1c4a_9.jpg","price":458570,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["Become the operations management guru in your company! Combine core understanding with powerful tools and techniques","Gain a total overview of operations management for manufacturing and service businesses","Increase your profitability, improve delivery and use your resources more efficiently","Master the fundamentals of operations strategy, systems design and business management","An MBA style course on business process management (BPM)","Take practical actions on how to run and improve an operations business such as a factory, restaurant, or hospital department.","Organize and run your business more effectively and efficiently","Ideal for industrial / production / manufacturing organizations but also service and traditional business operations"],"requirements":["Only a desire to improve your business operations!"],"description":"<ul><li><p>Master the tools and principles of operations management to have and \"impact\" on your business's operations - manufacturing, services, industrial operations and production.</p></li><li><p>Equip yourself to take a leading role in your workplace - improving your processes, systems and business.</p></li><li><p>Understand the fundamental challenges of all business operations and the core tools and essential approaches to design and improve them. </p></li><li><p>Become the authority in your team on improving the operations systems in your business</p><p><br></p></li></ul><p>This MBA&nbsp;style course on Operations Management will prepare and empower you to make a real difference in your organization. </p><p>\"This\" course focuses on your business's \"internal\" operations. Check out my other course on Supply Chain Management.</p><p>This course is for the new or aspiring manager, the ambitious engineer, high flying consultant, the hands-on planners and the practical business analysts. </p><p><br></p><p>Business operations come in all shapes and sizes with a host of unique challenges; but the fundamentals of running successful and efficient operations all contain the same fundamentals. Without a grasp of these, no manager can apply the core principles or techniques of business operations management, strategy, design and improvement.</p><p><br></p><p>Take control of your career and equip yourself to understand the real nature of business operations and how you can be the key to unlock their potential!</p><p><br></p><p><strong>Course Contents:</strong></p><ol><li><p>Introduction to Operations Management </p></li><li><p>Operations Strategy</p></li><li><p>Forecasting</p></li><li><p>Inventory</p></li><li><p>Scheduling</p></li><li><p>Capacity Management</p></li><li><p>Resource Requirements Planning</p></li><li><p>Metrics</p></li><li><p>Conclusion</p></li></ol><p><br></p><p>Turbo charge your career and your business! Join us today! </p><p><br></p><p><br></p>","suitableLearners":["Absolute Beginners and New Managers","People who want to make a greater impact at work, improve things and get noticed","Managers, Consultants, Supervisors, Engineers, Planners & Analysts,","People working in Production, Manufacturing, Industrial Operations, Business Operations","Lean / Improvement Practitioners","Those who wish to become an authority in their workplace on business operations management"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-10-30T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-11-02T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}}]