[{
        "status": "active",
        "categories": [
            "625e7f939c9b04f3f624d66b",
            "625e7ff99c9b04f3f624d6bf"
        ],
        "topics": [],
        "reviews": [],
        "meta": {
            "ratingCount": 61189,
            "studentCount": 178454,
            "avgRatingScore": 4.434337,
            "contentVideoLength": 8990
        },
        "basicInfo": {
            "udemyCourseId": 864146,
            "slug": "agile-crash-course-agile-project-management-agile-delivery",
            "title": "Agile Crash Course: Agile Project Management; Agile Delivery",
            "subtitle": "Get Agile Certified & Learn about the key and most important concepts and tools of Agile Project Management (Scrum)",
            "image": "https://img-b.udemycdn.com/course/240x135/864146_dbd7_10.jpg",
            "price": 2752570,
            "lan": "en",
            "level": "beginner",
            "currency": "vnd",
            "isFree": false
        },
        "details": {
            "objectives": [
                "You will become Agile certified (you will receive a certificate upon completion).",
                "You will learn the key concepts of Agile Development, Agile Project Delivery and Agile Project Management.",
                "You will learn the meaning of user stories, daily stand-ups, retrospectives and kanban boards.",
                "You will understand the differences between Agile and traditional project delivery (other methodologies).",
                "Tools and tips that you will love.",
                "Value for money. Guaranteed.",
                "A high quality learning experience.",
                "A guide/process to follow.",
                "You will learn to launch products faster.",
                "You will learn to launch apps faster.",
                "You will learn to launch online courses faster.",
                "You will learn to focus on an MVP (Minimum Viable Product).",
                "You will learn about the importance of simplicity."
            ],
            "requirements": [
                "An open mind and a willingness to learn.",
                "No prep work or previous knowledge required."
            ],
            "description": "<p><strong>[EXCLUSIVE] Double Degree, Badges and Community.</strong> Upon completing this course you will receive 2 Certificates of Completion, an Agile Certified Digital Badge you can add to your CV, LinkedIn Profile or any other online profile &amp; access to the most dynamic Agile Community in the world. </p><p><strong>Think of this course as Agile for Dummies (or Agile for anyone and Agile for everyone).</strong>&nbsp;This agile&nbsp;course udemy&nbsp;will allow you to Master the most important concepts and tools of Agile Development,&nbsp;Agile Project Delivery &amp; Agile Project Management.&nbsp;<br></p><p><strong>This Agile&nbsp;Crash Course has been designed to enable you to become Agile the Agile way, in less than an hour! You will become Agile certified</strong> when you finish this course (you will get a certificate upon completion) and&nbsp;you will learn&nbsp;from an Agile Master,&nbsp;an expert Project Manager &amp; the author of The Mini Book of Agile, available on Amazon.</p><p>__________&nbsp; </p><p><strong>[PERKS]</strong>&nbsp;<strong>Course enrollment includes activities, handouts, quizzes, 1-on-1 expert support, LIFETIME access, free course updates and a lot more!</strong>&nbsp; </p><p><br></p><p><strong>What will you learn?</strong></p><ul><li><p><strong>The key concepts and tools of Agile Development, Agile Project Delivery and Agile Project Management.</strong></p></li><li><p>The meaning of user stories, daily stand-ups, retrospectives and kanban boards.</p></li><li><p>How to apply Agile in your job and projects.</p></li><li><p>The difference between Agile and traditional project delivery.</p></li><li><p>The benefits and advantages of Agile.</p></li><li><p>Why Agile is the preferred development methodology in the modern world.</p></li><li><p>About the history of Agile.</p></li><li><p>Why Agile isn't only for Developers.</p></li><li><p>Why Agile isn't only for IT projects.</p></li><li><p>How to use Agile to deliver quickly and often.</p></li><li><p>How to use Agile to learn from your mistakes.</p></li></ul><p><br></p><p><strong>Here is what you will receive with your enrollment:</strong></p><ul><li><p><strong>High-quality video lectures</strong>&nbsp;that explain the different terms and concepts with real world examples and applications. </p></li><li><p><strong>Downloadable handouts&nbsp;</strong>which you can use as a reference, study guide, cheat sheet and the go to resource on the job.</p></li><li><p><strong>Quizzes and activities</strong>&nbsp;that help you validate what you learnt and put it into practice to increase your information retention.</p></li><li><p><strong>1-on-1 expert Instructor support</strong>&nbsp;to answer your questions or clear up any confusion you might have.</p></li><li><p><strong>Lifetime access with no expiration</strong>&nbsp;so you can complete the course at your own pace, anywhere, on any device and come back for a refresher at any time.</p></li><li><p><strong>Free course updates</strong> so you can continue to benefit from enhancements made to this course.</p></li></ul><p>__________&nbsp; </p><p><strong>Why take this course?</strong></p><ul><li><p><strong>You will become Agile certified (you will receive a certificate upon completion).</strong></p></li><li><p>You will get a ton of awesome Freebies, templates, real world examples and other resources to further your education, knowledge and experience.</p></li><li><p>I will share with you the Best Free Tool to Manage your Agile Projects.</p></li><li><p>You will be prepared to apply Agile to your projects.</p></li><li><p>You will be able to speak about Agile with confidence.</p></li><li><p>You will understand the difference between Agile and other methodologies.</p></li><li><p>You will learn from an Agile Master&nbsp;and Agile expert who applies Agile on a daily basis.</p></li><li><p>You will learn why Agile isn't only for IT or Tech projects but it's actually applied across many industries worldwide.</p></li><li><p>It's short, effective and practical. Think of this course as agile in a nutshell.</p></li><li><p>It's been developed from the ground up with a focus on quality.</p></li><li><p>You will get tools and tips that you will love.</p></li><li><p>It's value for money. You will spend a small amount but gain a lot of&nbsp;knowledge.</p></li><li><p>You have nothing to lose, give yourself the opportunity to learn something new and powerful.</p></li><li><p>You will get the inside scoop on all my future courses.</p></li><li><p>You will get an Agile Project Management Certification when you complete the course.</p></li></ul><p><br></p><p><strong>°°If you already made up your mind about taking this course just click on the \"Buy Now\" button at the top, right hand side.°°&nbsp;</strong>If not, keep reading about this agile course udemy.</p><p>__________&nbsp; </p><p><strong>Why take this course and not another one?</strong></p><ul><li><p><strong>It's a Crash Course.&nbsp;</strong>So no bs, no fluff, only the good stuff :)</p></li><li><p><strong>Buy with confidence</strong>. It's not a coincidence so many people buy this course.</p></li><li><p><strong>It was created by the founder of The Agile Knowledge Base</strong> (AgileKB dot com).</p></li><li><p><strong>It was created by the author of The Mini Book of Agile</strong>, available on Amazon.</p></li><li><p><strong>My value proposition is unique</strong>&nbsp;(see below \"Pledge to All Students\").</p></li><li><p><strong>It comes with Closed Captions</strong> (subtitles in English).</p></li><li><p><strong>It includes free tools,</strong>&nbsp;free downloadable templates,&nbsp;real world examples, tips and freebies.</p></li><li><p><strong>You will learn from an Agile expert</strong> who applies this on a daily basis to his personal and professional projects.</p></li><li><p><strong>It has an active Q&amp;A Community</strong> with real life questions from other students. Always answered by your expert Instructor.</p></li><li><p><strong>This course gets updated on a regular basis</strong> and you get all updates free for life!&nbsp;</p></li></ul><p><br></p><p><strong>How will this help you?</strong></p><ul><li><p><strong>You will be able to deliver projects,&nbsp;products and apps quickly and often, the Agile way!</strong></p></li><li><p>You will go fully prepared to a job that requires knowledge in Agile.</p></li><li><p>You will feel more confident about Agile and how to apply it.</p></li><li><p>You will be able to add this to your CV (just put it under \"Professional Development\" Agile Crash Course, Udemy and Year of Completion). This will help you land more jobs!</p></li><li><p>What you will learn will make you effective and successful :)</p></li><li><p>After completion of this course you will get an Agile Project Management Certification.</p></li></ul><p>__________&nbsp; </p><p><strong>Who is behind this course?</strong></p><p><strong>An Agile Expert&nbsp;</strong>and&nbsp;serial entrepreneur, techie, life hacker, expert Project Manager and MBA (x2) who founded The Agile Knowledge Base (AgileKB dot com) &amp; wrote The Mini Book of Agile, available on Amazon.</p><p>__________&nbsp; </p><p><strong>This course is specifically for:</strong></p><ul><li><p><strong>People who want to learn about Agile.</strong></p></li><li><p>Beginners, people without any Agile experience or knowledge.</p></li><li><p>People who have heard the words \"user stories,\" \"backlog,\" \"retrospectives,\" \"sprints,\" \"scrum master,\" \"product owner,\" \"MVP,\" \"swim lanes,\" \"kanban board,\" etc. and wondered what it meant.</p></li><li><p>Developers, Project Managers, Business Analysts, Solution Architects, Enterprise Architects, Data Base Administrators and basically anyone interested in learning Agile.</p></li><li><p>People who want to learn about an exciting methodology,</p></li><li><p>People with an open mind and a willingness to learn.</p></li><li><p>People capable of taking notes and applying the concepts and tools provided in this course.</p></li><li><p>People that think that traditional project delivery takes too long and want to explore other options.</p></li><li><p>People who want to learn about the most important and popular Agile Methodology: SCRUM.</p></li><li><p>Udemy Instructors who want to launch courses faster, the Agile way!</p></li><li><p>People who want to get an Agile Project Management Certification.</p></li></ul><p><br></p><p><strong>This course is not suitable for:</strong></p><ul><li><p><strong>People that prefer quantity over quality.&nbsp;</strong></p></li><li><p>People that like lengthy and theoretical explanations.&nbsp;</p></li><li><p>People who aren't prepared to go through&nbsp;the entire course and take notes.</p></li><li><p>People who expect things to work out without any effort or preparation.</p></li><li><p>People who already have a lot of experience with Agile and are more intermediate to advanced.</p></li><li><p>People who want to learn about less popular Agile methodologies such as Extreme Programming (XP).</p></li></ul><p>&nbsp;</p><p>°°If you think this course is for you, then go ahead and click&nbsp;<strong>“Buy Now\"&nbsp;</strong>and we'll be in touch soon.°°\n</p><p>__________&nbsp; </p><p><strong>The&nbsp;Facts</strong></p><ol><li><p><strong>You will learn Agile! If you don't&nbsp;ask for a refund within 30 days.</strong></p></li><li><p>Agile is currently the preferred delivery option in technology projects and environments across the world. Yet Agile is not only for IT!</p></li><li><p>Agile will allow you to deliver projects, products and apps&nbsp;quickly and&nbsp;often.</p></li><li><p>Agile is the buzz word and a global trend. More and more people want to learn Agile every day in the world.</p></li><li><p>Agile is not perfect and it won't solve all your problems. But it will give you a different view and approach to managing them.</p></li><li><p>Agile is not suitable for all projects but it is for many.&nbsp;</p></li><li><p>Knowing about Agile will allow you to land more jobs and this agile course udemy will help you prepare.</p></li><li><p>You will enjoy this agile udemy course, guaranteed. </p></li></ol><p>__________&nbsp;</p><p><strong>What are people saying about this course?</strong></p><p>People love this course, but don't take my word for it. Feel free to read below from students just like you!</p><p><br></p><p><em>\"</em><strong><em>This course was amazing! </em></strong><em>When I initially began learning Agile methodologies on my own I was a little overwhelmed because there were bits and pieces on the internet everywhere. This instructor put everything together for me in a format that I was able to consume and comprehend in a day! I definitely appreciate you. </em><strong><em>It was well worth it.</em></strong><em> -Monroe Walker\"</em></p><p><br></p><p><em>\"</em><strong><em>This course has an engaging conversational style and includes useful examples, images and explanations</em></strong><em>. </em><strong><em>I have taken some other Agile courses, and so far I felt this one gave me the most value</em></strong><em>, really helping me see how I could apply the Agile approach in the real world (and not just to IT projects). I gladly recommend this course to others. -Paul Tousignant\"</em></p><p><br></p><p><em>\"</em><strong><em>The course was simple and very informative, as well as affordable! </em></strong><em>I would recommend it to those interested in the subject. -Rod Cano\"</em></p><p><br></p><p><strong><em>\"I was delighted with the experience i had in this course. You can tell Mauricio is a natural with educating and a guru when it comes to Agile</em></strong><em>. He delivered the entire agile methodology in a thorough fashion, yet it was concise and easily digestible at the same time. He is sincere and honest and probably taught me more than other courses out there which can charge $500 + thank you so much mauricio -Julian Kaldawi\"</em></p><p><br></p><p><em>\"</em><strong><em>Love the practical examples which printed in my head and I want to talk to my colleagues about this...Love it! -</em></strong><em>Madhuchhanda Pradhan\"</em></p><p><strong><br><em>\"The company that I currently work provide Agile course to all employees, but I can tell THIS was much better than that!! </em></strong><em>congrats Mauricio you are awesome!!! -Iris Franco de Paiva\"</em></p><p>__________&nbsp; </p><p><strong>What are the advantages of Agile Project Management?</strong></p><ul><li><p>In Agile Project Management you deliver projects faster.</p></li><li><p>Agile Project Management&nbsp;fosters an environment of constant collaboration, teamwork and focus on execution.</p></li><li><p>In Agile Project Management you have direct input from your customer throughout the whole project.</p></li><li><p>In Agile Project Management udemy you constantly reflect for improvement with sessions called Retrospectives.</p></li><li><p>Agile Project Management shifts from traditional long documentation processes and long meetings to agile, lean processes, practices and rituals such as the daily standup.&nbsp;</p></li><li><p>In Agile Project Management roles blur, meaning everyone can participate on different tasks regardless of whether it's their \"official\" role or not. For example, not only testers test, but others too (if the teams decides that).</p></li><li><p>Agile Project Management udemy, allows you to focus on value and the minimum required working solution known as the MVP (Minimum Viable Product). So you apply a basic/yet really important concept all the time: keep it simple!!! Don't build a Ferrari if all you need is a skateboard!</p></li><li><p>Visual boards (Kanbans) and reports (burn down charts), are a key part of Agile Project Management udemy. It allows everyone to stay on the same page and be able to understand speed of execution, areas of improvement and more.</p></li><li><p>And there are many more advantages, but you'll learn more about that as you go through the course :)</p></li></ul><p>__________&nbsp; </p><p><strong>Does this course include an Agile Project Management Certification?</strong></p><p>Yes, you will receive an Agile Project Management Certification upon completion of this course (a&nbsp;Udemy Certificate of Completion which you can download as a pdf).</p><p><strong>Can I add this Agile Project Management Certification to my CV?</strong></p><p>Yes, of course! You can add this Agile Project Management Certification to your CV or Resume. I recommend you add it under a heading called \"Professional Development,\" then, just add the course title, year of completion and Udemy at the end.</p><p><strong>Does a Udemy Agile Project Management Certification have any value in the real world?</strong></p><p>Of course it does! Even though Udemy is not a University and does not provide \"accredited\" certifications (like the one you would get from a University), Udemy is the most important online education platform in the modern world with over 40 Million users worldwide. So it definitely carries weight and is increasingly becoming recognized worldwide. So rest assured adding this Agile Project Management Certification to your CV increases your probability of getting that dream job in an Agile environment or Project Management.</p><p>__________&nbsp; </p><p><strong>Step into my classroom&nbsp;and start learning about Agile now. You will learn about powerful tools and concepts that will enable you to become more successful in your projects. </strong>We&nbsp;will go beyond the definition of Agile, from rituals and tools, to activities, concepts, examples and reflections.&nbsp;So take the course now to learn what all of this means in more detail and how you can apply it to become and Agilelist.&nbsp;</p><p><br></p><p><strong>°°So if you haven't done so already click on \"Buy Now\" now!&nbsp;Or... What are you waiting for?°°</strong></p><p><strong>Production Notes</strong></p><ul><li><p><strong>This course&nbsp;was developed the Agile way, in under 50&nbsp;hours!</strong></p></li><li><p>The creation process involved a high level of attention to detail and a&nbsp;focus on quality.</p></li><li><p>The&nbsp;1st iteration of this&nbsp;course was&nbsp;a living example of an Agile Concept: the MVP or Minimum Viable Product.</p></li></ul><p>__________&nbsp; </p><p><br></p><p><strong>What's New </strong>(Latest Course Updates)</p><ul><li><p>General improvements and enhancements</p></li><li><p>Added new resources &amp; templates</p></li><li><p>Included new tools</p></li></ul><p>__________&nbsp; </p><p><strong>Pledge to All Students</strong>&nbsp;(both current &amp; future students)</p><ol><li><p><strong>Students First</strong>. I will never compromise your experience to make money. Never, ever.&nbsp;Yes, this is also a business but to me teaching goes way beyond making money. I already have a full time job and fortunately don't rely&nbsp;on teaching to survive. You are always at the forefront of my courses and I want to ensure you have a unique, valuable and memorable experience. I promise.&nbsp;</p></li><li><p><strong>24x7x365 Support.</strong>&nbsp;You can contact me 24 hours a day, 7 days a week, year round, even on holidays, Christmas and New Years Eve;&nbsp;I will get back to you quickly&nbsp;(in a few hours tops) and deliver outstanding quality of service in my support. I promise.&nbsp;</p></li><li><p><strong>Humbleness, kindness and social responsibility.</strong>&nbsp;I believe in giving back to you and the world. So think of me as your own real-life human&nbsp;\"Siri.\" If you need advice or support just ask.&nbsp;And if I can do something to help you in your journey, I will.&nbsp;I promise.</p></li><li><p><strong>Australian Made.&nbsp;</strong>Recognized in the Industry as a symbol of quality and excellence. All my courses are Made in Australia with high tech and professionally edited. They also include my secret sauce: a lot of passion &amp; love! I also apply in my courses everything I've learnt from years of experience working with technology, projects, entrepreneurs&nbsp;and people all over the world. I promise.&nbsp;&nbsp;</p></li><li><p><strong>Quality over Quantity</strong>. I will strive to make courses concise, to the point and relevant. Time is one of our most valuable assets and we need to invest it carefully. So I won't&nbsp;make a course long for the purpose of displaying it has more hours; only when strictly necessary.&nbsp;To me it's about quality and if I can deliver that in 5 minutes and save you time, I will. I promise.</p></li></ol>",
            "suitableLearners": [
                "People who want to learn about Agile.",
                "Beginners, people without any Agile experience or knowledge.",
                "People who have heard the words \"user stories,\" \"backlog,\" \"retrospectives,\" \"sprints,\" \"scrum master,\" \"product owner,\" \"MVP,\" \"swim lanes,\" \"kanban board,\" etc. and wondered what it meant.",
                "Developers, Project Managers, Business Analysts, Solution Architects, Enterprise Architects, Data Base Administrators and pretty much anyone interested in learning Agile.",
                "People who want to learn about the most important and popular Agile Methodology: SCRUM.",
                "Udemy Instructors who want to launch courses faster, the Agile Way!"
            ],
            "sections": []
        },
        "messages": {
            "welcome": "",
            "congratulations": ""
        },
        "history": {
            "createdAt": "2022-03-10T00:00:00.000Z",
            "createdBy": "622c1f382e96f2828a7dae2d",
            "publishedAt": "2022-03-13T00:00:00.000Z"
        },
        "promotions": {
            "discountPrice": 389980,
            "startAt": "2022-01-31T17:00:00.000Z",
            "endAt": "2023-01-31T17:00:00.000Z",
            "enabled": true
        }
    },
    {
        "status": "active",
        "categories": [
            "625e7f939c9b04f3f624d66b",
            "625e7ff99c9b04f3f624d6bf"
        ],
        "topics": [],
        "reviews": [],
        "meta": {
            "ratingCount": 34336,
            "studentCount": 122927,
            "avgRatingScore": 4.471257,
            "contentVideoLength": 16254
        },
        "basicInfo": {
            "udemyCourseId": 2013892,
            "slug": "agile-fundamentals-including-scrum-and-kanban-2022",
            "title": "Agile Fundamentals: Including Scrum and Kanban - 2022",
            "subtitle": "Master Agile principles, values, approaches, & mindset to help organizations make changes faster and with less expense",
            "image": "https://img-c.udemycdn.com/course/240x135/2013892_4fd3_5.jpg",
            "price": 1949670,
            "lan": "en",
            "level": "all",
            "currency": "vnd",
            "isFree": false
        },
        "details": {
            "objectives": [
                "Learn how to get into the Agile mindset and achieve success in helping organizations evolve",
                "Command a strong focus on delivering customer value and exceeding expectations",
                "Master popular Agile frameworks Scrum, Kanban, and Scrumban, enabling you to land and excel in any Agile position",
                "Explore fun, interactive, and highly effective lessons from best-selling instructors",
                "Assist with your organization's current, or future, transformation to Agile"
            ],
            "requirements": [
                "No experience is necessary - this course will teach you Agile concepts from the ground up!"
            ],
            "description": "<p><strong>Make yourself a more valuable member of the team by learning how to help organizations make changes faster and with less expense by using Agile approaches.</strong></p><p>In nature, as in business – you adapt, or you die…</p><p>And with over 70% of companies using Agile for their projects, not knowing the fundamental concepts, principles, and values just isn’t an option anymore.</p><p>This course will not only teach you the fundamentals of Agile to help you develop the adaptive mindset, but it will also break down the most popular Agile frameworks such as Scrum, Kanban, and Scrumban.</p><p>That includes:</p><p>- Agile Values<br>- Agile Principles<br>- Benefits of Agile<br>- Challenges<br>- Roles in Agile<br>- User Stories<br>- Scrum Framework<br>- Sprints<br>- Scrum Ceremonies<br>- Product Backlog<br>- Sprint Backlog<br>- Estimation Techniques<br>- Team Velocity<br>- Burndown Charts<br>- Burn Up Charts<br>- Kanban Principles<br>- Setting Work in Progress (WIP) Limits<br>- Kanban Boards ...<em>and more!</em></p><p>Taught with practicality and authenticity in mind, this to-the-point course brings you real-life work examples (both failures and successes) to make your learning stick.</p><p><em>Course enrollment grants you lifetime access, with no expiration, to all the course lectures, activities, handouts, and quizzes. In addition, you’ll also receive 1-on-1 support for any questions or uncertainties that come up. And this all comes with a </em><strong><em>money-back guarantee</em></strong><em>. You have nothing to lose and so much knowledge to gain.</em></p><p><br></p><p><strong>Just ask the students who’ve already taken this course:</strong></p><p> “This course is awesome! I am a beginner, I just started exploring Agile and Scrum, and after this course I feel like I'm ready to implement things. Thank you so much. Great work!” <strong>– Dubravka</strong></p><p> “The course structure is a lot more than I was expecting regarding features. I can also make notes during the video without pausing or falling behind. I'm […] impressed with how the sections are broken down and have been placed into chronological order to help with understanding.” <strong>– Laura</strong></p><p> “Through my Agile journey, this is one of the top courses I have taken. Why? I enjoy this course because it goes over a large scheme of topics that are specific and useful, but also given to the learner in bite sized pieces.. This course is especially helpful if you are working in an Agile Team or looking to implement Agile into a team. I have a much clearer understanding on the ceremonies, structure of a team, team responsibilities and reasoning behind different pieces of software, such as Jira. I have gained a lot of knowledge from the course, quizzes, and activities that Jeremy and Vivek put together. I can absolutely see myself implementing what I have gained from this course into my team and future teams. Thanks for creating an easy to follow course!!” <strong>- Meghann</strong></p><p><br></p><p><strong>Learn how Agile works as well as how it fits into the world of Business Analysis</strong></p><p>This course is taught by <strong>two </strong>instructors, to ensure you get <strong>total </strong>coverage of the subject.</p><p>Jeremy Aschenbrenner (The BA Guide) is an expert in the Business Analysis field who will help you understand the part Agile plays in the Business Analyst role…</p><p>Vivek Khattri (The Agile Coach) is a highly experienced Agile practitioner and trainer whose expertise will give you a comprehensive understanding of Agile, Agile Mindset, and different Agile frameworks and practices…</p><p>And together, not only will our varying perspectives give you a 360-degree understanding of Agile fundamentals, our varied content formats will enhance your learning experience and help you retain the concepts you learn.</p><p><br></p><p><strong>Let’s hear from some more students:</strong></p><p> “I was certified as a Scrum Master over a decade ago and had been away from using scrum in a product management role for several years. This course helped me quickly regain an overview of the key principles and remind me of all of the artifacts and other key practices to put scrum to use again. I highly recommend this course to anyone who wants to understand Scrum or Kanban.” <strong>– John</strong></p><p> “Training by Jeremy and Vivek was awesome. They were able to explain in detail about all the concepts which will help anyone to understand and try to implement these practices. The good thing about Jeremy is his technique to break into pieces and explaining to avoid confusion. Look forward to learning more from you guys in the future lectures.” <strong>- Venkatesh</strong></p><p><br></p><p><strong>What’s included in the course?</strong></p><p>- <strong>High-Quality Video Lectures </strong>break down the complex terms and confusing Agile jargon to ensure you get a concrete understanding of the items being discussed</p><p>- <strong>Downloadable Handouts </strong>help you to enhance your understanding and retention of the key concepts</p><p>- <strong>Quizzes and Activities </strong>validate your learning and help to point out areas that should be reviewed for full comprehension</p><p>- <strong>1-on-1 Support </strong>means that any confusion or questions you have can be addressed and cleared up easily (no more frantically googling trying to figure out what your course instructor means).</p><p>- <strong>Lifetime Access with NO Expiration </strong>so you can learn at your own pace, and come back at any time you feel unsure or are in need of a refresher</p><p><br></p><p> “Not only the theoretical part associated to the Scrum Framework is good, but Jeremy and Vivek's experience, that is invaluable, thanks for that guys! [...] Jeremy and Vivek explained the terms and concepts in a logical and simple order way so it was much much easy to me to catch on all these concepts once and for all. Congrats to both!” <strong>– Silvia</strong></p><p> “While not 100% new to Agile, it had been some time since I worked in the environment so as a refresher this course is perfect. I also feel this would be a great course for beginners. The videos are clear and easy to listen to, with a good pace. I like the inclusion of printable material as it is true, when you write something down, you remember it easier. Well done Vivek and Jeremy.” <strong>- Shelly</strong></p><p><br></p><p><strong>What ELSE is included in the course?</strong></p><p>And of course, anyone who has studied one of Jeremy’s courses before will know, it simply wouldn’t be a course by The BA Guide if I didn’t include some value-packed bonus material!</p><p>Here’s what you get as complimentary extras with the <strong>Agile</strong> <strong>Fundamentals </strong>course:</p><p>- The Agile Principles Handout and Infographic<br>- Sample User Stories<br>- Scrum Terms Worksheet<br>- Scrum Terms Retention Worksheet<br>- Checklist for starting Kanban with your team<br>- Digital Kanban board setup instructions<br>- Agile Word Search<br>- Agile Terms Crossword Puzzle</p><p><br></p><p><strong>Still not convinced?</strong></p><p>And if you’re <strong><em>still </em></strong>not sure – here’s my promise to you:</p><p>This course comes with a <strong>30-day money-back guarantee! </strong>That means, if you aren’t completely satisfied with your purchase, I’ll give you a refund – no questions asked!</p><p><strong>By the end of this course, you’ll have a working understanding of the fundamentals of Agile as well as its most popular frameworks, setting you up to be the agile, adaptive Business Analyst every modern organization needs.</strong></p><p>As one of my favorite ancient Chinese proverbs says, “when the winds of change blow, some build walls, others build windmills”.</p><p>With disruptive technology evolving at a faster rate than ever before, the winds of change are blowing.</p><p>Hard.</p><p>So, if you’re ready to build windmills, <strong>enroll today</strong> and get started learning the fundamentals of Agile.</p>",
            "suitableLearners": [
                "Those interested in working within an Agile team - such as aspiring Business Analysts, Project Managers, Product Owners, Scrum Masters, Developers, Quality Assurance, and similar.",
                "Current Agile team members that want to deepen their understanding of the Agile processes or learn a new framework (Scrum, Kanban, or Scrumban).",
                "Current non-Agile team members whose organization is making, or is considering, the switch to Agile frameworks",
                "IT and business leadership charged with adapting and innovating their project methodologies to keep them competitive"
            ],
            "sections": []
        },
        "messages": {
            "welcome": "",
            "congratulations": ""
        },
        "history": {
            "createdAt": "2022-03-31T00:00:00.000Z",
            "createdBy": "622c1f382e96f2828a7dae2d",
            "publishedAt": "2022-04-03T00:00:00.000Z"
        },
        "promotions": {
            "discountPrice": 275280,
            "startAt": "2022-01-31T17:00:00.000Z",
            "endAt": "2023-01-31T17:00:00.000Z",
            "enabled": true
        }
    },
    {
        "status": "active",
        "categories": [
            "625e7f939c9b04f3f624d66b",
            "625e7ff99c9b04f3f624d6bf"
        ],
        "topics": [],
        "reviews": [],
        "meta": {
            "ratingCount": 28916,
            "studentCount": 225136,
            "avgRatingScore": 4.505809,
            "contentVideoLength": 7223
        },
        "basicInfo": {
            "udemyCourseId": 362632,
            "slug": "scrum-certification-2022-scrum-master-agile-scrum-training",
            "title": "Scrum Certification 2022 +Scrum Master+ Agile Scrum Training",
            "subtitle": "Overview of Scrum Agile project management+common questions+tips to pass PSM scrum org ONLINE Scrum Master Certification",
            "image": "https://img-c.udemycdn.com/course/240x135/362632_4f4f_2.jpg",
            "price": 1949670,
            "lan": "en",
            "level": "all",
            "currency": "vnd",
            "isFree": false
        },
        "details": {
            "objectives": [
                "Learn what scrum is and why it is so powerful for delivering even the most complex project on time.",
                "Feel confident in sitting the Scrum Open Assessment prior to sitting Scrum Certification",
                "Explain what the Scrum practices are",
                "Understand techniques to deliver your project on time",
                "Explain the difference between Agile and Scrum",
                "Explain what the Waterfall Model is and Why it is less flexible than Agile",
                "Understand what Agile is & How it differs from Scrum",
                "Explain the difference between roles, events and artefacts",
                "Understand what was updated in the latest version of the scrum guide"
            ],
            "requirements": [
                "There are no pre-requesites for this course.  I explain everything from the ground up"
            ],
            "description": "<p><br></p><p>&nbsp; \t<strong><em>\"Scrum Open,&nbsp;Professional Scrum™, Professional Scrum Master™, PSM, PSM I, PSM 1, etc. is the protected brand of Scrum . org. Our course and practice exams are neither endorsed by nor affiliated with Scrum . org.\"<br>&nbsp; \t</em></strong>&nbsp; </p><p>&nbsp; \t<strong>Three reasons to TAKE THIS COURSE right now!</strong>&nbsp; </p><p>&nbsp; \t&nbsp; &nbsp; The unique reasons for taking this course are:&nbsp; </p><ol><li><p>Complete, Concise, Confident Overview of&nbsp; Scrum - You will be confident that you have learned Scrum as the founders intended because I only teach accurately from the rule-book of Scrum. </p></li><li><p>Confidence in completing a Scrum Certification - I teach you everything you need to gain confidence in the exam and then guide you on how to get certified online without going into a class room or spending $1000. I send you to the Scrum Open Assessment so you can practice before taking the final certification (Exam purchased separately - I will give you links directly to it). </p></li><li><p>You get to ask me questions and see me respond to every single one of them thoughtfully!</p></li></ol><p>Updated for 2022 / 2021 using the newest v 2020 Scrum guide. Perfect for [2020] Scrum Guide exam preparation! This course is based on the </p><p>Includes Narration from Ted R. Brown</p><p> <strong>What is Scrum?</strong> <br></p><p>&nbsp; \t&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Agile Scrum is a simple method for managing and completing even the most complex project.&nbsp; Based on my experience, it has also been the number one reason why projects have delivered on time!&nbsp; </p><p>&nbsp; \t<strong>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Who should take is course?&nbsp; </strong>&nbsp; </p><p>&nbsp; \t&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Whether you are a scrum master, product owner, team member, business stakeholder or simply someone who wants to understand what makes scrum tick, this is the place to start.&nbsp; If you are preparing for a scrum master certification or other scrum certification, this class is for you.&nbsp; </p><p>&nbsp; \t<strong>What will I learn?</strong>&nbsp; </p><p>&nbsp; \t&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; In this class you will learn:&nbsp; </p><ul><li><p>Concise overview of Scrum - The exact events, roles, rules and artefacts used to deliver a project using scrum along with the history of Scrum.&nbsp; This includes lectures on the fundamentals of Sprint Planning, The Daily Scrum, Sprint Review, Sprint Retrospective, Scrum Artefacts and more.</p></li><li><p>The facts based on the Scrum Guide - The correct terminology and use of Scrum is essential to mastering it. The Scrum Guide is the rule book on Scrum and many do not use it or know it.</p></li><li><p>Scrum Certification Preparation - A summary of frequently asked questions (FAQs) and frequently misunderstood points around Scrum that have been in past Open Assessment exams. </p></li><li><p>Scrum Certification - I then tell you how to prepare for Scrum Certification and how to sit it online saving you hundreds if not thousands of dollars.</p></li></ul><p>&nbsp; \t&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The course is video based with no supporting document necessary.&nbsp; I go through key gotchas from the scrum guide.&nbsp; </p><p><br></p><p>The perfect recap for experts and scrum for beginners + Scrum Master Certification Preparation</p><p>Learn Scrum &amp; prepare for your Scrum Master or Agile certification based on the Scrum Guide™ v2020&nbsp; ( 2020 scrum guide&nbsp; ) .</p><p>&nbsp; \t<strong>How is the course structured?</strong>&nbsp; </p><p>&nbsp; \t&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Each section features an overview of a particular aspect of Scrum such as Scrum Roles, Events, or Artefacts, followed by a summary of key exam points and frequent misunderstandings in industry.&nbsp; All is based on the scrum guide so you know that you are learning the facts.&nbsp; </p><p>Perfect if you are interested in Scrum Master Certification, Scrum Master Jobs, increasing your Scrum Master Salary, gaining a Scrum Master Role, furthering your Scrum Master Training or meeting a Scrum Master job description.</p><p>Inspired by God, the Bible, Ken Schwaber, Jeff Sutherland</p><ul><li><p><br></p></li></ul>",
            "suitableLearners": [
                "Anyone who wants a complete overview of Scrum and certainty that they are getting the facts",
                "A candidate  preparing for a Scrum certification",
                "A candidate who wants answers to frequently misunderstood points within Scrum",
                "An expert candidate who wants a concise, quick refresher in scrum"
            ],
            "sections": []
        },
        "messages": {
            "welcome": "",
            "congratulations": ""
        },
        "history": {
            "createdAt": "2022-04-17T00:00:00.000Z",
            "createdBy": "622c1f382e96f2828a7dae2d",
            "publishedAt": "2022-04-20T00:00:00.000Z"
        },
        "promotions": {
            "discountPrice": 275280,
            "startAt": "2022-01-31T17:00:00.000Z",
            "endAt": "2023-01-31T17:00:00.000Z",
            "enabled": true
        }
    },
    {
        "status": "active",
        "categories": [
            "625e7f939c9b04f3f624d66b",
            "625e7ff99c9b04f3f624d6bf"
        ],
        "topics": [],
        "reviews": [],
        "meta": {
            "ratingCount": 23071,
            "studentCount": 75173,
            "avgRatingScore": 4.563397,
            "contentVideoLength": 11960
        },
        "basicInfo": {
            "udemyCourseId": 946742,
            "slug": "beginning-project-management-project-management-level-one",
            "title": "Beginning Project Management: Project Management Level One",
            "subtitle": "Project Management: Growing a Successful Career as a Project Manager",
            "image": "https://img-c.udemycdn.com/course/240x135/946742_7dc0_2.jpg",
            "price": 1720270,
            "lan": "en",
            "level": "all",
            "currency": "vnd",
            "isFree": false
        },
        "details": {
            "objectives": [
                "Compare and contrast the project management process groups",
                "Explain what a project is (and is not)",
                "Explain how to initiate a project",
                "Work with the project team to plan a project",
                "Oversee the project execution",
                "Monitor and control the project activities",
                "Close out a phase or a project",
                "Define the roles and responsibilities of a successful project manager"
            ],
            "requirements": [
                "Willingness to learn",
                "Acknowledgement that we all start somewhere",
                "Can-do attitude to finish the course"
            ],
            "description": "<p>Project management is an exciting place to be. Project managers help shape the success of organizations, implement new technology, change the business landscape, and have influence over all areas of a business. Project managers also earn a nice income and often move up the organizational chain into full-time management positions.\n\n  </p>\n\n<p>In this course we’ll examine the absolute basics of project management. Everyone has to start somewhere, right? In this fundamental course we will explore the big picture of project management and the project management life cycle. You’ll finish this course with a great grasp of what project management is, what your roles and responsibilities as a project manager will be, and how to move forward in your career as a project manager.\n\n  </p>\n\n<p>This course is designed for people that are new to project management. This course is structured to give you a solid foundation of project management and to help you speak the project management language. Don’t worry – this course is easy to follow, has a logical approach, and it has a fun, can-do attitude in its delivery.\n\n  </p>\n\n<p>Projects use processes to move things forward. These processes are universal to all projects regardless of the industry you may work in. These processes are grouped into logical chunks and that’s our primary focus of the course. You’ll learn the major components of the project management lifecycle: \n\n  </p>\n\n<ul><li>Initiating the project</li><li>Planning the project</li><li>Executing the project</li><li>Monitoring and controlling the project</li><li>Closing the project</li></ul>\n\n\n\n\n\n\n\n\n\n<p>Finally, this course includes several templates you can download and begin using in your projects. I’ll also show you how you can build many of your own project management documents. Let’s get started right now on your project management career.</p>",
            "suitableLearners": [
                "Absolute beginners in project management",
                "People launching their project management career",
                "Project team members seeking a better understanding of project management",
                "Don't take this course if you're an experienced project manager looking for advanced scientific analysis and philosophies of project management. You'll be sad."
            ],
            "sections": []
        },
        "messages": {
            "welcome": "",
            "congratulations": ""
        },
        "history": {
            "createdAt": "2021-11-09T00:00:00.000Z",
            "createdBy": "622c1f382e96f2828a7dae2d",
            "publishedAt": "2021-11-12T00:00:00.000Z"
        },
        "promotions": {
            "discountPrice": 275280,
            "startAt": "2022-01-31T17:00:00.000Z",
            "endAt": "2023-01-31T17:00:00.000Z",
            "enabled": true
        }
    },
    {
        "status": "active",
        "categories": [
            "625e7f939c9b04f3f624d66b",
            "625e7ff99c9b04f3f624d6bf"
        ],
        "topics": [],
        "reviews": [],
        "meta": {
            "ratingCount": 19844,
            "studentCount": 65101,
            "avgRatingScore": 4.6929936,
            "contentVideoLength": 139921
        },
        "basicInfo": {
            "udemyCourseId": 1759114,
            "slug": "pmp-certification-exam-prep-course-35-pdu-contact-hourspdu",
            "title": "PMP Certification Exam Prep Course 35 PDU Contact Hours/PDU",
            "subtitle": "Get your PMP Certification with this course. Fully updated for the 2021 PMP Exam",
            "image": "https://img-b.udemycdn.com/course/240x135/1759114_873a_12.jpg",
            "price": 1949670,
            "lan": "en",
            "level": "all",
            "currency": "vnd",
            "isFree": false
        },
        "details": {
            "objectives": [
                "PMBOK Guide 7th Edition, PMBOK Guide 6th Edition, Agile Practice Guide",
                "35 Hours of project management education/training",
                "Students will learn to pass the PMP Certification Exam on the first try.",
                "All 49 PMBOK processes will be covered in depth",
                "All EVM, communication, and estimating formulas",
                "Exam tips and tricks",
                "Introduction to agile project management",
                "400+ Exam Like Questions"
            ],
            "requirements": [
                "No requirements."
            ],
            "description": "<p><strong>This course has been fully updated for the 2021 PMP&nbsp;exam and is now over 35 hours of content with 440</strong>+<strong> video's. </strong></p><p><strong>Covers<em> PMBOK&nbsp;Guide 7th</em> <em>Edition</em>,<em> PMBOK&nbsp;Guide 6th Edition</em>, Agile Practice Guide, and more.&nbsp; </strong></p><p>Passing the PMP certification&nbsp;exam is a must for any individual looking to move up the corporate ladder in any company. This course will cover all the topics needed to pass your PMP&nbsp;exam on the first try. This courses includes coverage of traditional, Agile and hybrid projects. </p><p>This course is taught by Instructor and PMP&nbsp;author Andrew Ramdayal. Andrew has over 60 certifications and has authored a few bestselling books for the PMP&nbsp;exam. Andrew has taught this course to thousands of students around the world both in the classroom and online. </p><p>This course will include the following:</p><ul><li><p><strong>35 Hours of project management education needed to take your PMP&nbsp;exam.</strong></p></li><li><p><strong>Based on the 2021 PMP&nbsp;Examination Content Outline</strong></p></li><li><p><strong>38+ Hours of expert instruction from a certified PMP&nbsp;Instructor and one of Amazon best selling authors for the PMP&nbsp;exam books.</strong></p></li><li><p><strong>420+&nbsp;Videos</strong></p></li><li><p><strong>400+&nbsp;realistic exam questions</strong></p></li><li><p><strong>Course Slides and PDF's with all the processes and formulas </strong></p></li><li><p><strong>Expert instructions with filling out the PMP&nbsp;application</strong></p></li><li><p><strong>Full length mock exam</strong></p></li></ul><p>Every year we help thousands to pass their PMP certification exam&nbsp;and we can help you also. This course is presented by TIA&nbsp;Education Group and taught by instructor Andrew Ramdayal. </p>",
            "suitableLearners": [
                "All students looking to become PMP Certified."
            ],
            "sections": []
        },
        "messages": {
            "welcome": "",
            "congratulations": ""
        },
        "history": {
            "createdAt": "2022-01-15T00:00:00.000Z",
            "createdBy": "622c1f382e96f2828a7dae2d",
            "publishedAt": "2022-01-18T00:00:00.000Z"
        },
        "promotions": {
            "discountPrice": 275280,
            "startAt": "2022-01-31T17:00:00.000Z",
            "endAt": "2023-01-31T17:00:00.000Z",
            "enabled": true
        }
    },
    {
        "status": "active",
        "categories": [
            "625e7f939c9b04f3f624d66b",
            "625e7ff99c9b04f3f624d6bf"
        ],
        "topics": [],
        "reviews": [],
        "meta": {
            "ratingCount": 17797,
            "studentCount": 68298,
            "avgRatingScore": 4.6356835,
            "contentVideoLength": 26217
        },
        "basicInfo": {
            "udemyCourseId": 1978132,
            "slug": "the-project-management-course-beginner-to-project-manager",
            "title": "The Project Management Course: Beginner to PROject Manager",
            "subtitle": "The Complete Course for becoming a Successful Project Manager",
            "image": "https://img-c.udemycdn.com/course/240x135/1978132_e90d_5.jpg",
            "price": 1949670,
            "lan": "en",
            "level": "intermediate",
            "currency": "vnd",
            "isFree": false
        },
        "details": {
            "objectives": [
                "Gain the Project Management knowledge and skills, needed to manage an entire project on your own",
                "Perform a complete Case Study of a Project, from the beginning until its end, observing real-life project scenarios",
                "Receive 15+ Project Management templates and practical documents to help you structure and manage projects",
                "Understand the Project Manager role and acquire the skills needed to become successful in the profession",
                "Study both Waterfall and Agile project management, performed with Scrum",
                "Learn the fundamental theory and best practices of Project Management",
                "MS Excel: learn how to use MS Excel to create the 5 most important project management documents"
            ],
            "requirements": [
                "No prior experience is required. We will start from the very basics",
                "You will need access to Microsoft Office (Word, PowerPoint, Excel) to download and practice with the supplemental course materials"
            ],
            "description": "<p>Project Management is an exciting profession. Moving from one project to another, a Project manager constantly faces new businesses, new processes and systems, new people, and new situations. Such a dynamic environment helps you learn more all the time, and advances your skills much faster than traditional jobs do.</p><p>Developing the ability to structure chaos into a project, along with solid project management knowledge and skills, will make your endeavors more successful than ever – whether it is the performance of a big organization, your own career progression, a new business start-up, or even your personal life projects!</p><p>It’s no surprise that the demand for project managers is expected to be substantial in the years to come.</p><p>Our program is carefully designed to help anyone build knowledge and skills, grow the needed confidence, and start managing projects on their own!</p><p>This online course is unique, as it combines all critical lessons a PM should learn:</p><ul><li><p>Perform a<strong> complete Project Cases Study</strong>, learning what a Project Manager must do from the beginning until the very end</p></li><li><p>Understand the fundamental project management theory, apply best practices and avoid common mistakes in your next project</p></li><li><p>Learn how to use Gantt charts, Critical Path Method, Project Plan, Budget, and many other tools (<strong>GET 15+</strong> project management templates). A brief tutorial on how to use <strong>MS&nbsp;Project</strong> is also included.</p></li><li><p>Gain the professional and personal skills needed to become a great Project Manager</p></li><li><p><strong>MS&nbsp;Excel tutorial</strong>: learn how to create the 5 most important project management documents with MS&nbsp;Excel&nbsp;</p></li><li><p>Learn <strong>Agile</strong> project management</p></li><li><p>Master <strong>SCRUM</strong> and understand how to apply this project management methodology</p></li><li><p><strong>Waterfall or Agile</strong>? Learn the main differences, compare the Pros and Cons, and know which philosophy to apply in your next project</p></li><li><p>Get promoted and apply what you learn here to the real business world, regardless of the industry</p></li></ul><p><strong>Why precisely this course?</strong></p><p><strong>Reason #1: The instructor</strong></p><p>Ivan, the instructor of the course, is a project manager with a proven track record. He is a certified professional project manager (PMI®) with substantial experience in leading multinational projects and programs across different industries. Furthermore, Ivan is a project management tutor, delivering training sessions to companies, individuals, and university students. In this course, Ivan shares valuable practical lessons, diverse experience, and his strong passion for project management!</p><p><strong>Reason #2: 365 Careers</strong></p><p>365 Careers is one of the most popular course providers on Udemy. The average amount of time we spend creating a course is between 5 and 6 months. We take pride in our high-quality production, practice materials, and continued support to our students.</p><p><strong>Reason #3: Udemy</strong></p><p>Udemy is the leading global marketplace for online courses. Here you will find updated content and enjoy a seamless course-taking experience. And, frankly, you will find the best value for money deals on the Internet!</p><p><strong>This course is for anyone!</strong> Our content is highly appreciated by people that are brand new to Project management, and also those who have practical experience in the field, but are looking for a way to refresh and strengthen their knowledge and skills.</p><p>As we named it - <strong>Beginner to PROject manager!</strong></p><p>The Project Management Course covers all the fundamental knowledge, concepts, tools and techniques you need to understand:</p><ul><li><p>How a project works</p></li><li><p>How to best manage it </p></li></ul><p>We will start from the proven theoretical basics and will gradually build upon that knowledge. In each step of the way, we will add real-life practical examples, case studies, and exercises.</p><p>What is unique about this course, compared to similar materials, is that we will be reviewing and analyzing a complete project – from its very beginning until its last day. To put things into perspective, we will examine the key tasks a PM should take at each stage of that process. In addition, you will receive more than 15 project management templates to help you lead projects in different industries.</p><p>&nbsp;<strong>What sets this course apart from the rest of the Business courses out there?</strong></p><ul><li><p>High-quality production – HD video and animations</p></li><li><p>Truly engaging and fun content (This isn’t a collection of boring lectures!)</p></li><li><p>Professional instructor (PMP certified, with years of experience on the job)</p></li><li><p>Complete training – we will cover all major topics and skills you need to become a successful project manager</p></li><li><p>Extensive Case Studies that will help you reinforce everything that you’ve learned</p></li><li><p>Excellent support - if you don’t understand a concept or you simply want to drop us a line, you’ll receive an answer within 1 business day</p></li><li><p>Dynamic learning curve - we don’t want to waste your time! The instructor keeps up a very good pace throughout the whole course</p></li><li><p>Bonus prizes - upon completion of 50% and 100% of the course, you will receive two bonus gifts</p></li></ul><p><strong>Why do you need project management skills?</strong></p><ol><li><p>Promotions – Project managers acquire valuable technical skills, which makes them the leading candidates for senior roles within corporations</p></li><li><p>Salary/Income – A project manager salary in the US starts from $60k and gradually rises as they move up the ladder</p></li><li><p>Secure Future - there is a high demand for skilled project managers, and you won’t have to be concerned about finding a job</p></li><li><p>Growth - this isn’t a boring job. Every day you will face different challenges that will enhance your existing skills and abilities</p></li></ol><p><strong>This course comes with Udemy's 30-day no questions asked money-back guarantee. So, you have nothing to lose! Subscribe to the course and give it a try!</strong></p><p><strong>Click the 'Buy now' button! This will be one of the best decisions in your professional career!</strong></p>",
            "suitableLearners": [
                "Anyone who wants to learn how to manage an entire project on their own",
                "Young professionals and university graduates interested in a project management career",
                "Anyone who wants to develop or enhance their project management knowledge and skills"
            ],
            "sections": []
        },
        "messages": {
            "welcome": "",
            "congratulations": ""
        },
        "history": {
            "createdAt": "2021-09-14T00:00:00.000Z",
            "createdBy": "622c1f382e96f2828a7dae2d",
            "publishedAt": "2021-09-17T00:00:00.000Z"
        },
        "promotions": {
            "discountPrice": 275280,
            "startAt": "2022-01-31T17:00:00.000Z",
            "endAt": "2023-01-31T17:00:00.000Z",
            "enabled": true
        }
    },
    {
        "status": "active",
        "categories": [
            "625e7f939c9b04f3f624d66b",
            "625e7ff99c9b04f3f624d6bf"
        ],
        "topics": [],
        "reviews": [],
        "meta": {
            "ratingCount": 16657,
            "studentCount": 52385,
            "avgRatingScore": 4.614427,
            "contentVideoLength": 84784
        },
        "basicInfo": {
            "udemyCourseId": 1411586,
            "slug": "capm-exam-prep-seminar-pmbok-guide-sixth-edition",
            "title": "CAPM Exam Prep Seminar - PMBOK Guide, Sixth Edition",
            "subtitle": "Pass the CAPM and Earn 25 Contact Hours to Qualify for the CAPM Exam",
            "image": "https://img-c.udemycdn.com/course/240x135/1411586_8ea2_2.jpg",
            "price": 1949670,
            "lan": "en",
            "level": "expert",
            "currency": "vnd",
            "isFree": false
        },
        "details": {
            "objectives": [
                "You will get all the resources you need to pass the PMI CAPM certification exam.",
                "You will earn 25 exam contact hours from a PMI Registered Education Provider.",
                "You will be able to discuss the PMBOK Guide 6th edition with confidence.",
                "Explain the project management processes",
                "Discuss the project management knowledge areas",
                "Demonstrate the formulas, charts, and theories of project management",
                "Calculate float for complex project network diagrams",
                "Memorize the formulas for earned value management",
                "Compare and contrast processes, knowledge areas, theories, and project management best practices",
                "Complete hands-on assignments and exercises"
            ],
            "requirements": [
                "Understand fundamentals of project management",
                "Dedicated to completing this CAPM Exam Prep Seminar",
                "Have a deep desire to pass the CAPM exam"
            ],
            "description": "<p><strong><em>This course is accepted by PMI&nbsp;for your CAPM&nbsp;exam qualifications.</em></strong></p><ul><li><p><strong>Instructingcom, LLC </strong></p></li><li><p><strong>CAPM® Exam Prep Seminar</strong></p></li><li><p><strong>25 contact hours for the CAPM exam application</strong></p></li></ul><p><strong><em>This course&nbsp;has passed a quality audit and a business review, and it completely meets the PMI&nbsp;exam training qualifications.</em></strong></p><p>You need to pass the CAPM&nbsp;exam and you need quality training that'll help you in your role as a project manager. You also want to learn from an authority in project management, in an online environment with plenty of assignments, videos, and concise explanations. This course provides 25 contact hours&nbsp;and is taught by project management author and expert Joseph Phillips. Joseph is the author of several project management books from McGraw-Hill, the American Management Association, and Dummies&nbsp;Press. He is certified as a PMP, PMI-ACP, ITIL, Project+, and is a Certified Technical Trainer.</p><p>The 25 hours of project management education are earned by completing all of the course, the assignments, exercises, and quizzes. The Learning Management System tracks your completion of the course; if you complete all the videos and interactive sessions, you can claim these hours for your CAPM exam application.</p><p><strong>NOTICE:&nbsp;This course is designed for&nbsp;the CAPM exam based on<em>&nbsp;PMBOK&nbsp;Guide, sixth&nbsp;edition</em>.</strong></p>",
            "suitableLearners": [
                "Project managers who are preparing to PASS their PMI CAPM examination",
                "Project managers who want to pass their CAPM exam on the first try",
                "People who want 25 contact hours from a PMI Registered Education Provider"
            ],
            "sections": []
        },
        "messages": {
            "welcome": "",
            "congratulations": ""
        },
        "history": {
            "createdAt": "2021-07-14T00:00:00.000Z",
            "createdBy": "622c1f382e96f2828a7dae2d",
            "publishedAt": "2021-07-17T00:00:00.000Z"
        },
        "promotions": {
            "discountPrice": 275280,
            "startAt": "2022-01-31T17:00:00.000Z",
            "endAt": "2023-01-31T17:00:00.000Z",
            "enabled": true
        }
    },
    {
        "status": "active",
        "categories": [
            "625e7f939c9b04f3f624d66b",
            "625e7ff99c9b04f3f624d6bf"
        ],
        "topics": [],
        "reviews": [],
        "meta": {
            "ratingCount": 12370,
            "studentCount": 63885,
            "avgRatingScore": 4.5031657,
            "contentVideoLength": 75039
        },
        "basicInfo": {
            "udemyCourseId": 555696,
            "slug": "pmp-exam-prep-project-management-professional-certification",
            "title": "PMP Exam Prep Project Management Professional Certification",
            "subtitle": "PMP Certification 2022 - Get 35 PDUs - Project Management Professional - New PMP Exam Training PMBOK 7 - Pmp Course",
            "image": "https://img-c.udemycdn.com/course/240x135/555696_6806_12.jpg",
            "price": 1949670,
            "lan": "en",
            "level": "expert",
            "currency": "vnd",
            "isFree": false
        },
        "details": {
            "objectives": [
                "Complete PMP Certification Training 2022: Everything you need to pass the New PMP Exam easily on your first try.",
                "Earn 35 PDU/Contact Hours Certificate",
                "High Quality Videos and Realistic Practice Exams",
                "Covers the PMBOK, Agile, and PMI's New Exam Content Outline in detail",
                "Learn PMBOK 7 Performance Domains",
                "Simple,Clear,and Concise explanations that help you get ready for the exam as fast as possible",
                "Learn all the Agile Project Management topics for the new PMP exam",
                "Covers both Predictive Project Management and Agile Project Management",
                "Easily Learn PMP Math: Detailed PMP Math Explanations for every topic.",
                "Learn all Project Management Knowledge areas",
                "Learn all 49 PMBOK Project Management Processes",
                "Learn all Formulas Easily : EVM,Critical Path,CPI,SPI,CV,SV,Float",
                "Learn all the essentials of Project Management and how to manage projects like a pro"
            ],
            "requirements": [
                "Your dedication and passion for passing the PMP exam"
            ],
            "description": "<p><strong>Fully updated for the New PMP Exam 2022. Pass the PMP&nbsp;Certification exam with quality training based on PMI's Exam Content Outline, PMBOK 7, PMBOK 6, and Agile. </strong>With over 12,000 ratings, this is the <strong>Most Clear and Concise PMP Training course </strong>for the<strong> </strong>PMP (Project Management Professional) Certification Exam. </p><p>This course <strong>contains all the topics you need to know to pass the PMP</strong> in a step by step and simple to understand manner. You can also use this course to <strong>become an excellent project manager</strong>.</p><p>This Udemy PMP course contains videos, practice tests, quizzes and a certificate of completion. Plus, you will get <strong>Lifetime access</strong> and <strong>Free course updates.</strong> You will never have to buy another PMP&nbsp;course again, and it is the only course you will need to prepare for PMP.</p><p><br></p><p><strong>What you will get in this course:</strong></p><ul><li><p><strong>Based on the New PMP Exam Content Outline 2022 </strong>- The course covers <strong>Traditional/Predictive </strong>+ <strong>Hybrid</strong> + <strong>Agile Project Management + Performance Domains (PMBOK 7)</strong></p><p><br></p></li><li><p><strong>35 PDU's/Contact Hours</strong> <strong>Certificate </strong>-<strong> </strong>Receive the 35 pdu certificate for the PMP exam application.</p><p><br></p></li><li><p><strong>High Quality Video lectures </strong>- The course contains over 360 videos, each of which covers a different topic as required by the syllabus.</p><p><br></p></li><li><p><strong>Realistic Practice Exams and Quizzes </strong>- The course contains over 300 high quality questions which cover the most important topics.</p><p><br></p></li><li><p><strong>Clear,Concise, Simple to Understand </strong>- My course explains everything in simple language with precise lectures.</p><p><br></p></li><li><p><strong>Pass the PMP On Your First Attempt </strong>- That is my Promise<strong> </strong>to you.</p><p><br></p></li><li><p><strong>PMBOK Content </strong>- Covers the PMBOK in detail, including all domains, process groups, knowledge areas and performance domains.</p><p><br></p></li><li><p><strong>Agile Project Management</strong> - A completely new section has been added that covers Agile project management in detail.</p><p><br></p></li><li><p><strong>Lifetime access - </strong>The course is yours for life, there is no expiration date</p><p><br></p></li><li><p>You can also use this course to prepare for the<strong> CAPM exam</strong>.</p><p><br></p></li><li><p>Learn how to manage projects and become a better project manager.</p><p><br></p></li></ul><p><strong>Why this course is unique?</strong></p><p>My course will take you <strong>step by step </strong>and help you <strong>focus on the most important and relevant concepts for passing the exam.</strong></p><p>This is <strong>a Complete PMP Prep Course </strong>so we will <strong>cover everything</strong> you need to know to pass the exam. You will learn every important topic from the New Exam Content Outline, PMBOK, and Agile Project Management.</p><p>Furthermore,I have discussed <strong>PMP Math</strong> in detail through step by step explanations.</p><p>The PMP certification by the PMI is a Gold Standard for Project Managers across the world. However ,preparing for the PMP®&nbsp; Exam<strong> </strong>can be a difficult and time consuming task. Most PMP Aspirants struggle to balance their personal/professional life with their preparation for the exam. </p><p>This course aims to overcome the challenge by preparing you with all the necessary concepts in a precise and focused manner to <strong>get you ready for the PMP&nbsp;Exam as early as possible.</strong></p><p><br></p><p><strong>Why you should choose this course and not others?</strong></p><p>Prepare Yourself For The PMP Certification quickly with this focused and comprehensive course.</p><ul><li><p><strong>This is a Complete Course developed with a focused goal on passing the exam</strong> - You will get to learn every syllabus topic in its own separate video. Don't worry , You will not have to waste any time exploring irrelevant information.</p></li></ul><ul><li><p><strong>My lectures are delivered in a friendly, simple, and easy to understand manner</strong> - You will have fun learning the concepts because i have kept the lectures to be as light, easy, and painless to understand. We will aim to enjoy ourselves while preparing and keep boredom far&nbsp;away. </p></li></ul><ul><li><p><strong>You will learn individual concepts with dedicated videos</strong> - All important concepts have been covered through individual videos so you can simply jump to the topic that you want to learn.</p></li></ul><ul><li><p><strong>Detailed PMP Math</strong> - You will get to learn all PMP Math concepts through separate videos with sample questions that explain the concepts in detail from the exam perspective.</p></li></ul><ul><li><p><strong>Special exam tips </strong>- Secret tips and techniques to pass the exam are shared throughout the course.</p></li></ul><ul><li><p><strong>Become a better project manager</strong> - By learning all the essential concepts, you will learn to manage projects like a professional.</p></li></ul><p><br></p><p><strong>What topics will we cover?</strong></p><p>We will cover all the topics required by the new PMP exam syllabus. </p><p><strong>1. Traditional / Predictive&nbsp;Project Management</strong></p><p>We will cover all the major concepts, phases and knowledge areas of traditional project management.</p><ul><li><p>Integration Management</p></li><li><p>Scope Management</p></li><li><p>Schedule Management</p></li><li><p>Cost Management</p></li><li><p>Quality Management</p></li><li><p>Resource Management</p></li><li><p>Communication Management</p></li><li><p>Risk Management</p></li><li><p>Procurement Management</p></li><li><p>Stakeholder Management</p><p><br></p></li></ul><p><strong>2. Agile Project Management</strong></p><p>We will cover Agile and its most famous methodology Scrum in detail.</p><ul><li><p><strong>Agile Events</strong></p><ul><li><p>Sprint Planning</p></li><li><p>Daily Scrum</p></li><li><p>Sprint Retrospective</p></li><li><p>Sprint Review</p></li></ul></li><li><p><strong>Agile Roles</strong></p><ul><li><p>Product Owner</p></li><li><p>Scrum Master</p></li><li><p>Development Team</p></li></ul></li><li><p><strong>Agile Artifacts</strong></p><ul><li><p>Product Backlog</p></li><li><p>Sprint Backlog</p></li><li><p>Increment</p></li></ul><p><br></p></li></ul><p><strong>3. New Exam Content Outline by PMI</strong></p><p>We will cover the three new domains by exploring all the tasks associated with the domains.</p><ul><li><p>People</p></li><li><p>Process</p></li><li><p>Business Environment</p></li></ul><p>The broad task categories include:</p><ul><li><p>Create a High Performing Team</p></li><li><p>Keep your team on track</p></li><li><p>Get started with your project</p></li><li><p>Do the work</p></li><li><p>Keep the business in mind</p></li></ul><p><br></p><p><strong>4.&nbsp; Performance Domains</strong></p><ul><li><p>Stakeholders</p></li><li><p>Team</p></li><li><p>Development Approach and Life Cycle</p></li><li><p>Planning</p></li><li><p>Project Work</p></li><li><p>Delivery</p></li><li><p>Measurement</p></li><li><p>Uncertainty</p></li></ul><p><br></p><p><strong>What students say about my course:</strong></p><p>\"<strong>Happy to say that I passed the test</strong>! This course is a very good summary of all you need to know for the exam - Siby Chemplayil</p><p>\"This course is a fantastic resource to get up to speed with the all the concepts and information you need for the exam. It's<strong> really clear and easy to watch</strong>.\" - Jakob Andrew</p><p>\"I'm<strong> impressed by Umer's ability to break the content down into easily digestible bits</strong>. His course is very neatly essentialized; it keeps its focus on exactly what a PMP aspirer needs to know!\" Marvin Logan</p><p>\"This training has <strong>complete information about project management </strong>and contains excellent knowledge sharing. The presenter's style of training is easy and relaxed with a sustained pace . Thank you for your best effort!\" - Sarika Parihar</p><p>\"The instructor provides clarity to difficult concepts and takes an<strong> in-depth review </strong>when necessary to understand the concepts. Good examples are provided along with breaking down terminology for full understanding.\" - Bobby Smith</p><p><br></p><p>This course comes with a 30 day, no questions asked, full money back guarantee.</p><p>So click on the \"Buy now\" button to your right and let's get you fully prepared to pass the PMP exam on your first try!!</p><p><br></p><p>Disclaimer: PMI, PMBOK, and PMP are registered trademarks of Project Management Institute.</p>",
            "suitableLearners": [
                "Anyone who want's to prepare for and pass the PMP exam.",
                "Project Management Professionals",
                "People who want to learn how to manage projects",
                "For people who would like to learn about Project Management and PMP Concepts quickly and effectively",
                "Experienced project managers who want to refresh their project management concepts"
            ],
            "sections": []
        },
        "messages": {
            "welcome": "",
            "congratulations": ""
        },
        "history": {
            "createdAt": "2022-03-24T00:00:00.000Z",
            "createdBy": "622c1f382e96f2828a7dae2d",
            "publishedAt": "2022-03-27T00:00:00.000Z"
        },
        "promotions": {
            "discountPrice": 275280,
            "startAt": "2022-01-31T17:00:00.000Z",
            "endAt": "2023-01-31T17:00:00.000Z",
            "enabled": true
        }
    },
    {
        "status": "active",
        "categories": [
            "625e7f939c9b04f3f624d66b",
            "625e7ff99c9b04f3f624d6bf"
        ],
        "topics": [],
        "reviews": [],
        "meta": {
            "ratingCount": 10864,
            "studentCount": 24739,
            "avgRatingScore": 4.6352363,
            "contentVideoLength": 8671
        },
        "basicInfo": {
            "udemyCourseId": 2355488,
            "slug": "project-management-fundamentals",
            "title": "Project Management Fundamentals",
            "subtitle": "Practical Project Management worked example using Gantt Charts, PMI, PMP, APM",
            "image": "https://img-c.udemycdn.com/course/240x135/2355488_dc36.jpg",
            "price": 1949670,
            "lan": "en",
            "level": "expert",
            "currency": "vnd",
            "isFree": false
        },
        "details": {
            "objectives": [
                "Feel confident applying Project Management theory to your real life project",
                "Be able to manage a successful project even with zero experience in that industry",
                "Build a Gantt chart using no specialist software (just Excel and Post-it Notes)",
                "Use the PMP or PMI method to do Project Management",
                "Measuring whether you're on budget and on time - and how to fix it if you're not",
                "Learn how to make a Gantt Chart and a PERT diagram with ease",
                "Feel calm and effective in running a project of any size in any industry"
            ],
            "requirements": [
                "Nothing - just a willingness to learn!",
                "We will use Excel Spreadsheets in the course so having that (or a similar tool) will be necessary",
                "Having a project in mind would be helpful"
            ],
            "description": "<p><strong>Project Management Fundamentals</strong></p><p><em>Practical Project Management worked example using Gantt Charts, PMI, PMP, APM</em><br></p><p>Project Management is an incredibly powerful skill, and pretty much everything in the world relies on it! The Olympics, developing a new disease cure, putting a man on the moon, launching a new product range, or even just planning a birthday party - if you can master Project Management you can lead any project of any size with the same simple process. However, amazingly, most people are never taught it, and those who are will often be shown an overcomplicated and overwhelming version with confusing software and detailed maths. Instead, in this course, you’ll be walked through <strong>step by step</strong> on how to simply and effectively manage any project, in any industry, with any budget.</p><p><br></p><p>The Project Management process taught in this Project Management Fundamentals course is the APM (aka PMP or PMI) method. It’s based on decades of academic research and is widely accepted as the ultimate Project Management solution. The difference with this course is that it’s a live work-along version - so <strong>we will plan a real-life project together</strong> and show you how simple and effective the tools are. You’ll learn how to make a PERT diagram with Post-it notes, and a Gantt Chart using only Excel. Say goodbye to overcomplicated Prince2 or Agile, and enjoy the <strong>simplicity of this 12 Step Process</strong>. This course covers detailed tips for excellent planning using Gantt Charts and PERT diagrams, managing a team, avoiding overspend, predicting risks and dealing with multiple stakeholders.</p><p><br></p><p>After this course, you will feel calm, collected, well prepared and confident that your project will be a success. You’ll know how to come in <strong>on time, on budget, and with a very happy boss</strong>. We look at lots of real-life project management examples (some of which will definitely get you laughing) and give you practical tools you can use right away to get better results in your projects. Whether you're managing a small at-home project or an entire global corporate expansion this course will empower you as someone who is always one step ahead.</p><p><br></p><p>Chris Croft is an international speaker, and widely published author, who's been teaching Project Management to companies for over 20 years. He's taught all over the world, as well as online, and has an entertaining and practical teaching style. This course is guaranteed to keep you engaged and amused, and teach you life-changing skills for home and work.</p><p><br></p><p><em>The course overview includes:</em></p><ul><li><p>A step by step “real-time” project planned out before your eyes</p></li><li><p>Create a Gantt Chart using only Excel, and a PERT diagram using just Post-It notes</p></li><li><p>Templates and tools to plan your own project simply and effectively</p></li><li><p>Common mistakes which will instantly set your project up to fail</p></li><li><p>What makes a great project manager</p></li><li><p>Be able to manage a successful project even with zero experience in that industry</p></li><li><p>Predicting which tasks are crucial to your project timing</p></li><li><p>Measuring whether you're on budget and on time - and how to fix it if you're not</p></li><li><p>Feel calm and effective in running a project of any size in any industry</p></li><li><p>This course does not look at Agile or Prince in detail - but something better!</p></li><li><p>And lots lots more!<br></p></li></ul><p>By becoming great at Project Management, not only will you pave the way for a future promotion, but you'll also have saved your company thousands!</p>",
            "suitableLearners": [
                "Anyone managing a project (now or soon) - whether big or small",
                "People who find project management stressful - or feel their projects often run late or overspend",
                "Those who want to run smooth, efficient and impressive projects - and level up their career",
                "Someone who wants to do Project Management in their future career",
                "This course does not teach Agile or Prince - but something even better!"
            ],
            "sections": []
        },
        "messages": {
            "welcome": "",
            "congratulations": ""
        },
        "history": {
            "createdAt": "2020-12-04T00:00:00.000Z",
            "createdBy": "622c1f382e96f2828a7dae2d",
            "publishedAt": "2020-12-07T00:00:00.000Z"
        },
        "promotions": {
            "discountPrice": 275280,
            "startAt": "2022-01-31T17:00:00.000Z",
            "endAt": "2023-01-31T17:00:00.000Z",
            "enabled": true
        }
    },
    {
        "status": "active",
        "categories": [
            "625e7f939c9b04f3f624d66b",
            "625e7ff99c9b04f3f624d6bf"
        ],
        "topics": [],
        "reviews": [],
        "meta": {
            "ratingCount": 10841,
            "studentCount": 28074,
            "avgRatingScore": 4.4501896,
            "contentVideoLength": 5717
        },
        "basicInfo": {
            "udemyCourseId": 1352388,
            "slug": "agile-business-analysis",
            "title": "Agile Business Analysis",
            "subtitle": "Developing the analysis maturity and confidence you need... to deliver products in an agile way...",
            "image": "https://img-c.udemycdn.com/course/240x135/1352388_2dbf.jpg",
            "price": 2064370,
            "lan": "en",
            "level": "expert",
            "currency": "vnd",
            "isFree": false
        },
        "details": {
            "objectives": [
                "Understand how Agile works and why it's such a big deal",
                "Understand your role on the agile team",
                "Write effective user stories and acceptance criteria",
                "Develop backlogs that translate into awesome products",
                "Use story mapping to simplify your workslate"
            ],
            "requirements": [
                "Fundamental knowledge of business analysis",
                "Motivation to learn new skills and apply them to the workplace"
            ],
            "description": "<p>Business Analysts have a wide range of feelings about Agile.</p>\n\n<p>Some love it. It’s a fast and nimble way to develop products, and you can be very productive in relatively little time.<br></p>\n\n\n\n\n\n\n\n<p>Others hate it, because it is radically different from traditional control-oriented project approaches, and they struggle to understand their value and role when documentation takes a back seat.<br></p>\n\n\n\n\n\n\n\n<p>And many others like the <em>idea</em> of Agile, but realize that it’s a tricky thing to get right – especially with very large organizations which have documentation and processes deeply engrained in their cultures.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>If any of these statements sounds familiar, we designed this course for <em>you</em>.\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>There is a lot of training out there for agile teams, but agile <em>BAs</em> have very specific needs that haven’t been addressed… (until now)</p>\n\n\n\n\n\n\n\n\n\n<p>That’s why we developed this course – to give you a basis on which to build an excellent BA career in any agile environment.\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>In this clear, concise, and easy-to-follow course, you will learn:\n\n  </p>\n\n\n\n\n\n\n\n\n\n<ul><li>How to figure out what <strong>your role</strong> on the team needs to be\n\n  </li><li>What user stories and acceptance criteria <em>really</em> are – and it’s probably <strong>not</strong> what you think\n\n  </li><li><strong>When</strong> to write requirements to maximize efficiency and minimize re-work\n\n  </li><li>Why the traditional product backlog is a <strong>mess</strong> and how to overcome it\n\n  </li><li>What a typical BA does in the course of a day, sprint, and release\n\n  </li><li>(and a whole lot more)\n\n  </li></ul>\n\n\n\n\n\n\n\n\n\n<p>… all while learning the ropes from a seasoned expert and business analysis executive.\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>By the end of the course, you’ll have more than just knowledge… You’ll have the <strong>practice and practical experience</strong> you need to feel confident on the job.\n\n</p>",
            "suitableLearners": [
                "Business Analysts who are moving onto an agile team for the first time",
                "Business Analysts who want to be successful in agile environments",
                "New Product Owners"
            ],
            "sections": []
        },
        "messages": {
            "welcome": "",
            "congratulations": ""
        },
        "history": {
            "createdAt": "2017-09-19T00:00:00.000Z",
            "createdBy": "622c1f382e96f2828a7dae2d",
            "publishedAt": "2017-09-22T00:00:00.000Z"
        },
        "promotions": {
            "discountPrice": 298220,
            "startAt": "2022-01-31T17:00:00.000Z",
            "endAt": "2023-01-31T17:00:00.000Z",
            "enabled": true
        }
    },
    {
        "status": "active",
        "categories": [
            "625e7f939c9b04f3f624d66b",
            "625e7ff99c9b04f3f624d6bf"
        ],
        "topics": [],
        "reviews": [],
        "meta": {
            "ratingCount": 10637,
            "studentCount": 37781,
            "avgRatingScore": 4.6482043,
            "contentVideoLength": 46466
        },
        "basicInfo": {
            "udemyCourseId": 1596054,
            "slug": "pmi-acp-exam-prep-success",
            "title": "PMI-ACP Exam Prep Success",
            "subtitle": "Pass the PMI-ACP Exam based on the PMBOK: Everything You Need to Pass the PMI-ACP",
            "image": "https://img-b.udemycdn.com/course/240x135/1596054_42c8_2.jpg",
            "price": 1949670,
            "lan": "en",
            "level": "all",
            "currency": "vnd",
            "isFree": false
        },
        "details": {
            "objectives": [
                "Qualify for the PMI-ACP Certification Exam",
                "Build an Agile Mindset",
                "Identify characteristics of value-driven projects",
                "Claim 21 Professional Development Units (PDUs)",
                "Identify the characteristics of a successful agile project",
                "Discuss agile project management in depth",
                "Pass the PMI-ACP examination"
            ],
            "requirements": [
                "Understanding of PMI-ACP certification",
                "What agile project management is and is not",
                "Qualifications for the PMI-ACP examination"
            ],
            "description": "<p>Looking for a PMI-ACP exam prep course with 21 PDUs? This is it!</p><p>You want to earn the PMI-ACP certification and you need quality training without all the nonsense and fluff so many courses offer. You do want to learn from an authority in project management that’s also certified as a PMI-ACP.</p><p>This is the course you want. This course provides 21 hours of Agile project management education and is taught by project management author and expert Joseph Phillips. You can claim these 21 hours as 21 PDUs for your continuing PMI education.</p><p>Our PMI-ACP® Exam Prep course provides complete coverage of the PMI-ACP® exam objectives and the library of Agile resources PMI recommends. Start today, invest in your career, and begin working to clear your PMI-ACP® exam. Here's what's included in our PMI-ACP® Exam Prep Online Seminar:</p><p>►21 Professional Development Units (PDUs)</p><p>►Complete coverage of the entire PMI-ACP® exam objectives</p><p>►21 contact hours of project management education</p><p>►Practice exam questions and answers on all exam objectives</p><p>►Module exams covering every PMI-ACP exam objective</p><p>►PDF course workbook; entire course for note-taking and following along</p><p>►Videos of all concepts, formulas, theories, and agile project management practices</p><p>►Lectures on the entire PMI-Agile® exam objectives</p><p>►24 x 7 Web and mobile access</p><p>►All terms for&nbsp;the PMI-ACP terms you must know for exam success</p><p>►Course discussions with the Instructor and peers</p><p>►30-day satisfaction guaranteed</p>",
            "suitableLearners": [
                "Project managers who qualify for the PMI-ACP examination",
                "Project managers seeking more information about agile project manager"
            ],
            "sections": []
        },
        "messages": {
            "welcome": "",
            "congratulations": ""
        },
        "history": {
            "createdAt": "2021-11-29T00:00:00.000Z",
            "createdBy": "622c1f382e96f2828a7dae2d",
            "publishedAt": "2021-12-02T00:00:00.000Z"
        },
        "promotions": {
            "discountPrice": 275280,
            "startAt": "2022-01-31T17:00:00.000Z",
            "endAt": "2023-01-31T17:00:00.000Z",
            "enabled": true
        }
    },
    {
        "status": "active",
        "categories": [
            "625e7f939c9b04f3f624d66b",
            "625e7ff99c9b04f3f624d6bf"
        ],
        "topics": [],
        "reviews": [],
        "meta": {
            "ratingCount": 10173,
            "studentCount": 42604,
            "avgRatingScore": 4.5845537,
            "contentVideoLength": 30417
        },
        "basicInfo": {
            "udemyCourseId": 848496,
            "slug": "deeply-practical-project-management-earn-16-pdus",
            "title": "Deeply Practical Project Management (Earn 16 PDUs)",
            "subtitle": "How to apply the PMI project management processes in the simplest and most practical way, with a professional example.",
            "image": "https://img-c.udemycdn.com/course/240x135/848496_b3be_49.jpg",
            "price": 1949670,
            "lan": "en",
            "level": "expert",
            "currency": "vnd",
            "isFree": false
        },
        "details": {
            "objectives": [
                "\"Finally an online course that teaches the 'how' of project management from an experienced veteran.\" – Karin Brame",
                "One complete, comprehensive course that covers the entire PM process, with a professional example.",
                "Get stakeholder and senior management support at the beginning of your project, and maintain it throughout.",
                "The essentials of Project Manager communication, team management, negotiation, and leadership.",
                "Plan your project with less than 5% of the overall effort, so everyone has realistic expectations before you start.",
                "Manage the top three drivers of project success, and avoid the top three causes of project failure.",
                "The critical importance of the project requirements, with best practices for documentation, review, and approval.",
                "Practical advice on building your work breakdown structure (WBS), and when to break it down further.",
                "Why the precedence diagram is your most important PM tool, even more important than the Gantt schedule.",
                "Five techniques for estimating, the best way to estimate within +/- 10%, and how to handle estimating error.",
                "An animated example of how to calculate the critical path, and why the schedule is more important than budget.",
                "How to decide whether to build or buy, the best type of contract structure, and the best way to make the award.",
                "How to prepare the project plan, brief management, provide options, stay truthful, and protect your career.",
                "The essentials of building the best project team, delegation, motivation, and resolution of personnel conflicts.",
                "How to manage scope so you find the things inevitably missed, but don’t let scope creep blow your project up.",
                "Use the critical path to focus on the most important items, reallocate resources, and make the PM’s job easier and easier.",
                "Track the budget and manage its key drivers to obtain the best cost performance possible.",
                "Identify the risks up front, mitigate them early, and manage your project to stay within the risk budget.",
                "The two most effective things you can do to manage quality, and ensure the customer is happy with the project result.",
                "Use earned value management (EVM) to objectively estimate future cost and schedule performance.",
                "Ask the stakeholders for guidance when your project is in trouble in the most productive and constructive way.",
                "Use scenario based verification to sign off requirements and make sure the customer is happy with the project result.",
                "Best practices for gathering lessons learned to find what went well and can be improved, and easily gather them as you go.",
                "Close your project, write a final report, and hold a project celebration so everyone can transition to their next challenge.",
                "A complete example of professional project management documentation for the $44M “Magical Devices Version 3” project.",
                "The document “Project Planning With MS Office” describing how to use MS apps to document your scope, schedule, and budget.",
                "Six practice quizzes, nine project management document templates, all the slides, and six summary checklists.",
                "Gain a deeply practical understanding of the PMI process for those that wish to write an exam and obtain a certification."
            ],
            "requirements": [
                "No prior knowledge needed: covers the project management process from end to end, while providing a wealth of practical tips for those already experienced in project management."
            ],
            "description": "<p><em>\"I am interviewing for a PM position in two days.&nbsp; This course boosted my confidence, and gave me valuable insight into key PMBOK areas I haven't considered since I received my PMI certification in 2012.&nbsp; I thoroughly enjoyed the comprehensive approach, the resources and real world examples, and the hilarious 'wrong' answers in the quizzes.&nbsp; Also, I am able to improve my resume, as I now understand how certain PM functions I've been performing for years are much more valuable than I thought.&nbsp; Great course!\"</em> – Dan Bischoff, PMP</p><p>This complete course is the practical companion to the PMI PMBOK.&nbsp; Based on more than 25 years of real world experience managing projects from just a few thousand to $55M, from small non-profits to high-tech startups to aerospace, and working in senior roles on PM teams for projects up to $3B, the course explains how to use the proven Project Management Institute (PMI) processes to manage projects of any size, from any domain, in the simplest and most deeply efficient way.&nbsp; Complexity is the challenge in project management.&nbsp; Done right, the PM process must make things simpler, and return much more than it takes.&nbsp; This course explains how to do that.&nbsp; And at the end of the course, you will also receive a certificate that bestows on you the credential of \"Practical Project Manager\", with the right to append <strong>PPM</strong> after your name.</p><p>The course is end-to-end, comprehensive, and divided into more than 200 easy to digest videos of just a few minutes long. &nbsp;First an overview is provided of all the fundamental PM concepts. &nbsp;Then the critically important role of the Project Manager and keys to team management are described. &nbsp;Then the essential PM processes are mapped across the project time-line, and the specific actions you need to take at each step to bring order to chaos are explained in an easy to follow thread. &nbsp;The use of software tools to support the PM process is explained.&nbsp; Summaries are provided, with quizzes to verify your learning.&nbsp; This course is complete, providing one comprehensive resource with everything you need.&nbsp; At the end of the course, you will not only understand project management, you will be able to <strong>implement</strong> it in the simplest, most deeply practical way.</p><p>You will also receive:</p><ul><li><p><strong>Professional Example</strong>.&nbsp; A complete set of realistic, professional PM documentation for the \"Magical Devices Version 3\" project, including a Project Charter, Stakeholder Register, Requirements Baseline, Work Breakdown Structure, Precedence Diagram, Project Management Plan, Gantt Schedule, Risk Register, and more, that you can reuse as models for your own projects.</p></li><li><p><strong>Templates</strong>.&nbsp; Microsoft Office templates for all the key PM documents, from Stakeholder Register to Project Plan to Final Report.</p></li><li><p><strong>MS Office Help</strong>.&nbsp; The invaluable document \"Project Planning With MS Office\" that explains how to use Microsoft Office applications to prepare your project's scope, schedule, and budget.</p></li></ul><p>If you need to manage a project right now, are pursuing a PMI certification, or just wish to get a solid grounding in practical application of the PM best practices to enhance your career, this course will really help. &nbsp;You will also earn 16 Professional Development Units (PDU's).</p><p><strong>Instructor</strong></p><p>William Stewart is a PMI certified Project Management Professional (PMP) who has managed projects for more than a quarter century, from just a few thousand dollars to $55M, in the domains of system integration, software, organizational improvement, business process, construction, real estate, research, and others.&nbsp; He has delivered more than 330 live onsite PM courses to more than 3,300 people.&nbsp; He has worked for aerospace, government, academia, and founded a software startup.&nbsp; He has deep experience with project management, risk management, contract management, systems integration, and software engineering.&nbsp; He earned his Ph.D. in Computer Science for development of an algorithm that builds multi-dimensional geodesic domes in optimum space and time, which to his knowledge has never been used for anything practical ;-)</p><p><strong>Student Feedback</strong></p><p>\"I have been a PMP since 2006 and learned so much from this course, truly outstanding.\" – Mark Thorogood, PMP</p><p>\"This is by far the best project management course I have ever taken!\" – Susan Steigler, PMP</p><p>\"This is the best real-world practical PM course on the web. Valuable knowledge and insight, clear, and hands on. A great investment when your time is really valuable and you don't want to waste a minute of it.\" – Sarah Hajipour</p><p>\"This course offers some of the most valuable material I've consumed as a Project Manager.\" – Philip Kohler</p><p>\"This is a very, very useful resource for both Project Managers and team members. The best PM course I have taken online.\" – Marcelo Palenzuela</p><p>\"Excellent course -- easy to understand -- wish I had reviewed this resource before I took my PMP exam!\" – Thomas Flores</p><p>\"The only course you will need. Walks you through all the phases of project management. With examples, anecdotes, and most importantly - templates. Highly recommend!\" – Allan Madhuram</p><p>\"I took this course after earning my PMP certification, and am stunned by the practical insights it provides. Thank you! I definitely recommend for both newbies and experienced Project Managers.\" – Raj Bidika</p><p>\"This was the best project management course that I have taken. I recommend to anyone interested in project management. Really above and beyond what I expected.\" – Mark April</p><p>\"Really straightforward and clear. Wish I had taken this before I sat for my PMP test.\" – Alexander Feravich</p><p>\"Great course, perfectly delivered. The PMBOK Guide applied to reality. I plan to repeat this course over and over again.\" – Alain Yeno</p><p>\"Not only does this course teach you practical project management, it also teaches you life skills you will keep for a lifetime. Exceptional. I couldn't have asked for anything better.\" – Saad Faruqui</p><p>\"Crisp and direct, no blabbing. Wise to go with this first before consulting any other material.\" – Rufus Okomhanru</p><p>\"The course was amazing. A lot of real life examples. In my 17 years of PM experience I have never taken a more concise, informative, and easy to understand PM walk-through.\" – Vladimir Mitev</p><p>\"This course gave me valuable insight into key PMBOK areas that I haven't considered since I received my PMP certification in 2012. Great course!\" – Dan Bischoff</p><p>\"I've been managing projects for several years, and picked up key points which will improve my work in the future, and would have made previous projects significantly better if I'd known them sooner. Highly recommended.\" – David Morrison</p><p>\"This turned out to be the best money I ever spent. My only regret is I didn't take this course sooner.\" – Nicholas Ikpi</p><p>\"One of the greatest courses I have ever had. Short videos you can digest at your own pace. A warm environment, seems that you are talking with him.\" – Francisco Zapata</p><p>\"Over the course of a 20 year career I have purchased many training materials, video courses, study guides, etc, and this was hands down the best material I have ever used.\" – Christopher Irons</p>",
            "suitableLearners": [
                "Those that need to manage projects, and want a deeply practical description of how to use the project management best practices across the life-cycle.",
                "Anyone involved in projects that wants to understand the practical essentials of the PM best practice process."
            ],
            "sections": []
        },
        "messages": {
            "welcome": "",
            "congratulations": ""
        },
        "history": {
            "createdAt": "2022-04-11T00:00:00.000Z",
            "createdBy": "622c1f382e96f2828a7dae2d",
            "publishedAt": "2022-04-14T00:00:00.000Z"
        },
        "promotions": {
            "discountPrice": 275280,
            "startAt": "2022-01-31T17:00:00.000Z",
            "endAt": "2023-01-31T17:00:00.000Z",
            "enabled": true
        }
    },
    {
        "status": "active",
        "categories": [
            "625e7f939c9b04f3f624d66b",
            "625e7ff99c9b04f3f624d6bf"
        ],
        "topics": [],
        "reviews": [],
        "meta": {
            "ratingCount": 8788,
            "studentCount": 26501,
            "avgRatingScore": 4.5630927,
            "contentVideoLength": 8364
        },
        "basicInfo": {
            "udemyCourseId": 1918248,
            "slug": "project-management-master-project-management-pmppmi",
            "title": "Project Management: Master Project Management - PMP/PMI",
            "subtitle": "Master Project Management using this practical certification course",
            "image": "https://img-c.udemycdn.com/course/240x135/1918248_ad2f.jpg",
            "price": 2752570,
            "lan": "en",
            "level": "beginner",
            "currency": "vnd",
            "isFree": false
        },
        "details": {
            "objectives": [
                "Avoid the top ten mistakes people make in projects",
                "Be able to manage a successful project even with zero experience in that industry",
                "Learn how to make a Gantt Chart and a PERT diagram with ease",
                "Use the PMP or PMI method to do Project Management",
                "Measuring whether you're on budget and on time - and how to fix it if you're not",
                "Feel calm and effective in running a project of any size in any industry"
            ],
            "requirements": [
                "Nothing - just a willingness to learn!",
                "Having a project in mind would be helpful"
            ],
            "description": "<p><strong>Master Project Management - Avoid the 10 Most Common Mistakes</strong></p><p><em>Learn the PMP method of Project Management to deliver exception projects on time, on budget, and to spec.</em><br></p><p>Project Management is an incredibly powerful skill for accelerating your career - and you might be surprised to hear you are probably managing a project <em>right now</em>! Managing a big project is often a pivotal moment in your life and yet it's also one most people aren't trained for... and it's very common to get wrong. Whether it's organising a wedding, launching a new product, or getting a spaceship on the moon, Project Management is what keeps this world turning. If you want to be someone who is calm and confident running a project (big or small!) then this Project Management Mastery course is perfect for you.</p><p><br></p><p>In this course you'll learn practical techniques to master project management. The course is structured around the ten most common project management mistakes and through that you'll learn the entire Project Management Professional (PMP) framework. It covers detailed tips for excellent planning using Gantt Charts and PERT diagrams, managing a team, avoiding overspend, predicting risks and dealing with multiple stakeholders. </p><p>After this course you will feel calm, collected, well prepared and confident that your project will be a success. In fact - you'll easily be in the top 10% of the most successful projects! We look at lots of real life project management examples (some of which will definitely get you laughing) and give you practical tools you can use right away to get better results in your projects. Whether you're managing a small at-home project or an entire global corporate expansion this course will build essential skills to ensure your project comes in on budget, on time, and with a very happy client (or boss!). <br></p><p>Chris Croft is an international speaker, and widely published author, who's been teaching Project Management to companies for over 20 years. He's taught all over the world, as well as online, and has an entertaining and practical teaching style. This course is guaranteed to keep you engaged and amused, and teach you life changing skills for home and work.</p><p><br></p><p>The course overview includes:</p><ul><li><p>Which common mistakes will instantly set your project up to fail</p></li><li><p>What makes a great project manager</p></li><li><p>Be able to manage a successful project even with zero experience in that industry</p></li><li><p>How to make a Gantt Chart and a PERT diagram </p></li><li><p>Predicting which tasks are crucial to your project timing</p></li><li><p>Measuring whether you're on budget and on time</p></li><li><p>What you should NEVER say to a client (or your boss)</p></li><li><p>This course does not look at Agile or Prince in detail - but something better!</p></li><li><p>And lots lots more!</p></li></ul><p>By becoming great at Project Management, not only will you pave the way for a future promotion, you'll also have saved your company thousands!</p><p><br></p><p><strong>This course comes with a 30 day money back guarantee</strong></p>",
            "suitableLearners": [
                "Anyone managing a project (now or soon) - whether big or small",
                "People who find project management stressful - or feel their projects often run late or overspend",
                "Those who want to run smooth, efficient and impressive projects - and level up their career",
                "Someone who wants to do Project Management in their future career",
                "This course does not teach Agile or Prince - but something even better!"
            ],
            "sections": []
        },
        "messages": {
            "welcome": "",
            "congratulations": ""
        },
        "history": {
            "createdAt": "2022-03-31T00:00:00.000Z",
            "createdBy": "622c1f382e96f2828a7dae2d",
            "publishedAt": "2022-04-03T00:00:00.000Z"
        },
        "promotions": {
            "discountPrice": 458800,
            "startAt": "2022-01-31T17:00:00.000Z",
            "endAt": "2023-01-31T17:00:00.000Z",
            "enabled": true
        }
    },
    {
        "status": "active",
        "categories": [
            "625e7f939c9b04f3f624d66b",
            "625e7ff99c9b04f3f624d6bf"
        ],
        "topics": [],
        "reviews": [],
        "meta": {
            "ratingCount": 8055,
            "studentCount": 23314,
            "avgRatingScore": 4.4385066,
            "contentVideoLength": 18115
        },
        "basicInfo": {
            "udemyCourseId": 501238,
            "slug": "agile-pm-201-understanding-agile-at-a-deeper-level",
            "title": "Agile PM 201 - Understanding Agile at a Deeper Level",
            "subtitle": "Develop an Adaptive, High-Performance Agile Approach Based on a Deeper Understanding of Agile Principles and Values",
            "image": "https://img-b.udemycdn.com/course/240x135/501238_37bd_2.jpg",
            "price": 1949670,
            "lan": "en",
            "level": "expert",
            "currency": "vnd",
            "isFree": false
        },
        "details": {
            "objectives": [
                "Develop a deeper understanding of the principles and values behind Agile and Scrum to create high performance Agile teams and to apply Agile more effectively to a much broader range of projects and business environments",
                "Develop the knowledge and skills to lead, mentor, and coach Agile project teams based on an in-depth understanding of understanding of Agile and Scrum values, principles, and practices"
            ],
            "requirements": [
                "All students should take my Udemy course \"Learn the Truth About 'Agile versus Waterfall'\" before taking this course"
            ],
            "description": "<p><strong>Important:</strong><br>This course is part of an integrated, university-level curriculum of seven courses (See details below).&nbsp; This course is the third course in that series and should be taken in sequence.&nbsp; Please take the prerequisite courses before taking this course.<strong> </strong></p><p><strong>Course Statistics:</strong></p><ul><li><p>Over 125,000 students in my courses!</p></li><li><p>Over 7,000 5-star reviews in my courses!</p></li></ul><p><strong>Earn PDU's: </strong>Students who complete this course are eligible to receive 3.75 PDU's in PMI continuing education credits. Instructions for claiming PDU's are provided with the last lesson in the course.</p><p><strong>Qualify for PMI-ACP Certification:</strong>&nbsp; Completion of all seven courses in this series will meet the requirement for 21 hours of training to qualify for PMI-ACP&nbsp;certification.</p><p><strong>Money-back Guaranty: </strong>Try this course and if you are not satisfied with the value you received from the course, just send an email to Udemy support and they will give you a 100% refund within 30 days.</p><p><strong>Course Summary:&nbsp; </strong>Develop a very high-impact and adaptive approach to implementing Agile and Scrum projects based on a deeper understanding of Agile/Scrum principles and values that can be adapted to any project and business environment!</p><p>Agile training is often limited to the \"mechanics\" of how to implement Agile and Scrum and that can often lead to weak and ineffective implementation.&nbsp; An adaptive approach that is based on fitting the approach to the nature of the project and to the business environment requires a deeper understanding of the principles behind Agile and Scrum.</p><p>This course is designed to provide Project Managers, Product Owners, Scrum Masters, and Agile Teams with a deeper understanding of principles and values behind Agile and Scrum and how they can be applied in real-world project situations to develop a high performance Agile approach that is adaptive to any project and business environment.</p><p><strong>Special Note:</strong></p><p>This course is part of an overall curriculum that is designed around helping students develop the skills required for a high-impact Agile Project Management role.&nbsp; Most students will want to take the complete curriculum rather than individual courses.&nbsp; The complete curriculum should be taken in the following order:</p><ol><li><p>Agile PM&nbsp;101 - Learn the Truth About Agile versus Waterfall</p></li><li><p>Agile PM&nbsp;102 - What's the Future of Agile Project Management?</p></li><li><p>Agile PM 201 - Understanding Agile at a Deeper Level</p></li><li><p>Agile PM 202 - Introduction to Agile Project Management</p></li><li><p>Agile PM&nbsp;301 - Mastering Agile Project Management</p></li><li><p>Agile PM 401 - Advanced Agile Project Management</p></li><li><p>Agile PM 402 - Enterprise-level Agile&nbsp;Project Management</p></li></ol><p>Students who complete the entire curriculum of all seven courses shown above will receive a signed certificate of completion from the Agile Project Management Academy.&nbsp; The complete set of seven courses will also meet the 21 hours of training required for PMI-ACP&nbsp;certification.</p><p>____________________________________________________________________________________________________________________________________________</p><p><strong>PMI-ACP Certification Course</strong></p><p>In addition, there are one optional courses that is designed to supplement the above curriculum for students who are interested in PMI-ACP certification:</p><ul><li><p><strong>How to Prepare for PMI-ACP Certification</strong> is intended for students who are interested in using this curriculum to prepare for PMI-ACP certification</p></li></ul><p>____________________________________________________________________________________________________________________________________________</p><p><strong>Agile Business Management Curriculum</strong></p><p>There is also a condensed version of this curriculum that is designed for any business people who are involved in Agile projects including Product Owners, Business Sponsors, and Business Analysts</p><ol><li><p><strong>Introduction to Agile Business Management</strong></p></li><li><p><strong>Mastering Agile Business Management</strong></p></li><li><p><strong>Enterprise-level Agile Business Management</strong></p></li></ol><p><br></p><p><strong>Note: </strong>These courses for Agile Business Management are an abridged version of the Agile Project Management courses and there is no need to take both<br></p><p><br></p>",
            "suitableLearners": [
                "Project Managers, Product Owners, Scrum Masters, and Agile Teams who are interested in developing a deeper understanding of the principles and values behind Agile and Scrum to enable them to optimize the execution of an Agile/Scrum process in a given project"
            ],
            "sections": []
        },
        "messages": {
            "welcome": "",
            "congratulations": ""
        },
        "history": {
            "createdAt": "2020-12-08T00:00:00.000Z",
            "createdBy": "622c1f382e96f2828a7dae2d",
            "publishedAt": "2020-12-11T00:00:00.000Z"
        },
        "promotions": {
            "discountPrice": 275280,
            "startAt": "2022-01-31T17:00:00.000Z",
            "endAt": "2023-01-31T17:00:00.000Z",
            "enabled": true
        }
    },
    {
        "status": "active",
        "categories": [
            "625e7f939c9b04f3f624d66b",
            "625e7ff99c9b04f3f624d6bf"
        ],
        "topics": [],
        "reviews": [],
        "meta": {
            "ratingCount": 7542,
            "studentCount": 34455,
            "avgRatingScore": 4.3151555,
            "contentVideoLength": 16462
        },
        "basicInfo": {
            "udemyCourseId": 806710,
            "slug": "microsoft-excel-for-project-management-earn-5-pdus",
            "title": "Microsoft Excel for Project Management  - Earn 5 PDUs",
            "subtitle": "Mastering Microsoft Excel for Project Management: Controlling, Tracking, and Reporting",
            "image": "https://img-c.udemycdn.com/course/240x135/806710_db47_2.jpg",
            "price": 1146770,
            "lan": "en",
            "level": "expert",
            "currency": "vnd",
            "isFree": false
        },
        "details": {
            "objectives": [
                "Design reports for your stakeholders",
                "Create a dashboard with some common project management requirements",
                "Improve project communications with charts",
                "Format, change, and edit charts",
                "Apply conditional formatting to save time and automate reporting",
                "Implement the Microsoft Excel Camera Tool",
                "Create a speedometer chart for reporting",
                "Claim five (5) Professional Development Units with PMI"
            ],
            "requirements": [
                "Basics of project management",
                "Basics of Microsoft Excel"
            ],
            "description": "<p>It’s been said that project management is 90 percent communication – and it can certainly feel that way when you consider all of the people you have to communicate with everyday. Well, did you know that you can use Microsoft Excel to help you communicate more effectively, define your project charter, build out the project scope, and even the work breakdown structure? You sure can!</p>\n\n<p>It’s paramount that project managers work with the project team to plan and define the project scope. Then, when the team is executing the project work, the project manager needs to monitor and control the work. Part of monitoring and controlling is to record what’s happening in the project. Based on this work performance data, you’ll process the project’s successes (and possibly failures) and report to the project stakeholders accordingly.</p>\n\n<p>Microsoft Excel can help you with so much of that! In this course we’re going to explore lots of things that Microsoft Excel can do for project management. We’ll dive into formatting, charting, conditional formatting, and building a custom dashboard and report. If you don’t have a more advanced project management software, that’s okay, you can do much of that business right in Microsoft Excel.</p>\n\n<p>This course is worth five (5) Professional Development Units with the Project Management Institute. Take this course at your leisure, learn more about Microsoft Excel and project management, keep your PMI certification going, and most importantly, manage your projects with better control and communication.</p>",
            "suitableLearners": [
                "Project managers",
                "PMPs",
                "People learning Microsoft Excel for reporting",
                "New and experienced project managers",
                "Project team members responsible for reporting",
                "Don't take this course if you're new to Excel"
            ],
            "sections": []
        },
        "messages": {
            "welcome": "",
            "congratulations": ""
        },
        "history": {
            "createdAt": "2021-11-09T00:00:00.000Z",
            "createdBy": "622c1f382e96f2828a7dae2d",
            "publishedAt": "2021-11-12T00:00:00.000Z"
        },
        "promotions": {
            "discountPrice": 275280,
            "startAt": "2022-01-31T17:00:00.000Z",
            "endAt": "2023-01-31T17:00:00.000Z",
            "enabled": true
        }
    },
    {
        "status": "active",
        "categories": [
            "625e7f939c9b04f3f624d66b",
            "625e7ff99c9b04f3f624d6bf"
        ],
        "topics": [],
        "reviews": [],
        "meta": {
            "ratingCount": 6241,
            "studentCount": 17018,
            "avgRatingScore": 4.444473,
            "contentVideoLength": 6362
        },
        "basicInfo": {
            "udemyCourseId": 1358224,
            "slug": "project-management-essentials",
            "title": "Project Management Essentials",
            "subtitle": "A crash course in the essentials of project management for new project managers.",
            "image": "https://img-c.udemycdn.com/course/240x135/1358224_f9b2_2.jpg",
            "price": 1146770,
            "lan": "en",
            "level": "intermediate",
            "currency": "vnd",
            "isFree": false
        },
        "details": {
            "objectives": [
                "\"This course is great, to the point, informative, lecturer is very knowledgeable. One of my favorite courses. Great job.\" – Romol Bereaux",
                "What project management fundamentally does, and the domains it applies to.",
                "Who in the organization can benefit from using project management.",
                "How project management applies to small (sometimes very small) projects.",
                "What comes before project management, before you have a project.",
                "When project management is most useful, and the process will be more than worth the effort.",
                "The five stages of the formal project management process, their essential features, and how they fit together.",
                "The most important concept in project management – the triple constraint, its key messages, and how the parts inter-relate.",
                "The role of the Project Manager, key responsibilities, and why accountability is a good thing.",
                "The purpose of project initiation, and the key elements of the project charter.",
                "The importance of the first definition of the project scope – the one sentence objective.",
                "A one-page flowchart of the whole planning process, setting up your project for success.",
                "The official baseline for the project scope – the work breakdown structure.",
                "The precedence diagram – your most important tool for planning, communicating, and managing your project.",
                "The official baseline for the project schedule – the Gantt chart.",
                "The essential elements of the project cost breakdown.",
                "The importance of planning for the unexpected – risk management planning.",
                "Documenting the planning in a concise project management plan for sponsor review.",
                "The purpose and key elements of the monitoring and control phase.",
                "Managing the number two cause of project problems – scope changes.",
                "The essential elements of managing the project schedule.",
                "The essential elements of managing project cost.",
                "The essential elements of managing project risk.",
                "The best way to conduct the monthly project review.",
                "The purpose and key elements of project closing.",
                "Wrapping up the project with a targeted final report.",
                "A summary checklist of all the key learnings of the course."
            ],
            "requirements": [
                "No prerequisites - this course is intended for new project managers looking for an overview."
            ],
            "description": "<p><em>\"This is a great course, not only for new project managers who want to learn the basics of project management, but also for existing PMs who would like to refresh themselves with the fundamentals.&nbsp; Clear, concise, and very informative.\"</em> – Jade Mercado</p><p>Complexity is the challenge in project management.&nbsp; Therefore, simplicity and practicality must be the solution.&nbsp; Based on more than 25 years of experience with practical implementation of the formal Project Management Institute (PMI) process, this course gives you the essential information you need to understand what project management does, how it flows across the life-cycle, and the key steps you need to take to make your project successful.</p><p>&nbsp; &nbsp; &nbsp;1.&nbsp; <strong>Overview</strong>:&nbsp;&nbsp; What project management fundamentally does.&nbsp; The five stages of the formal process.&nbsp; The most important concept in PM: the triple constraint.&nbsp; The critically important role of the Project Manager.</p><p>&nbsp; &nbsp; &nbsp;2.&nbsp; <strong>Initiation</strong>:&nbsp; The purpose of Initiation.&nbsp; Baselining the first definition of your project’s scope: the Objective.</p><p>&nbsp; &nbsp; &nbsp;3.&nbsp; <strong>Planning</strong>:&nbsp; A one page flowchart of the whole Planning process.&nbsp; The project scope baseline: the work breakdown structure.&nbsp; The logic of the project: the precedence diagram.&nbsp; The schedule baseline: the Gantt chart.&nbsp; The cost breakdown.&nbsp; Risk management.&nbsp; Documentation of the Project Management Plan.</p><p>&nbsp; &nbsp; &nbsp;4.&nbsp; <strong>Execution</strong>:&nbsp; The purpose of Execution.&nbsp; The essentials of building the best project team.</p><p>&nbsp; &nbsp; &nbsp;5.&nbsp; <strong>Monitoring &amp; Control</strong>:&nbsp; The purpose of Monitoring and Control.&nbsp; Managing scope, schedule, cost, and risk.&nbsp; The monthly project status review.</p><p>&nbsp; &nbsp; &nbsp;6.&nbsp; <strong>Closing</strong>.&nbsp; The purpose of Closing.&nbsp; Wrapping up the project with a targeted final report.</p><p>If after taking this crash course you wish to dig deeper, please feel free to check out my comprehensive course \"Deeply Practical Project Management\", which goes into much more detail on *how* to implement the PM processes in-depth.&nbsp; Enjoy!</p><p><strong>Instructor</strong></p><p>William Stewart is a PMI certified Project Management Professional (PMP) who has managed projects for more than a quarter century, from just a few thousand dollars to $55M, in the domains of system integration, software, organizational improvement, business process, construction, real estate, research, and others.&nbsp; He has delivered more than 330 live onsite PM courses to more than 3,300 people.&nbsp; He has worked for aerospace, government, academia, and founded a software startup.&nbsp; He is author of the widely popular <em>Deeply Practical Project Management</em> course and book.&nbsp; He has deep experience with project management, risk management, contract management, systems integration, and software engineering.&nbsp; He earned his Ph.D. in Computer Science for development of an algorithm that builds multi-dimensional geodesic domes in optimum space and time, which to his knowledge has never been used for anything practical ;-)</p><p><strong>Student Feedback</strong></p><p>\"This is the best quick refresher project management course there is out there. Highly recommend!\" – Adity Das Gupta</p><p>\"Would have been very useful to learn this earlier, but better late than never!\" – Tibor Kocsis</p><p>\"Cuts through the noise and delivers tangible and practical lessons.\" – Harold Floyd</p><p>\"Great, succinct overview covering all the major points of project management in an easy-to-follow format.\" – Kathleen Adams</p><p>\"Concentrated the PM theories into less than two hours - that is a very great job!\" – Samuel Song</p><p>\"A must have course as a ready reference for a new or even a seasoned PM.\" – Jignesh Jani</p><p>\"Great course.&nbsp; I'm not a project manager, but it has made me realise I definitely undertake some of the key elements of the role already.\" – Rachel Horne</p><p>\"Working with project managers for a long time, brings a clearer understanding of what they were doing and why.&nbsp; A good overview for anyone working on a project, not just for project managers.\" – Dave Uebele</p><p>\"Awesome refresher course on Project Management.&nbsp; I would recommend this course to any new Project Manager.\" – Manjunath Maller</p><p>\"I think I learned almost as much here as in my PMP bootcamp, a very good refresher before I take the test.&nbsp; Thank you.\" – John Franklin</p><p>\"It was a great course.&nbsp; Excellent course for people who are planning to become a PM.\" – Adolph Robinson</p><p>\"The best course in the Udemy portal that I have come across.&nbsp; Concepts are crisp and neatly explained!&nbsp; I strongly recommend!\" – Suresh Raju</p><p>\"The course instructor is an expert and has managed very large projects successfully. That is why I have taken this course, to learn practical skills from someone that has actual experience in managing large complex projects.&nbsp; I recommend this course to anyone wanting to understand project management and how to get started in the field.\" – Stefan du Plooy</p>",
            "suitableLearners": [
                "Those new to project management, looking for a crash course in the essentials of the best practice processes."
            ],
            "sections": []
        },
        "messages": {
            "welcome": "",
            "congratulations": ""
        },
        "history": {
            "createdAt": "2021-05-02T00:00:00.000Z",
            "createdBy": "622c1f382e96f2828a7dae2d",
            "publishedAt": "2021-05-05T00:00:00.000Z"
        },
        "promotions": {
            "discountPrice": 275280,
            "startAt": "2022-01-31T17:00:00.000Z",
            "endAt": "2023-01-31T17:00:00.000Z",
            "enabled": true
        }
    },
    {
        "status": "active",
        "categories": [
            "625e7f939c9b04f3f624d66b",
            "625e7ff99c9b04f3f624d6bf"
        ],
        "topics": [],
        "reviews": [],
        "meta": {
            "ratingCount": 4838,
            "studentCount": 12201,
            "avgRatingScore": 4.4460597,
            "contentVideoLength": 9120
        },
        "basicInfo": {
            "udemyCourseId": 1502458,
            "slug": "agile-pm-102-what-is-the-future-of-agile-project-mgmt",
            "title": "Agile PM 102 - What Is The Future of  Agile Project Mgmt?",
            "subtitle": "Learn how to develop yourself into a high impact Agile Project Management role and reinvigorate your career!",
            "image": "https://img-c.udemycdn.com/course/240x135/1502458_6e4e.jpg",
            "price": 917370,
            "lan": "en",
            "level": "intermediate",
            "currency": "vnd",
            "isFree": false
        },
        "details": {
            "objectives": [
                "Understand the impact that Agile and Lean are having on the project management profession",
                "Learn how to take advantage of the new career opportunities that Agile Project Management creates"
            ],
            "requirements": [
                "All students should take my \"Learn the Truth About Agile versus Waterfall\" course prior to taking this course to develop a basic understanding of Agile and Waterfall and to see those two approaches in a fresh new perspective as complementary rather than competitive"
            ],
            "description": "<p><strong>Important:</strong><br>This course is part of an integrated, university-level curriculum of seven courses (See details below).&nbsp; This course is the second course in that series and should be taken in sequence.&nbsp; Please take the prerequisite course before taking this course.</p><p><strong>Course Statistics:</strong></p><ul><li><p>Over 125,000 students in my courses!</p></li><li><p>Over 7,000 5-star reviews in my courses!</p></li></ul><p><strong>Earn PDU's:</strong>&nbsp;Students who complete this course are eligible to receive 2.25&nbsp;PDU's in PMI continuing education credits. Instructions for claiming PDU's are provided with the last lesson in the course.</p><p><strong>Qualify for PMI-ACP Certification:</strong>&nbsp; Completion of all seven courses in this series will meet the requirement for 21 hours of training to qualify for PMI-ACP&nbsp;certification.</p><p><strong>Accelerate Your Career:&nbsp;</strong>&nbsp;Agile and Lean are having a profound impact on redefining \"project management\" as we have known it since the 1950's and 1960's. A lot of project managers are confused about what this means to their careers. This course is designed to help project managers better understand the impact of these changes and re-orient their careers as needed to become a very high impact Agile Project Manager..</p><p><strong>Money-back Guaranty:</strong>&nbsp;Try this course and if you are not satisfied with the value you received from the course, just send an email to support@udemy.com&nbsp;and you&nbsp;will receive a 100% refund within 30 days.</p><p><strong>Course Summary:</strong></p><p>The use of Agile methodologies is growing at an incredible rate, the basic way we do traditional plan-driven project management hasn't changed significantly since the 1950's and 1960's and the rate of technology change today is making a pure plan-driven approach very cumbersome and impractical to implement in many real-world situations. That doesn't mean that traditional plan-driven project methodologies are obsolete and no longer useful; however, within a relatively short amount of time, a project manager who <strong>only </strong>knows how to use traditional plan-driven methodologies will be at a serious disadvantage in the job market.</p><p>That's a big challenge for many project managers who have been schooled and indoctrinated in a plan-driven project management approach because Agile changes the very nature of how we do project management in many environments.&nbsp; &nbsp;This course will help you understand the impact of these changes and learn how to&nbsp;adapt your career to move into a high-impact Agile Project Management role.</p><p><strong>Special Note:</strong></p><p>This course is part of an overall curriculum that is designed around helping students develop the skills required for a high-impact Agile Project Management role.&nbsp; Most students will want to take the complete curriculum rather than individual courses.&nbsp; The complete curriculum should be taken in the following order: &nbsp; </p><ol><li><p>Agile PM&nbsp;101 - Learn the Truth About Agile versus Waterfall</p></li><li><p>Agile PM&nbsp;102 - What's the Future of Agile Project Management?</p></li><li><p>Agile PM 201 - Understanding Agile at a Deeper Level</p></li><li><p>Agile PM 202 - Introduction to Agile Project Management</p></li><li><p>Agile PM&nbsp;301 - Mastering Agile Project Management</p></li><li><p>Agile PM 401 - Advanced Agile Project Management</p></li><li><p>Agile PM 402 - Enterprise-level Agile&nbsp;Project Management</p></li></ol><p>Students who complete the entire curriculum of all seven courses shown above will receive a signed certificate of completion from the Agile Project Management Academy.&nbsp; The complete set of seven courses will also meet the 21 hours of training required for PMI-ACP&nbsp;certification.</p><p>____________________________________________________________________________________________________________________________________________</p><p><strong>PMI-ACP Certification Course</strong></p><p>In addition, there are one optional courses that is designed to supplement the above curriculum for students who are interested in PMI-ACP certification:</p><ul><li><p><strong>How to Prepare for PMI-ACP Certification</strong> is intended for students who are interested in using this curriculum to prepare for PMI-ACP certification</p></li></ul><p>____________________________________________________________________________________________________________________________________________</p><p><strong>Agile Business Management Curriculum</strong></p><p>There is also a condensed version of this curriculum that is designed for any business people who are involved in Agile projects including Product Owners, Business Sponsors, and Business Analysts</p><ol><li><p><strong>Introduction to Agile Business Management</strong></p></li><li><p><strong>Mastering Agile Business Management</strong></p></li><li><p><strong>Enterprise-level Agile Business Management</strong></p></li></ol><p><br></p><p><strong>Note: </strong>These courses for Agile Business Management are an abridged version of the Agile Project Management courses and there is no need to take both<br></p><p>\n\n</p><p><br></p><p><br></p>",
            "suitableLearners": [
                "Any project manager who is interested in understanding the impact of Agile and Lean on the project management profession and wants to accelerate their own career by taking advantage of these opportunities"
            ],
            "sections": []
        },
        "messages": {
            "welcome": "",
            "congratulations": ""
        },
        "history": {
            "createdAt": "2021-06-21T00:00:00.000Z",
            "createdBy": "622c1f382e96f2828a7dae2d",
            "publishedAt": "2021-06-24T00:00:00.000Z"
        },
        "promotions": {
            "discountPrice": 275280,
            "startAt": "2022-01-31T17:00:00.000Z",
            "endAt": "2023-01-31T17:00:00.000Z",
            "enabled": true
        }
    },
    {
        "status": "active",
        "categories": [
            "625e7f939c9b04f3f624d66b",
            "625e7ff99c9b04f3f624d6bf"
        ],
        "topics": [],
        "reviews": [],
        "meta": {
            "ratingCount": 3963,
            "studentCount": 11169,
            "avgRatingScore": 4.4421244,
            "contentVideoLength": 10601
        },
        "basicInfo": {
            "udemyCourseId": 896704,
            "slug": "scrum-and-agile-basics-theory-certification-tips",
            "title": "Scrum and Agile Basics - Theory,  Certification Tips",
            "subtitle": "Discover Scrum and agile principles, learn practical examples and prepare for the Scrum Master certification",
            "image": "https://img-b.udemycdn.com/course/240x135/896704_fd43_7.jpg",
            "price": 1949670,
            "lan": "en",
            "level": "all",
            "currency": "vnd",
            "isFree": false
        },
        "details": {
            "objectives": [
                "Understand the Scrum framework basics.",
                "List all core Scrum elements (Roles, Artifacts, Events, Values) and explain their meaning.",
                "Point out the differences between the agile and waterfall approaches.",
                "Become a successful Scrum Team member.",
                "Avoid the most common mistakes and scrum anti-patterns.",
                "Take advantage of the practical exercises and tips introduced as part of the course.",
                "Learn practical exercises for Sprint Retrospectives that can be used in your team.",
                "Understand the Scrum Poker estimation technique.",
                "Approach the Professional Scrum Master certificate."
            ],
            "requirements": [
                "The are no specific requirements that one has to fulfill in order to sign up for the course. It is designed with beginning and intermediate Scrum Team members in mind but will also be a perfect fit for those who want to improve their understanding of Scrum and Agile and are not necessarily engaged in Scrum projects on a daily basis. The course can also serve as an introduction to agile and project management in general because it covers all basic concepts and places Scrum in a broader context."
            ],
            "description": "<p>A complete <strong>Scrum</strong> course divided into multiple modules. Each module consists of multiple sections ending with a<strong> quiz</strong> that helps solidify the knowledge.</p><p>The course covers all core <strong>Scrum</strong> <strong>framework </strong>elements such as:</p><ul><li><p><strong>Scrum Events</strong>,&nbsp;</p></li><li><p><strong>Scrum Roles</strong>,</p></li><li><p><strong>Scrum Artifacts</strong>,&nbsp;</p></li></ul><p>but also comes with additional modules devoted&nbsp;to <strong>Scrum values </strong>(a new segment added to <strong>Scrum Guide</strong> in 2016), differences between the agile and waterfall approaches (to help the student get the broader perspective) and the<strong> Scrum Master</strong> certification.</p><p>All of those modules, combined with a one on one support, Q&amp;A section and additional materials provided by the course authors form a complete package. This Scrum package can serve as a knowledge base for those who are already working with <strong>Scrum</strong> or <strong>agile</strong>, those who have only heard about it and want to fully understand its principles and to those who are preparing for the Scrum Master certification.</p><p>The course was created by two <strong>agile</strong> enthusiasts who work with <strong>Scrum teams</strong> and experience Scrum every day. Jarek and Paweł are <strong>Scrum Masters</strong> who started their adventure with IT projects in a waterfall environment, then worked with multiple teams on introducing the agile change and are currently working as <em>Scrum Masters</em>. Their professional experience allowed them to obtain the „full image” of the agile methodology (and the <strong>Scrum framework</strong> in particular) and how it relates to the waterfall approach.</p><p><br></p><p><strong><em>IMPORTANT&nbsp;NOTICE:</em></strong><em><br>This course is not an official preparation for the Professional Scrum Master™ I (PSM I) certification by Scrum(.)org and it is not connected with this organization. We also highly recommend the official Scrum trainings offered by this them.</em></p><p><br></p>",
            "suitableLearners": [
                "People looking for a complete overview of the Scrum framework",
                "Anyone who works as part of a project team and wants to learn the basics of agile software development, Scrum and project management in general",
                "Professionals who want to improve their understanding of Scrum and agile",
                "Scrum Master candidates looking for a solid recap before approaching the Professional Scrum Master certificate"
            ],
            "sections": []
        },
        "messages": {
            "welcome": "",
            "congratulations": ""
        },
        "history": {
            "createdAt": "2021-01-25T00:00:00.000Z",
            "createdBy": "622c1f382e96f2828a7dae2d",
            "publishedAt": "2021-01-28T00:00:00.000Z"
        },
        "promotions": {
            "discountPrice": 275280,
            "startAt": "2022-01-31T17:00:00.000Z",
            "endAt": "2023-01-31T17:00:00.000Z",
            "enabled": true
        }
    }
]