[{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fd59c9b04f3f624d69b"],"topics":[],"reviews":[],"meta":{"ratingCount":18419,"studentCount":59005,"avgRatingScore":4.6400423,"contentVideoLength":6717},"basicInfo":{"udemyCourseId":563478,"slug":"sales-training-practical-sales-techniques","title":"Sales Training: Practical Sales Techniques","subtitle":"Sales Hacking: Essential sales skills, sales strategies and sales techniques to sell just about anything!","image":"https://img-c.udemycdn.com/course/240x135/563478_2c35.jpg","price":1949670,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["Enjoy selling by befriending customers","Close deals with confidence","Be organised and efficient","Understand the selling process and how to master it","Feel confident preparing for a sales meeting","Know different selling styles and their uses","Master body language and rapport to build relationships"],"requirements":["No physical equipment is needed","A willingness to learn, and situations to practise are advised"],"description":"<p><strong>Sales Training: Practical Sales Techniques</strong></p><p><em>Sales Hacking: Essential sales skills, sales strategies and sales techniques to sell just about anything!</em></p><p><br></p><p>Sales is all about listening to people and prescribing a solution. In every job you'll come across sales moments, whether you're selling yourself in a job interview or selling products to customers - it's an essential skill in all career paths. Sales needn't be slimy, immoral, or complicated - it's simply about getting the best solution for the customer so they are thrilled to buy from you. </p><p>With this course you can maximise your sales potential in just a few minutes - if you're already working in sales, or looking for a lucrative and enjoyable future career, effective selling is a valuable skill that you definitely need to master.<br></p><p>Chris Croft is an international speaker and widely published author, who's been teaching Sales skills to companies for over 20 years. He's taught all over the world, as well as online, and has an entertaining and practical teaching style. This course is guaranteed to keep you engaged and amused, and teach you life changing skills for home and work.</p><p>This course covers everything you need to know about sales: from preparing and planning, relationship building, objection handling techniques, and closing the deal at a brilliant price. It looks at lots of real life examples (some of which will definitely get you laughing) and gives practical tools you can use right away to get better results.</p><p>Sales Hacking overview includes:</p><ul><li><p>Planning your toolkit</p></li><li><p>Building a rapport and relationship</p></li><li><p>Handling objections and hidden excuses</p></li><li><p>Creating a foolproof efficiency system for organising your sales</p></li><li><p>Simple tricks to raise yourself above 90% of the competition</p></li><li><p>Simple phrases that will get you a brilliant closing price</p></li><li><p>And lots lots more!</p></li></ul><p><strong>This course comes with a 30 day money back guarantee.</strong></p>","suitableLearners":["Those currently working in sales looking to increase their figures","Those considering sales as a career in the future","Anyone who has to deal with customers face-to-face"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2020-03-28T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2020-03-31T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fd59c9b04f3f624d69b"],"topics":[],"reviews":[],"meta":{"ratingCount":12302,"studentCount":27130,"avgRatingScore":4.6742806,"contentVideoLength":8081},"basicInfo":{"udemyCourseId":1919728,"slug":"customer-service-mastery-delight-every-customer","title":"Customer Service Mastery: Delight Every Customer","subtitle":"Master Customer Service using this practical customer care course","image":"https://img-b.udemycdn.com/course/240x135/1919728_cf04_6.jpg","price":1949670,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["Be flooded with ideas on how to delight customers","Stand out from competitors with unique customer experiences","Create customers who are loyal for life and sing your praises to friends and family","Help your team or employees give great service and be creative with new ideas"],"requirements":["Nothing - just a willingness to learn!","Having a business in mind to improve would be helpful","No prior knowledge of the subject is required","Some of the materials you may wish to print"],"description":"<p><strong>Customer Service: Delight Your Customers with Customer Care</strong></p><p><em>Master Customer Service - delight your customers using great customer care and benefit from lifelong loyalty and referrals</em></p><p><br></p><p>Do your customers LOVE you? Do they rave to their friends about what a great company you are? Would they ever consider switching to a competitor? Do they always leave your premises happy and well cared for? You might think this is a faraway dream, too expensive to achieve, or simply impossible for a product/business like yours….But guess what - it’s not! Customer Service can make all of those goals come true, and doesn’t need to cost you anything except creativity and passion.&nbsp;</p><p><br></p><p>Amazingly there are almost no official theories, tools or frameworks out there talking about Customer Care. For me it’s one of the most powerful and underestimated marketing, sales and leadership areas. So, I have created a step by step course you can use to come up with original, cost effective and unique ways to delight every customer and have them coming back to you time after time. Imagine if all your customers became repeat clients, and referred you to others many times over? You could fire your whole sales and marketing team! In my experience, most employees genuinely want to do a good job and make customers happy, but often don’t have the tools or empowerment to make it a reality. This course fixes that with simple, tried and tested ideas that have been working for decades.&nbsp;</p><p><br></p><p>Over my 20 year management coaching career I've seen thousands of businesses... and I've pinpointed all the ways they could improve their customer service! The challenge with Customer Service is you need to be constantly ahead of your competitors and offering something unique and special to delight the customer. If you don't already have fresh Customer Service ideas popping up on a daily basis I’d highly recommend taking this course. It will allow you to build a loyal fanbase of customers who would never dream of spending their money elsewhere... and that could multiply your revenues many times over! </p><p><br></p><p>Chris Croft is an international speaker, and widely published author, who's been teaching Customer Service to companies for over 20 years. He's taught all over the world, as well as online, and has an entertaining and practical teaching style. This course is guaranteed to keep you engaged and amused, and teach you life-changing skills for home and work.</p><p><br></p><p>The course overview includes:</p><ul><li><p>Thirty unique ways to create Customer Care delights</p></li><li><p>Provide incredible service even with zero industry experience</p></li><li><p>Motivate your employees to go over and above</p></li><li><p>Highlight missed opportunities to delight customers</p></li><li><p>Turn every customer into a lifelong fan</p></li><li><p>Benefit from repeat sales, upselling and referrals</p></li><li><p>And as always it's 100% practical, and with no technical jargon.&nbsp;</p></li><li><p>And lots lots more!</p></li></ul><p>By becoming great at Customer Service, not only will you benefit from customers never switching to a competitor, but you'll also have made your company thousands in referral and repeat sales!</p><p><br></p><p><strong>This course comes with a 30 day money back guarantee</strong></p>","suitableLearners":["Anyone managing a company or team (now or soon) - whether big or small","Someone who wants to do Customer Care or management in their future career","People looking to grow their sales through customer referrals and repeat business","Businesses looking for inspiration on how to delight their customers and stand out from competitors","Suitable for product or service related businesses"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2020-03-28T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2020-03-31T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fd59c9b04f3f624d69b"],"topics":[],"reviews":[],"meta":{"ratingCount":5585,"studentCount":25124,"avgRatingScore":4.4527793,"contentVideoLength":22883},"basicInfo":{"udemyCourseId":1449746,"slug":"business-development-b2b-sales-for-startups-sales-valley","title":"Business Development & B2B Sales for Startups- Sales Valley","subtitle":"The Complete Startup Playbook for Business Development & B2B Sales to learn Lead Generation, Pitching, & Closing Deals.","image":"https://img-c.udemycdn.com/course/240x135/1449746_ca17_2.jpg","price":1949670,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["Students will learn the PROVEN Sales Valley Methodology to build business relationships and generate sales","How to sell and generate meetings remotely and be productive while working from home","All the different types of business development deal structures you can use to grow your business","The MOST EFFECTIVE way to pitch your product or service to potential customers","How to write amazing emails that get responses even if you don't have any copywriting experience","How to sell anything using your own authentic personality without sounding \"salesy\"","How to build your own lead generation machine to get consistent leads every month","How to use the BEST email scripts and templates top sales professionals use","How to close deals effectively and grow a business relationship for the long term","How to successfully negotiate business deals","How to find an infinite amount of companies and people who will be a GREAT fit for your product or service"],"requirements":["You must have an open mind to learn and apply new skills","You must be familiar with email, however, no specific software is required"],"description":"<p><strong>WHY LEARN BUSINESS DEVELOPMENT &amp; SALES?</strong>\n\n&nbsp; </p><p>You might be offering an amazing product or service…but <strong>developing business relationships and generating sales is typically the <em>hardest</em> part about growing your&nbsp;startup.</strong>\n\n&nbsp; </p><p><strong>The first challenge</strong> most startup comes across is generating leads and scheduling your&nbsp;first meetings with potential customers who might be interested in buying your product or service.\n\n&nbsp; </p><p><strong>The second challenge</strong> startups face is once your do get your first meetings, what exactly should you say to sell your product/service and how exactly do you&nbsp;close the deal?&nbsp; &nbsp; </p><p><br></p><p>Now, most startups aimlessly try finding new clients by cold calling or going to networking events and play the numbers game…which we <em>all</em> know can lead to inconsistent results, and frankly, can be a <strong>huge waste of time</strong>.\n\n&nbsp; </p><p><strong>THERE HAS TO BE A BETTER WAY, RIGHT?</strong>\n\n&nbsp; </p><p>Fortunately, I’ve created a <strong>PROVEN</strong> methodology specifically for startups and high growth companies to generate a consistent flow of leads using cold emailing, develop their communication and sales skills, and close more deals. And it’s called <strong>Sales Valley</strong>.\n\n&nbsp; </p><p>Unlike other courses, <strong>Sales Valley </strong>is the <strong>COMPLETE PLAYBOOK</strong> the top Silicon Valley startups use to develop business relationships and exponentially grow their businesses.</p><p><br></p><p>As long as you use our proven <strong>Sales Valley Methodology</strong> (which I’ll show you how to do step by step), you’ll be able to get a meeting and close a deal with anyone! Best of all, you'll learn how to generate meetings while working remotely and working from home.</p><p>&nbsp; &nbsp; </p><p>Here are some of the many things I’ll cover for you in this course that trains on how to master the complete sales cycle from start to finish:&nbsp; &nbsp; </p><ul><li><p>We will show you how to build your own sales process to maximize efficiency for your business</p></li><li><p>How to send cold emails to <strong>get a meeting with ANYONE</strong> from small, medium, and Fortune 500 companies</p></li><li><p>How to write like a professional copywriter <strong>even if you don’t have any copywriting experience</strong></p></li><li><p><strong>Bonus Cold Email Scripts &amp; Templates</strong> for every situation</p></li><li><p>Exactly how to run a successful business meeting</p></li><li><p>How to become a better listener and identify customers’ main pain points</p></li><li><p>The best way to&nbsp; <strong>pitch</strong> your idea and convince people to believe in you</p></li><li><p>How to get customers to buy <strong>emotionally</strong> and justify logically</p></li><li><p>How to handle deal-breaking <strong>objections</strong> and turn skeptics into buyers</p></li><li><p>How to <strong>close deals</strong> without using high-pressure techniques</p></li><li><p>How to <strong>exponentially scale</strong> your business</p></li><li><p>How to sell and generate meetings remotely and be productive while working from home</p><p><br></p></li></ul><p>This course will teach you <strong>EVERYTHING</strong> you need to know to develop more business relationships and generate more sales for your startup whether you’re already familiar with business development &amp; sales or if you’re just getting started.&nbsp; &nbsp; </p><p><br></p><p>I’ve personally tested all these bulletproof growth strategies myself with small, medium, and Fortune 500 companies in all types of industries like retail, real estate, health care, etc. as one of the <strong>TOP salespeople at Oracle and Y-Combinator-backed startup, Lob.</strong>&nbsp; &nbsp; </p><p><br></p><p>I'm&nbsp;confident the <strong>Sales Valley</strong>&nbsp;<strong>Methodology</strong> WILL WORK for YOU to grow your startup or your money-back guarantee.&nbsp; &nbsp; </p><p><br></p><p><strong>30-DAY MONEY BACK GUARANTEE</strong>&nbsp; &nbsp; </p><p>Sales Valley is designed to walk anyone through the steps to get a meeting with your dream clients and closing the deal, <strong>start to finish</strong>. Everything is given to you. You’ll have all the tools you need.&nbsp; &nbsp; </p><p><br></p><p>If you do this program, take action, and don’t generate more leads&nbsp;then I will give you a full immediate refund. <strong>No questions asked.</strong>&nbsp; &nbsp; </p><p><strong>Now if you’re ready to take your startup to the next level, I’ll see you inside!</strong>\n\n&nbsp; </p><p>-Patrick\n\n&nbsp; </p>","suitableLearners":["This course is designed for Startups, B2B sales people, freelancers, consultants, and entrepreneurs who sell their product or service in either phone or in-person meetings","Ideal for individuals and companies who want to build business relationships with small, medium, and Fortune 500 companies","People who want learn how to sell remotely from home","Anyone who does any type of selling and builds business relationships in a startup environment","People who are considering sales as a career and want to learn more about the profession","Sales & business development professionals looking to sharpen their skillset","People who want to be more influential, persuasive, and convincing to others"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-02-22T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-02-25T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fd59c9b04f3f624d69b"],"topics":[],"reviews":[],"meta":{"ratingCount":5160,"studentCount":22719,"avgRatingScore":4.350372,"contentVideoLength":18136},"basicInfo":{"udemyCourseId":1794901,"slug":"linkedin-marketing-lead-generation-b2b-sales-for-linkedin","title":"LinkedIn Marketing, Lead Generation & B2B Sales for LinkedIn","subtitle":"LinkedIn Machine: The LinkedIn MasterClass to learn LinkedIn Marketing, Lead Generation, Business Development, B2B Sales","image":"https://img-c.udemycdn.com/course/240x135/1794901_d8ac_2.jpg","price":1949670,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["How generate a massive amount of leads using cutting edge sales & marketing LinkedIn lead generation strategies","How to optimize your LinkedIn Profile to get 10x more visibility and generate leads","How to convert LinkedIn leads and conversations into REAL meetings via phone or in-person","Access to the MOST EFFECTIVE LinkedIn Cold Outreach scripts and templates you can use in almost any situation","The best LinkedIn Social Selling strategies turn total strangers into paying customers","The MOST EFFECTIVE LinkedIn Marketing strategies to capture your audience’s attention and convert them into warm leads","How to send cold LinkedIn Messages and get a meeting with ANYONE from small, medium, and Fortune 500 companies","How to create top tier LinkedIn marketing content to generate massive leads from text, video, downloads, and more","How to create a LinkedIn Group and a LinkedIn Company Page to build your profile credibility","How to drive traffic to your website using LinkedIn Videos and LinkedIn Blog Posts"],"requirements":["You must have or create a free LinkedIn Account","You must have an open mind to learn and apply new skills","The drive to be the very best version of you that you can be"],"description":"<p><strong>Why learn LinkedIn Marketing and Lead Generation?</strong>&nbsp; &nbsp;</p><p><br></p><p>You might be offering an amazing product or service…but getting your foot in the door to schedule that&nbsp;<em>first&nbsp;</em>meeting with your dream clients is usually the hardest part.&nbsp; &nbsp;</p><p><br></p><p>Most people aimlessly try finding new clients by cold calling or going to networking events, which we all know can lead to inconsistent results, and frankly, can be <strong>a huge waste of time</strong>. There has to be a better way, right?&nbsp; &nbsp;</p><p><br></p><p>Fortunately, there is a <strong>PROVEN</strong> method top salespeople, recruiters, and entrepreneurs have been using to schedule appointments with their dream clients for years, and it’s simply by leveraging <strong>LinkedIn</strong>.&nbsp; &nbsp;</p><p><br></p><p>Now <strong>using LinkedIn to generate leads </strong>is, easily and decisively, one of the most effective ways for an individual or business to develop a business relationship with another company.&nbsp; &nbsp;</p><p><br></p><p>LinkedIn is so pervasive in our everyday lives and will continue to be the overwhelmingly dominant social media network to do business in as time goes on.&nbsp; &nbsp; </p><p><br></p><p><strong>Every day millions </strong>of users all around the world check their LinkedIn and it’s only getting started. As a salesperson, recruiter, or entrepreneur, this is a powerful concept.&nbsp; &nbsp; </p><p><br></p><p>Unfortunately…</p><p>&nbsp; &nbsp;</p><p><strong>MOST PEOPLE FAIL AT UTILIZING LINKEDIN TO ITS FULL POTENTIAL</strong>&nbsp; &nbsp;</p><p><br></p><p>For most people, whether they’re salespeople, recruiters, freelancers, consultants, or entrepreneurs, spend hours of their personal time writing and sending poorly written LinkedIn messages that get&nbsp;<strong>ZERO RESPONSES</strong>…and eventually give up thinking&nbsp;<em>LinkedIn doesn’t work</em>.&nbsp; &nbsp;</p><p><br></p><p>Or they may even spend hours of time trying to generate leads on LinkedIn using marketing…but without a blueprint, fail to capture a single lead.&nbsp; &nbsp;</p><p><br></p><p>Here’s the good news: this failure is an <strong>OPPORTUNITY for YOU</strong>.&nbsp; &nbsp;</p><p><br></p><p>As long as you use our <strong>PROVEN LINKEDIN MARKETING &amp; LEAD GENERATION&nbsp;MACHINE&nbsp;</strong>(which I’ll show you how to do step by step), you’ll be able to generate leads and get a meeting with anyone.&nbsp; &nbsp;</p><p><br></p><p>Here are some of the many things I’ll cover for you in this course that trains on how to utilize LinkedIn Lead Generation &amp; Marketing (and, get meetings with your dream clients):&nbsp; &nbsp;</p><p><br></p><ul><li><p>We will show you how to create a <strong>LinkedIn Lead Generation Machine</strong> for developing consistent&nbsp;new leads and prospects to grow your business using a <strong>FREE LinkedIn Account</strong>&nbsp; &nbsp;</p></li><li><p>How to optimize your <strong>LinkedIn Profile</strong> to get <strong>10x</strong> more visibility and generate leads&nbsp; &nbsp;</p></li><li><p>How to send cold LinkedIn Messages and&nbsp;get a meeting with <strong>ANYONE</strong> from small, medium, and Fortune 500 companies&nbsp; &nbsp;</p></li><li><p>Access to the <strong>MOST EFFECTIVE LinkedIn Cold Outreach scripts and templates</strong> you can use in almost any situation&nbsp; &nbsp;</p></li><li><p>The <strong>MOST EFFECTIVE LinkedIn Marketing strategies</strong> to capture your audience’s attention and convert them into warm leads</p></li><li><p> How to <strong>create engaging LinkedIn content</strong> using text, photos, videos, downloads, and more</p></li><li><p>The best LinkedIn Social Selling strategies to combine outbound prospecting with LinkedIn content marketing to generate more leads&nbsp; &nbsp; </p></li><li><p>How to create a <strong>LinkedIn Group</strong> and a <strong>LinkedIn Company Page</strong> to build your profile credibility&nbsp; &nbsp;</p></li><li><p>How to drive traffic to your website using <strong>LinkedIn Videos</strong> and <strong>LinkedIn Blog Posts</strong>&nbsp; &nbsp;</p></li><li><p>How to generate leads using <strong>LinkedIn Ads</strong>&nbsp; &nbsp;</p></li><li><p>Why identifying your customers’ main <strong>PAIN</strong> points is critical and how to solve for their <strong>PAIN</strong>&nbsp; &nbsp;</p></li><li><p>When and how to <strong>follow up</strong> to people who “play hard to get”&nbsp; &nbsp;</p></li><li><p>How to convert <strong>LinkedIn conversations into REAL meetings</strong> via phone or in-person&nbsp; &nbsp;</p></li></ul><p><br></p><p>This course will teach you <strong>EVERYTHING</strong> you need to know to generate leads on LinkedIn using marketing and outbound strategies and get a meeting with <strong>ANYONE</strong> whether you’re already familiar with LinkedIn or just getting started.&nbsp; &nbsp;</p><p><br></p><p>I’ve personally tested all these bulletproof email strategies myself with small, medium, and Fortune 500 companies in all types of industries like retail, real estate, health care, etc. as one of the TOP salespeople at Oracle and Y-Combinator-backed startup, Lob.&nbsp; &nbsp; </p><p><br></p><p>I promise these LinkedIn strategies <strong>WILL WORK for YOU</strong> whether you’re a salesperson, recruiter, consultant, freelancer, or entrepreneur or your money-back guarantee.&nbsp; &nbsp; </p><p><br></p><p>This <strong>LinkedIn Marketing &amp; Lead Generation Master&nbsp;Course</strong> is designed to walk anyone through the steps to get a meeting with your dream clients and grow your business. Everything is given to you. You’ll have all the tools you need.&nbsp; &nbsp;</p><p><br></p><p>If you do this program, take action, and don’t generate more leads&nbsp;then I will give you a full immediate refund. No questions asked.&nbsp; &nbsp; </p><p><br></p><p><strong>So if you’re ready to TURBOCHARGE your business and get a meeting with ANYONE using LinkedIn, then I’ll see you inside!</strong>&nbsp; &nbsp;</p><p><br></p><p>-Patrick\n\n&nbsp; </p>","suitableLearners":["This course is built for B2B sales people, freelancers, consultants, and entrepreneurs who sell their product or service in either phone or in-person meetings","Anyone who wants to generate leads on LinkedIn using the most cutting edge marketing & sales strategies","People who want to build their brand on LinkedIn and optimize it to 10x their visibility","Ideal for individuals and companies who want to connect with small, medium, and Fortune 500 companies"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-02-22T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-02-25T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fd59c9b04f3f624d69b"],"topics":[],"reviews":[],"meta":{"ratingCount":4209,"studentCount":17531,"avgRatingScore":4.5583706,"contentVideoLength":20648},"basicInfo":{"udemyCourseId":619692,"slug":"learn-to-sell-anything-by-grant-cardone","title":"Learn to Sell Anything by Grant Cardone","subtitle":"Learn sales basics, techniques, and strategies that will give you the skills to sell anything.","image":"https://img-b.udemycdn.com/course/240x135/619692_72d1_5.jpg","price":1146770,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["Sell your idea, service, product to anyone with confidence."],"requirements":["The only thing required for this course is a student with an open mind, ready to improve their sales skills and their confidence."],"description":"<p>Do you have a product, a service, an idea, or an opinion that you need to sell, yet fail to see consistent, predictable results?</p><p>Have you ever thought to yourself, \"Why does selling come so naturally to some, but seem almost impossible for others?\"</p><p>Guess what - you are not alone! Having to sell something does not have to cause you fear and discomfort. Not only can selling be something that you enjoy, it can be a highly profitable activity.</p><p>Look, the truth is: the lack of success that most encounter with selling has nothing to do with being an introvert or an extrovert, but instead is simply the absence of learning a few basic principles.</p><p>This course lays out the foundation of what it takes in order to succeed in selling ANY product or service in ANY industry. Grant demystifies what selling <em>really</em> is and how in fact, every person on the planet is a salesperson, regardless of their job title or profession.</p><p>Contrary to what some say, people are not “born\" salespeople. Selling is a skill that can be learned, developed, and mastered. This course will set you down the path to increased sales, higher levels of confidence, and more motivation as you approach prospective clients of your products or services in the marketplace. </p><p>This course will teach you:</p><ul><li>What the MOST important sale you will ever make is</li><li>The difference between the PROS and the amateurs in sales</li><li>The 1st and MOST important rule of selling</li><li>The ONLY reason you won't like selling… and it's not what you think</li><li>Why price is a MYTH</li><li>How to develop a million dollar sales attitude</li><li>How to predict what the customer will say before they actually say it</li><li>What the 90 day phenomenon is and how to avoid it</li><li>How to MASTER time</li><li>How to identify your easiest sale</li><li>Who your powerbase is and how to sell to them</li><li>The EXACT amount of effort for you to see success in selling</li><li>The MOST successful strategy to use when a customer wants a discount</li><li>And find out who the most important person in the world REALLY is</li></ul>","suitableLearners":["This course is meant for anyone who has a service, idea, or product to sell to the public. More specifically, this is a course for those not satisfied with their current levels of production or income. This course will benefit anyone required to interact with people whether it is face to face, over the phone, or over the internet. "],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2015-11-03T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2015-11-06T00:00:00.000Z"},"promotions":{"enabled":false}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fd59c9b04f3f624d69b"],"topics":[],"reviews":[],"meta":{"ratingCount":3576,"studentCount":19051,"avgRatingScore":4.446096,"contentVideoLength":14815},"basicInfo":{"udemyCourseId":1393266,"slug":"lead-generation-machine-cold-email-b2b-sales-master-course","title":"Lead Generation Machine: Cold Email B2B Sales Master Course","subtitle":"Schedule meetings emailing small to large companies for business development, B2B, startup, consultants, & entrepreneurs","image":"https://img-c.udemycdn.com/course/240x135/1393266_e5de.jpg","price":1949670,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["You'll learn our PROVEN cold email methodology to get meetings with anyone and grow your business","How to sell and generate meetings remotely and be productive while working from home","How to build a Lead Generation Machine to get consistent leads every month","How to write amazing emails that get responses even if you don't have any copywriting experience","How to get meetings with your dream clients as an entrepreneur, freelancer, business development professional, sales person, or consultant","How to use the BEST email scripts and templates top sales professionals use","How to find an infinite amount of companies and people who will be a GREAT fit for your product or service"],"requirements":["You must be familiar with email, however, no specific software is required"],"description":"<p>You might be offering an amazing product or service…but getting your foot in the door to schedule that <em>first </em>meeting with your dream clients is usually the hardest part.\n\n&nbsp; </p><p>Most people aimlessly try finding new clients by cold calling or going to networking events, which we all know can lead to inconsistent results, and frankly, can be a huge waste of time. There has to be a better way, right?\n\n&nbsp; </p><p>Fortunately, there is a PROVEN method top salespeople and entrepreneurs have been using to schedule appointments with their dream clients for years, and it’s called <strong>COLD EMAILING</strong>.\n\n&nbsp; </p><p>Now cold emails&nbsp;are, easily and decisively, one of the most effective ways for an individual or business to develop a business relationship with another company.\n\n&nbsp; </p><p>Email is so pervasive in our everyday lives and will continue to be the overwhelmingly dominant form of communication to do business in as time goes on.&nbsp; &nbsp; </p><p>Not a day goes by where you, or someone around you, doesn’t check their email. As a salesperson or an entrepreneur, this is a powerful concept.&nbsp; &nbsp; </p><p>Unfortunately…\n\n&nbsp; </p><p><strong>MOST PEOPLE FAIL AT COLD EMAILING</strong>\n\n&nbsp; </p><p>For most people, whether they’re salespeople, freelancers, consultants, or entrepreneurs, they spend hours of their personal time writing and sending poorly written emails that get <strong>ZERO RESPONSES</strong>…and eventually give up thinking <em>cold emails don’t work</em>.\n\n&nbsp; </p><p>Here’s the good news: this failure is an OPPORTUNITY for YOU.\n\n&nbsp; </p><p>As long as you use our PROVEN LEAD GENERATION&nbsp;COLD EMAIL MACHINE&nbsp;(which I’ll show you how to do step by step), you can get a meeting with ANYONE. Best of all, you'll learn how to generate meetings while working remotely and working from home.</p><p>&nbsp; &nbsp; </p><p>Here are some of the many things I’ll cover for you in this course that trains on how to master cold emailing (and, get meetings with your dream clients):&nbsp; &nbsp; </p><ul><li><p>We will show you how to create a Lead Generation Machine for developing consistent&nbsp;new leads and prospects to grow your business</p></li><li><p>How to send cold emails and&nbsp;get a meeting with ANYONE from small, medium, and Fortune 500 companies</p></li><li><p>How to sell and generate meetings remotely and be productive while working from home</p></li><li><p>Where to mine new potential clients for your business and add them to your lead generation machine</p></li><li><p>How to find the right decision maker to reach out to</p></li><li><p>How to find ANYONE’s email address</p></li><li><p>Why identifying your customers’ main PAIN points is critical and how to solve for their PAIN</p></li><li><p>How to think and write like a professional copywriter</p></li><li><p>How to use the PROVEN Lead Generation Cold Email Machine</p></li><li><p>Bonus Cold Email Scripts and Templates for every situation</p></li><li><p>When and how to follow up to people who “play hard to get”</p></li><li><p>How to handle objections like “we don’t have the budget”</p></li><li><p>How to convert emails into REAL meetings via phone or in-person</p><p><br></p></li></ul><p>This course will teach you EVERYTHING you need to know to get a meeting with ANYONE whether you’ve tried cold emailing before or you’re just getting started.&nbsp; &nbsp; </p><p><br></p><p>I’ve personally tested all these bulletproof email strategies myself with small, medium, and Fortune 500 companies in all types of industries like retail, real estate, health care, etc. as one of the TOP salespeople at Oracle and Y-Combinator-backed startup, Lob.&nbsp; &nbsp; </p><p><br></p><p>I promise these cold email&nbsp;strategies WILL WORK for YOU whether you’re a sales person, consultant, freelancer, or entrepreneur or your money back guarantee.&nbsp; &nbsp; </p><p><br></p><p><strong>30-DAY MONEY BACK GUARANTEE</strong>&nbsp; &nbsp; </p><p>This Lead Generation Cold Email Master&nbsp;Course is designed to walk anyone through the steps to get a meeting with your dream clients and grow your business. Everything is given to you. You’ll have all the tools you need.&nbsp; &nbsp; </p><p><br></p><p>If you do this program, take action, and don’t generate more leads&nbsp;then I will give you a full immediate refund. No questions asked.&nbsp; &nbsp; </p><p><br></p><p><strong>So if you’re ready to TURBOCHARGE your business and get a meeting with ANYONE with cold emails, I’ll see you inside!</strong>\n\n&nbsp; </p><p>-Patrick\n\n&nbsp; </p>","suitableLearners":["This course is built for B2B sales people, freelancers, consultants, and entrepreneurs who sell their product or service in either phone or in-person meetings","Ideal for individuals and companies who want to connect with small, medium, and Fortune 500 companies","People who want to learn how to generate meetings while working remotely from home","People who want to be more influential, persuasive, and convincing to others"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-02-22T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-02-25T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fd59c9b04f3f624d69b"],"topics":[],"reviews":[],"meta":{"ratingCount":3446,"studentCount":17345,"avgRatingScore":4.563609,"contentVideoLength":9696},"basicInfo":{"udemyCourseId":1426364,"slug":"sales-machine-the-sales-training-b2b-master-course","title":"Sales Machine: The Sales Training B2B Master Course","subtitle":"Learn Sales Strategies & Sales Techniques to Sell ANYTHING for Entrepreneurs, Startup, B2B Sales, & Business Development","image":"https://img-c.udemycdn.com/course/240x135/1426364_6764_2.jpg","price":2064370,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["Students will learn the PROVEN Sales Machine Methodology to build business relationships and generate sales","How to sell anything using your own authentic personality without sounding \"salesy\"","How to INSTANTLY build rapport with anyone by mastering body language and tonality","How to become a stronger listener to uncover a customers' pain before delivering your solution","How to handle objections: for example when potential customers say \"no\" or \"we don't have the budget\"","The MOST EFFECTIVE way to pitch your product or service to potential customers","How to close deals effectively and grow a business relationship for the long term","How to apply sales techniques to enrich the quality of your relationships with people and everyday life","How to handle the most difficult part of sales...REJECTION","How to successfully negotiate business deals"],"requirements":["You must have an open mind to learn and apply new skills"],"description":"<p><strong>WHY LEARN SALES?</strong><br></p><p>Whether you’re selling a product or service, pitching an idea, or even selling yourself—<strong>we’re all in sales now.</strong></p><p><br></p><p>But there are a lot of challenges we have when it comes to selling like:  </p><p><br></p><ul><li><p>How do you get people to like you?</p></li><li><p>What should you say in a meeting?</p></li><li><p>How do you pitch your product, service, or idea?</p></li><li><p>How can you tell if they’re interested in what you have to offer?</p></li><li><p>How do you close the deal?</p></li><li><p>What if they say “NO!”?</p></li></ul><p><strong>INTRODUCING SALES MACHINE</strong><br></p><p>Fortunately, there is a PROVEN system top sales professionals, entrepreneurs, and everyday people have been using to build their business relationships for years, and it’s called the <strong>Sales Machine Methodology</strong>.</p><p><br></p><p>Now, most sales people focus on short term tactics that <em>trick</em> people into buying something they don’t actually need (think used car salesman). And this typically leads to buyers’ regretting their decision and broken business relationships.   </p><p><br></p><p>Here’s the good news: this failure is an <strong>OPPORTUNITY FOR YOU</strong>.   </p><p><br></p><p>As long as you use our proven <strong>Sales Machine Methodology</strong> (which I’ll show you how to do step by step), you’re going to learn how to authentically build long term business relationships with <strong>ANYONE</strong> without sounding “sales-ey”.  </p><p><br></p><p>Here are some of the many things I’ll cover for you in this course that trains on how to master the art of sales (and, close deals to grow your business):  </p><p><br></p><ul><li><p>We will show you how to instantly build rapport with ANYONE</p></li><li><p>How to develop the right mindset and be more confident in yourself and what you’re selling</p></li><li><p>Exactly how to successfully run a business meeting</p></li><li><p>How to become a stronger listener and identify customers’ main pain points</p></li><li><p>The best way to uncover how much a person is willing to spend (budget)</p></li><li><p>The best way to pitch your idea and convince people to believe in you</p></li><li><p>How to get your customers to buy emotionally</p></li><li><p>How to handle deal breaking objections and turn skeptics into buyers</p></li><li><p>How to close deals without using high pressure techniques</p></li></ul><p><br></p><p>This course will teach you everything you need to know to successfully build business relationships and <strong>sell your product, service, or idea</strong>.   </p><p>I’ve personally tested all these bullet proof sales strategies myself with small, medium, and Fortune 500 companies in all types of industries like retail, real estate, health care, etc. during my time as one of the <strong>TOP 1% of sales professionals at Oracle</strong> and at one of the <strong>fastest growing Y-Combinator backed startups in Silicon Valley</strong>.  </p><p><br></p><p>I’ve also trained thousands of students around the world with my sales methodology and helped them not only use sales to improve their professional lives, but to also apply those skills to better their personal life as well.   </p><p><br></p><p>I promise the Sales Machine Methodology will work for you whether you’re a sales person, consultant, employee, freelancer, or entrepreneur or your money back guarantee.</p><p><br></p><p><strong>30-DAY MONEY BACK GUARANTEE</strong> </p><p><br></p><p>The Sales Machine Master Course is designed to teach anyone the essential selling skills you’ll need to sell your product, service, and even yourself to anyone. Everything is given to you. You’ll have all the tools you need.\n\n  </p><p>If you do this program, take action and aren’t satisfied with your results then I will give you a full immediate refund. No questions asked.   </p><p><br></p><p><strong>So if you’re ready to take your sales skills to the next level and learn how you can sell ANYTHING, I’ll see you inside!</strong>  </p><p><br></p><p>-Patrick</p>","suitableLearners":["Sales professionals looking to sharpen their sales skillset","People who are considering sales as a career and want to learn more about the profession","Entrepreneurs, consultants, and freelancers who want to increase sales and grow their business","People who want to be more influential, persuasive, and convincing to others"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-02-22T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-02-25T00:00:00.000Z"},"promotions":{"discountPrice":298220,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fd59c9b04f3f624d69b"],"topics":[],"reviews":[],"meta":{"ratingCount":3377,"studentCount":15964,"avgRatingScore":4.5013447,"contentVideoLength":6551},"basicInfo":{"udemyCourseId":703316,"slug":"customer-success-manager-fundamentals-to-your-csm-career","title":"Customer Success Manager: Fundamentals to your CSM career","subtitle":"The foundations to become a great Customer Success Manager in a tech company. A very well paid profession on the rise","image":"https://img-b.udemycdn.com/course/240x135/703316_a5ff_5.jpg","price":1146770,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["Have a better understanding of what your job as Customer Success Manager will be like","Understand the fundamental principles of Customer Success. Which will be the foundation for your career as a CSM","Be more prepared for a Customer Success Manager job interview (we will not cover interview skills, your will be more prepared for the interview because you will know about customer success)","Show your interviewers that you are more knowledgeable about Customer Success than most of the people","Get ready to start your new job with as a Customer Success Manager"],"requirements":["There are no requirements for this course. All I ask is that you come with an open mind and willing to learn"],"description":"<p><strong>Uzo Akotaobi,</strong> <strong>Director, Human Resources at Comcast, said:</strong></p><p><br>\"<em>I took Gustavo's course about Customer Success and found it to be the single most valuable resource I tapped into when pursuing a career in this space. The reason for that is because Gustavo was able to explain the science of customer success in such a way to where you could look at your own experience whether it was in Customer Success or not and find ways to translate it to a resume. This helped me tailor my resume to Customer Success jobs in ways I didn't think to do otherwise. I can attest to the fact that after I took the course on Customer Success and revised my resume, recruiters responded more frequently. No joke! 3 different companies contacted me over the course of 3 weeks vs. NONE before. My background is in HR so I was looking at Customer Success roles in the HR technology space. Gustavo was easy to understand and the content was insightful. There is no silver bullet but if you take his course and really try to understand how your experience translates to Customer Success, there is no way you won't benefit from this course. I know I did and I got the interviews and job OFFER to prove it!&nbsp; </em>\"</p><p><br></p><p><strong>What is a Customer Success Manager?</strong></p><p>In the digital age, tons of new jobs have sprung up. Most people think of computer programming, website design or software integration, but what about the human side? The Customer Success Manager is one such job.</p><p>To sum it up in one sentence: This job is simply helping customers accomplish their goals with the software or service they purchased.&nbsp;</p><p>For any business, client retention is huge. It costs a company way less to keep a customer than to acquire a new one, and even more costly is to try and win that customer back. That's where this job comes in. If they have a complaint, you take care of it. If they succeed, you celebrate with them. You get to build long-term relationships with the clients, and as the client's needs adapt and change, you get to assist them in that process.</p><p><br></p><p><strong>Benefits of working as a Customer Success Manager</strong></p><p>Let's start with Salary.&nbsp;According to Payscale the average salary for an Entry-Level Customer Success Manager is $59,619 per year and $69,210 when you are past Entry-level and can reach into the 6 figure range for those who excel at this position.&nbsp;</p><p>More and more companies are seeing the incredible opportunities this type of job can provide. Startups and tech companies are leading the way, both big and small, and this field of work is only growing bigger.&nbsp;</p><p>And let's not forget perks. Because a lot of these jobs are at tech and startup companies, often they have great employee benefits such as:</p><ul><li><p>Great health care coverage, and even gym memberships.</p></li><li><p>Amazing offices, with plenty of recreational activities around.</p></li><li><p>Often they will match your 401(K).</p></li><li><p>Free snacks, free catered lunches every day… some even free beer.</p></li><li><p>Happy hours or cocktail afternoons.</p></li><li><p>Company trips, dinners, events.</p></li><li><p>Flexible hours and unlimited vacations.</p></li><li><p>Remote work.</p></li><li><p>And of course: equity.</p></li></ul><p>If you consider all of the benefits, the salary, and how dynamic this position is, it definitely makes sense to invest a few dollars in a course that will help you learn about and prepare for this growing job opportunity.<br><br>Enroll now, and I'll see you on the inside.</p>","suitableLearners":["People looking for a new career in tech or software based companies","Sales people or business professionals looking to switch industries or careers","Professionals with basic knowledge of Customer Success","Customer Success Managers that just got started in the career","This course is NOT for experienced CSM, even though it is always good to review the fundamentals every now and then."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-07-16T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-07-19T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fd59c9b04f3f624d69b"],"topics":[],"reviews":[],"meta":{"ratingCount":2022,"studentCount":11290,"avgRatingScore":4.6410055,"contentVideoLength":10093},"basicInfo":{"udemyCourseId":519050,"slug":"smart-marketing-with-price-psychology","title":"Smart Marketing with Price Psychology","subtitle":"Improve online marketing success with behavioral science research on pricing for your business and marketing","image":"https://img-c.udemycdn.com/course/240x135/519050_51c3_5.jpg","price":2293770,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["Price your product or service to maximize revenue","Understand how consumers perceive and think about prices","Run promotions that make people think they're getting an amazing deal","Think about your full set of products and services in ways that maximize earnings"],"requirements":["You should be open to using psychological research to optimize your business.","You do not already need to know anything about psychology."],"description":"<p>Getting people to buy something is hard. So many things can happen in a customer's mind that factor into the purchase decision. This course turns to solid scientific research in psychology to uncover tricks and hacks you can use to increase sales by massaging one fundamental element: <em>the price</em>.<br></p><p><strong>What You'll Learn</strong></p><p>In this course we consider <strong>six major strategies </strong>you can use to your marketing pursuits by using real data from behavioral science. Within each one are many individual things that make prices more appealing, totaling <strong>more than 30 psychological price effects </strong>that will strengthen your offline and online marketing campaigns.</p><ol><li><p><strong>Picking the Right Price:</strong> How to choose the number that will appeal most to consumers without changing your profit level.</p></li><li><p><strong>Presenting Your Price: </strong>How to write and say your price in the most appealing ways possible.</p></li><li><p><strong>Framing Your Price: </strong>How to communicate your price more effectively once the price is set.</p></li><li><p><strong>Using Context to Your Advantage: </strong>How to present differently priced products <em>together</em> in ways that maximize profits.</p></li><li><p><strong>Smart Discounting Practices:</strong> How to present your promotions in ways that make the deal irresistible.</p></li><li><p><strong>Handling Extra Charges:</strong> How to most effectively present your prices when there are unavoidable additional fees to communicate.</p></li></ol><p>As a bonus, I also include a full <strong>PDF notes</strong> document that summarizes all the major techniques we go over because when you are designing your marketing and advertising strategies, you don't always have time to review a full <em>3 hour</em> video course.</p><p><strong>Why Learn From Me?</strong><br></p><p>As an award-winning psychology instructor, I have experience translating research in the field and presenting it in an <em>engaging</em>, <em>understandable </em>way. My students routinely evaluate my courses highly and comment on the <em>passion </em>I have for social psychology. I hope you can join this group of satisfied students and learn something new about yourself and psychology.</p><p>So <strong>take this course</strong> now and understand the science of pricing and what it can do for your business and marketing efforts!</p>","suitableLearners":["If you're selling anything, you need to know how people are perceiving your price. This applies to people selling both online and offline, and it applies just as well to physical products as it does to service-based businesses.","If you want to increase the likelihood that people will buy from you without changing anything about the goods themselves, this course is vital."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-03-14T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-03-17T00:00:00.000Z"},"promotions":{"discountPrice":344100,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fd59c9b04f3f624d69b"],"topics":[],"reviews":[],"meta":{"ratingCount":2005,"studentCount":6513,"avgRatingScore":4.5427213,"contentVideoLength":21527},"basicInfo":{"udemyCourseId":2119574,"slug":"sales-skills-training-consultative-selling-master-class","title":"Sales Skills Training: Consultative Selling Master Class","subtitle":"Sales Training - Professional B2B Selling Skills for Consultants, Entrepreneurs and all Who Bring in the Business!","image":"https://img-b.udemycdn.com/course/240x135/2119574_a956_3.jpg","price":1949670,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["How to sell consulting and other high value services in the spirit of service","How to Sustain a Lasting Professional Relationship with Clients","Building Your Personal Brand","Mastering the Art of Building Trust for High Value Sales","Engaging Your Client in Co-Creating Solutions that Meet His/Her Needs"],"requirements":["Only a desire to become a professional who creates lasting relationships and value for your customers"],"description":"<p><strong><em>Sell in the Spirit of Service</em></strong>, seek to solve problems and build lasting relationships. This is <strong><em>Consultative Selling Skills</em></strong>,&nbsp; the anxiety free way to sell million dollar contracts.</p><p>Selling is an essential skill in our economy and for your personal development. To earn your full potential you must be able to sell your self, your ideas, your product or service. Consultative Selling reduces the anxiety of selling by focusing on shared problem-solving and building trusting relationships. Those who become partners or principles in professional service firms (consultants, lawyers, etc.) are those who bring in the business. This course describes exactly how to bring in high value contracts by building trusting relationships with clients. To succeed as an entrepreneur you must have the selling skills taught in this course. </p><p>The instructor was CEO&nbsp;and owner of a consulting firm for more than thirty years and sold multi-million dollar consulting contracts to companies like Shell Oil Company, Texaco, Honeywell, Merck, Coca-Cola, Bacardi, Corning, and others. He explains exactly how to build your own brand, establish credibility in the marketplace, build awareness, interest, and lasting relationships. </p><p>Transactional selling is like a one-night date. Consultative Selling is like a marriage, a partnership with your clients, in which you share in identifying problems and co-creating solutions. Consultative Selling skills take you from the earning potential of a skilled professional in your field to the million dollar plus earning potential of a partner or business owner.</p><p>The topics covered include the following:</p><p>1.<strong> How Do High Performing Sales People Behave? - A Study of the Stars.</strong> This is actual field research conducted by the instructor for a client on the dozen most successful sales people out of many hundreds selling for a major commercial truck manufacturer. </p><p>2.<strong> The Process of Consultative Selling: The Antecedents that Lead to the Sale.</strong> The instructor describes the process of creating a \"sales funnel\" that starts with knowing your market, creating awareness, personal and company branding.</p><p>3. <strong>The Consultative Conversation. </strong>This section describes the factors in \"likeability\", the process of dialogue (thinking together), problem solving models that enable you to immediately start adding value by helping the client diagnose their problems and co-create solutions that incorporate the features and benefits of your service or product. The instructor shares a detailed actual proposal of his consulting services that sold for more than a million dollars. He also shares a case study and suggest possible proof statements that enable the closing of the sale.</p><p>4. <strong>Service the Sale: </strong>Many sales courses end with the famous \"close\". However, this instructor insists that the initial close of a contract is only the beginning of a relationship and describes the process of post sale service and quality control that leads to additional sales opportunities.</p><p>5. <strong>The Essential Communication Skills:</strong> The final section of the course is training in the fundamental communication skills of asking open-ended questions, reflective listening, and expressing empathy that are essential to all quality relationships and are essential for Consultative Selling.</p><p>There is nothing theoretical about this course. It iis entirely based on the instructors many years as the principle rainmaker of a successful consulting firm. </p><p>Larry Miller has more than thirty-five thousand online students, sixteen courses, a numerous best selling courses. He has also published eleven books, two of which were on the NY Times Best Seller list. </p><p>Comments by previous students:</p><p><em>\"The course exceeded my expectations, its content is of quality and delivered beautifully. I could start applying things that I have learned tomorrow morning and I probably will. Thank you!\"</em> Andrei Nechifor</p><p><em>\"Yes, Lawrence Miller explains everything in detail. Very good to know what to expect and why. Also, very informative with coaching and dealing with individual vs team performance. The lines are laid out pretty clearly. There was a lot of great material, including feedback and open-ended questions techniques that are definitely useful in coaching and management.\"</em> Deanne Duncan</p><p><em>\"An outstanding leader and an amazing teacher. This teacher transformed the way I am doing business. He made me by far a better business consultant and executive coach. All the respect and love for him. Once you take one of his courses, you will be addicted to his teachings and courses.\" </em>Nabil El Hady</p><p><em>\"This course is fantastic, and I say that as someone who is very familiar with lean. I'm now using this course as part of my consulting practice to help my clients learn lean management, quality improvement, and the kata of high performing teams. The quality of instruction is outstanding on every front, and all the more so considering the low cost at which it can be accessed here on Udemy (whether purchasing it for myself or for others who need the material). Larry, thank you for what you have created here. This is an excellent resource for the direct practitioner, as well as the coach/consultant who is seeking to help clients learn, implement, and master these methods. I truly appreciate what you've done.\" </em>Josh White</p><p><em>\"The course was very informative, with proper guidelines and activity involved to practice. Miller is awesome in explaining things with right choice of words. Thanks again.\" </em>Divya</p><p><em>\"I love it! is concise, easy to understand even for me. I am just a beginner, but the explanations are very clear. He is a great teacher! Although it is a lot of information I did really enjoyed this course. Lawrence is amazing.\" </em>Maria Vargas Figueroa</p><p><br></p>","suitableLearners":["Any professional who desires to influence others and build a lasting business relationship.","Professionals seeking to become partners, principles, or high earners in their company.","Entrepeneurs who have to sell their ideas to prospective investors or partners.","Any sales professional wishing to increase the value of their sales and their relationships"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2020-08-13T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2020-08-16T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fd59c9b04f3f624d69b"],"topics":[],"reviews":[],"meta":{"ratingCount":1925,"studentCount":6426,"avgRatingScore":4.4659595,"contentVideoLength":5493},"basicInfo":{"udemyCourseId":1397390,"slug":"cold-calling-for-b2b-sales-how-to-prospect-over-the-phone","title":"Cold Calling for B2B Sales: How to Prospect over the Phone","subtitle":"B2B Sales Skill: How to Cold Call over the Phone with Purpose, Navigate through Gatekeepers and Set Client Meetings","image":"https://img-b.udemycdn.com/course/240x135/1397390_b181_3.jpg","price":2523170,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["Learn directly from an ACTUAL Sales Director of Training for a Fortune 500 Company!","Prepare for an Effective Prospecting Session","MASTER the Cold Calling Phone Navigation Process Which Will Improve Your Ratios Over the Phone!","Discover Sales Techniques That Turn Gatekeepers Into Your Ally When Prospecting","Know WHEN and HOW to Leave Voicemails that Get a Return Call","Learn How to Secure an Appointment When the Decision Maker Answers Their Phone","Identify the 4 MOST COMMON Objections You'll Receive from Decision Makers Over The Phone"],"requirements":["You should have a sales job (preferably in Business to Business)"],"description":"<p><strong>&gt;&gt; The fastest-growing Sales Training&nbsp;Series on Udemy! Learn directly from an actual Sales Director of Training for a Fortune 500 Company!&nbsp; The material inside is currently being taught at the highest level in the Fortune 500 sales space.&nbsp; You can't afford to miss this! &lt;&lt;</strong></p><p>**********&nbsp;</p><p><em>Are you afraid to make your dials on the phone?&nbsp; &nbsp;Have you actually been taught \"how\" to prospect over the phone?</em></p><p>In this part of SALES&nbsp;in 21 DAYS Program, you will learn how to cold call over the phone. &nbsp;No&nbsp;gimmicks. &nbsp;No super special secret on how to do it in a new way. &nbsp;None of those tactics work. &nbsp;Just face it...Cold calling is tough!&nbsp; In this course we will get right to the basics of building&nbsp;the discipline needed to be successful when you prospect, including the how to turn your prospecting efforts into a predictable&nbsp;numbers game. &nbsp;&nbsp;Get ready to&nbsp;<strong>learn sales techniques, how to prepare for effective prospecting, the navigation process of getting a decision maker to answer the phone, making gatekeepers your ally, the art of voicemails,&nbsp;and&nbsp;how to maximize on your chances with the decision maker when they finally&nbsp;pick up the phone!</strong><em>&nbsp; &nbsp;</em></p><p>**********&nbsp;</p><p>Peter, VP of Sales said:&nbsp;<strong>\"Derek's series on Sales are great on their own, but when taken together they make for a rounded experience covering the sales cycle in great detail. Derek is highly competent as a sales trainer, and while I've taken a lot of sales courses on Udemy, the courses by Derek stands head and shoulders above the rest.\"</strong></p><p>Stefan says: <strong>“This course gives a very good framework for prospecting on the telephone. If you want to learn the skill of telephone prospecting fast take this course as soon as possible. The instructor is very knowledgeable and the course material is relevant and well presented.”</strong></p><p>Kemz says: <strong>“It's been helpful already. He's gone over a few foundations I need to turn into habits.”</strong></p><p>Randall says:&nbsp;<strong>“I particularly like the techniques for getting past the gatekeeper.”</strong><br></p><p>Dariusz says:&nbsp;<strong>“Practical. All what I need.”</strong><br></p><p>Learn directly&nbsp;from a highly successful Fortune 500 sales coach&nbsp;who has trained hundreds of sales reps, sales managers and vice presidents in their sales careers. &nbsp;The sales strategies you will learn are still being taught in the sales training&nbsp;classroom today. &nbsp;</p>","suitableLearners":["This course is for anyone in business to business (B2B) sales who wish to improve their effectiveness when prospecting over the phone!"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-01-06T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-01-09T00:00:00.000Z"},"promotions":{"discountPrice":367040,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fd59c9b04f3f624d69b"],"topics":[],"reviews":[],"meta":{"ratingCount":1925,"studentCount":34351,"avgRatingScore":4.1537023,"contentVideoLength":32429},"basicInfo":{"udemyCourseId":200994,"slug":"business-development-for-startups-and-tech-companies","title":"Business Development For Startups and Tech Companies","subtitle":"Unlock massive growth using the business development channel. Learn pitching, BD strategy, cold emailing, & deal closing","image":"https://img-c.udemycdn.com/course/240x135/200994_5de4_2.jpg","price":1949670,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["By the end of this course, you will be armed with everything you need to dominate business development. ","You'll learn strategy, cold emailing, cold calling, pitching, selling, how to close deals, build a network, manage partners, generate leads, and much more including the human psychology behind all of this"],"requirements":["No prerequisite knowledge or additional applications are required"],"description":"<p><strong><strong>**UPDATED OCTOBER 2017**</strong>**</strong> Called <em><strong>\"the best course on Startup Business Development on the internet. A total shortcut for anyone looking to hone their skills\"</strong></em></p>\n\n<p>  \t   Companies explode when they crack the code to business development.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t   I know first hand after the last company I was doing business development for sold for 100 million in less than 3 years after it started.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t   The challenge is only a very small percentage of people actually know what they're doing when it comes to <em>achieving massive, scalable growth</em>through the business development.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t   Even worse, there's practically no comprehensive training material on it. In fact, mentorship and training is only available through years of working alongside the best or high-end consultants that costs hundreds of dollars an hour.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t   This disconnect is why so many companies are missing out on unlocking incredible growth and most \"business developers\" can't deliver on the results they promise.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t   This course was created to change that and <em>has only been available amongst a private, group of elite Business Development professionals until now</em>...  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t   This isn't one of those training programs that gives you some basic theory and sends you out into the trenches only slightly better off then when you started...  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t   By the end of this training you will be armed with breakout business development cunning and an arsenal of proven tactics for every situation you'll face.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t   Need to nail biz dev strategy and don't know where to start? - you're covered  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t   Can't get meetings with high leverage prospects? - you're covered  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t   Prospects not receptive or getting back to you? - you're covered  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t   Can't get a stalled deal to close? - boom, you'll learn how to disarm that too  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t   This training covers the whole business devleopment stack from providing frameworks to establish your strategy to rogue cold emailing &amp; calling strategies you can use to get meetings with anyone. You'll also learn how to pitch like powerhouse and push deals through the finish line with clockwork consistency.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t   This premium training is perfect and has already delivered results for:  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul>  \t<li>Companies who want to unlock the next-level growth available by creating Business Development partnerships and growth relationships</li>  \t<li>Senior business development professionals looking to sharpen their spear with unconventional, proven tactics</li>  \t<li>Managers who want to save time and provide their teams with the absolute best business development training available</li>  \t<li>People who are new to business development or want to work in this role and are trying to get a leg up on everyone else</li>  </ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t   When you're done this course, new levels of excellence will be in reach...as well as the big time personal rewards that comes comes with that.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t  \\  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t   Below you can find out exactly how the training is laid out, but real quick here are the sections:  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ol>  \t<li>Introduction and Developing An Offensive Mindset - Understand the function of Biz Dev and develop mindsets for success</li>  \t<li>Strategy - Performing Leverage Audits, Strategy Options, Choosing Your Strategy, First Deal Tactic Selection</li>  \t<li>Outreach - Isolating Key Stakeholders, Cold Emailing, Cold Calling, and Mastering Turning Rebuttals into Meetings</li>  \t<li>Powerhouse Pitching - First Meetings, Positioning, Pitch Deck Construction, Pitch Execution, Pre-sales Tactics (<em>advanced</em>)</li>  \t<li>Winning In The Deal Funnel - Objections, Dialogue Continuity, Relationship Building, Getting Buy-In, Deal Terms, Negotiation, and Closing Tactics</li>  \t<li>Implementation and Inbound Opportunities - Implement and Expand Inked Deals; Strategies for Creating Inbound Opportunities</li>  </ol>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t   Trust me, this is just a small sample of what you'll learn and by the end of this course you'll have every tool you need in order to tap into your full business development potential.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t   I will personally respond to any questions you may have as you go through the material so there's no worry if you're not sure how to take all of the information and apply it to your business.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t   AND you'll have access to all of this material as well as the newest stuff I share with everyone on the inside of the course for life!  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t   REMINDER: <em>this is a risk free purchase </em>with Udemy's 30 day money back guarantee. Nothing to lose, everything to gain.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t   Hope to see you on the inside,  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t   -Scott Britton  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t<em>BTW - This training is something I've kept off of everything but my own private community site for a long time due to weariness of exposing too many trade secrets. After finally getting convinced by some students that more people needed to see it, I decided to put it up here on Udemy. I can't guarantee I will keep making it available to purchase forever considering my initial concerns, so I'd grab it while you still can.</em>  </p>","suitableLearners":["Any company or individual looking to master business development. Everyone from industry vetereans to individuals with no previous experience will benefit from this course. "],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2015-07-18T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2015-07-21T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fd59c9b04f3f624d69b"],"topics":[],"reviews":[],"meta":{"ratingCount":1606,"studentCount":5740,"avgRatingScore":4.3889093,"contentVideoLength":5658},"basicInfo":{"udemyCourseId":554518,"slug":"understanding-strategic-marketing","title":"Understanding Strategic Marketing","subtitle":"A guide for managers and MBA students to master marketing theory and application","image":"https://img-c.udemycdn.com/course/240x135/554518_27fc_4.jpg","price":1834970,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["Master a wide range of marketing techniques","Design a comprehensive marketing strategy for their company","Take control of your marketing strategy instead of being pulled along by the market","Feel able to take on a new marketing role at work!","Apply academic techniques to your company and sector","Deconstruct marketing terminology to use it in real life","Identify profitable gaps in your market for future development","Assess your product range for dead weight and future stars","Understand why some products excel and others flop - and how to make them all winners!"],"requirements":["No previous marketing experience neccessary","It's helpful to have real life examples in your mind to practise on","Paper & pen for notes and practising"],"description":"<p><strong>Understanding Strategic Marketing</strong></p><p><em>A guide for managers and MBA students to master marketing theory and application</em></p><p><br></p><p>This course could save your business $1000s - if you're launching a new brand, moving into new markets, or wanting to grow your existing sales - marketing is a valuable skill that you definitely need to master.</p><p>Chris Croft is an international speaker and widely published author, who's been teaching Marketing skills to companies for over 20 years. He's taught all over the world, as well as online, and has an entertaining and practical teaching style. This course is guaranteed to keep you engaged and amused, and teach you life changing skills for home and work.</p><p>He covers everything you need to know from preparing and planning, understanding your customers and competitors, setting your prices, and ultimately getting the right products in front of the right people. This course covers all the academic models and theories you'd learn on an MBA course, but with practical tools and examples you can use right away to get better results for your business.</p><p>The course overview includes:</p><ul><li><p>Getting your product in front of the right people at the right time, to see your sales rocket</p></li><li><p>How to understand your customers better</p></li><li><p>Spotting new lucrative markets to move into</p></li><li><p>Understanding you weaknesses, and minimising them</p></li><li><p>Marketing theories ranging from SWOT, 4Ps, Porters 5 Forces, Ansoffs Matrix, and many others</p></li><li><p>Setting your prices for maximum revenue</p></li><li><p>How to make sure your marketing budget gets the highest return possible</p></li><li><p>And lots lots more!</p></li></ul><p><strong>This course comes with a 30 day money back guarantee.</strong></p>","suitableLearners":["Anyone with an interest in marketing","Those who've never worked in marketing before, and those looking to deveop existing skills","Marketing experts wanting to revitalise and refresh their skills","Someone wanting to learn academic techniques in a practical setting"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2020-03-28T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2020-03-31T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fd59c9b04f3f624d69b"],"topics":[],"reviews":[],"meta":{"ratingCount":1527,"studentCount":5358,"avgRatingScore":4.671656,"contentVideoLength":11426},"basicInfo":{"udemyCourseId":3556099,"slug":"b2b-sales-masterclass-people-focused-selling","title":"B2B Sales Masterclass: People-Focused Selling","subtitle":"Close deals using world-class discovery, demos, follow-up, and objection handling WITHOUT any shady or pushy tactics.","image":"https://img-c.udemycdn.com/course/240x135/3556099_7948.jpg","price":1949670,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["Foster the right mindset to confidently reach your sales goals","Use methods of influence to lead your prospect to the best outcome","Understand your prospect and the problems they're trying to solve","Execute immaculate discovery to set yourself up for success","Perfect your demo/pitch to make them want what you're selling","Get buy-in and agreement to close productive next steps","Conduct world-class follow up that makes it easy for your prospect to buy","Handle common objections and deflections with tried and true techniques"],"requirements":["Students should not be brand new to sales, and should understand the steps of a typical sales cycle and common terminology.","This course will not cover prospecting, but instead focuses on how to sell to the prospect once they're in the door."],"description":"<p>Think about how you sell. You may be crushing it, exceeding your quota, and making President's Club every year. But are you selling the RIGHT way?</p><p>Are you focused on producing a good outcome for your prospect? Are you focused on helping THEM solve their problems and achieve <em>their</em> goals? <strong>If you're not doing PEOPLE-focused selling, then you're not doing it right.</strong></p><p>Whether you're in B2B sales or B2C sales, something that all selling has in common is PEOPLE. I call this B2P sales because you're always selling to a person. <strong>When you start to pay attention to how PEOPLE buy, how PEOPLE make decisions, and what motivates PEOPLE to change, your sales career will take a massive step forward.</strong></p><p>I built this course to teach you how to sell in a way that's not only better for the people you’re selling to but also better for you as the salesperson. A way that you can sell without being shady, or tricking your prospect just to secure the close. A way that makes sure there's a great outcome for everyone.</p><p>I've collected a lot of knowledge throughout my career, and I want to share that with you. I've built and led teams with hundreds of sales reps and generated hundreds of millions of dollars in revenue. <strong>I've been fortunate enough to be named an InsideSales Top 10 Sales Leader, LinkedIn Top Sales Voice 2020, Sales Development Exec of the Year in 2018, and one of the 100 Top Sales Coaches to Watch. And all of that is great. But more importantly, it means that what my teams and I have done and continue to do WORKS.</strong></p><p>In this course, you'll:</p><ul><li><p>Foster the right mindset to confidently reach your sales goals<br></p></li><li><p>Use methods of influence to lead your prospect to the best outcome<br></p></li><li><p>Understand your prospect and the problems they're trying to solve<br></p></li><li><p>Execute immaculate discovery to set yourself up for success<br></p></li><li><p>Perfect your demo/pitch to make them want what you're selling<br></p></li><li><p>Get buy-in and agreement to close productive next steps<br></p></li><li><p>Conduct world-class follow up that makes it easy for your prospect to buy<br></p></li><li><p>Handle common objections and deflections with tried and true techniques</p></li></ul><p><strong>What's great is that ALL of this can be done REMOTELY, given the times we're in. I've also included a few tips specific to selling remotely when you're not able to be in the same room as your prospect.</strong></p><p>Now, in order to see results, you're going to have to put in the work. Don't just watch this course and call it a day. <strong>Every step of the way, I want you to put these techniques into practice.</strong> I want you to take a good look at the way you sell and figure out what could be better. How could you improve? Incorporate the things you learn in this course and you will see results.</p><p>I know for a fact you can be incredibly successful in sales and not have to sell your soul to do so.<strong> If you're ready to improve the way you sell, and do it the RIGHT way, join me in this course!</strong></p><p><br></p>","suitableLearners":["Sales reps who are currently responsible (or want to be responsible) for closing new business","Sales reps who want to sell the RIGHT way with no tricks or pushy tactics","Sales reps who are willing to put in the work to improve their approach and technique"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2020-12-14T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2020-12-17T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fd59c9b04f3f624d69b"],"topics":[],"reviews":[],"meta":{"ratingCount":1525,"studentCount":5793,"avgRatingScore":4.447825,"contentVideoLength":6450},"basicInfo":{"udemyCourseId":599738,"slug":"supply-chain-demand-planning-sales-forecasting-and-sop","title":"Supply Chain: Demand Planning (Sales Forecasting and S&OP)","subtitle":"S&OP: Generate Unconstrained Demand & Measure Sales Forecast Accuracy","image":"https://img-c.udemycdn.com/course/240x135/599738_77a3_3.jpg","price":1949670,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["Reflect reality of market demand and then drive a balanced sales forecast.","Measure forecast accuracy & apply forecasting improvement steps.","Generate rolling forecast for wider horizons for business growth & capacity planning.","Apply time fence policy of forecasting to draw the line between supply & demand teams."],"requirements":["Basic knowldge of excel formulas"],"description":"<p>This is a unique training course in its likelihood of implementation. Firstly, the course will teach you how to <strong>make mirror reflection of market demand</strong> by applying effective solution of developing sales forecast.</p><p>There will be horizontal techniques &amp; vertical approaches  which are constraining the forecasts figures to be at <strong>equilibrium phase</strong>.</p><p>Fundamental components to integrate demand with supply will be demonstrated as well in order to have high level of effective sales &amp; operation planning <strong>(S&amp;OP)</strong>. These are; <strong>rolling forecast, time fence policy, forecast variances,</strong> etc. <br></p><p><strong>Forecasting accuracy</strong> methodologies  will be explained as well, to drive assurance of having high level accurate sales forecasting figures and to operate at optimum cost of operation.<br></p><p>The course is explaining <strong>each concept by an exercise</strong> and this is what differentiating this course and making it unique one.</p><p>Each exercise is in a plug-and-play format, using Microsoft Excel to present information from a conceptual point of view. From this, it should be easy to compare the information presented to your current ERP system.</p>","suitableLearners":["Anyone from beginners & intermediate students who loves to learn step by step Demand(Sales Forecasting) Planning."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2018-11-02T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2018-11-05T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fd59c9b04f3f624d69b"],"topics":[],"reviews":[],"meta":{"ratingCount":1459,"studentCount":4466,"avgRatingScore":4.3734636,"contentVideoLength":4012},"basicInfo":{"udemyCourseId":671150,"slug":"sales-training-everyone-sells","title":"Sales Training – Everyone sells!","subtitle":"This course will give you extensive knowledge about the whole sales process.","image":"https://img-b.udemycdn.com/course/240x135/671150_fb1e_4.jpg","price":458570,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["Recognize and understand the components of a sale","Identify and implement strategies of the sales process","Apply selling tactics and techniques","Close the sale and upsell"],"requirements":["The course does not have any further requirements, only the willingness to become a better seller."],"description":"<p>This course is all about selling goods and services. You will learn different selling techniques, explore how relationships influence the selling process, and how variables can help you close the sale. We will have a close look at various ways of approaching the customer, and the most relevant techniques for asking the right questions. Furthermore, you will find out why people choose not to buy from you, and learn about the established model that will help you close a sale.</p>  <p>“Everyone sells” is designed for anyone involved in the sales process, from the front line to the more strategic levels. The course will not only introduce sales techniques to new sales personnel, but also provide seasoned professionals with a valuable opportunity to practice and assess their skills.</p>  <p>Upon completion of the course, you will have gained comprehensive understanding about:</p>  <ul><li>Components      of a sale</li><li>Strategy      of the sales process</li><li>Selling      tactics and techniques</li><li>Closing      the sale and upselling</li></ul>    <p>Mr. Hunt’s style is often described as ‘inspirational’. His goal is to always create positive change in people with whom he works. He has significant experience in successfully operating at all organizational levels—from the induction phase, through first line management, and right up to board level. Additionally, he is able to strike the appropriate level of debate on every occasion.</p>  <p>Mr. Hunt is the MD and principal facilitator of UK Seminars. His work is well known in many countries, e. g., in Europe, in the USA, in the Middle East, and in India. His delegate evaluations are excellent, averaging 9.0 on a 10 point scale.</p>","suitableLearners":["Anyone involved in the sales process, from the front line to more strategic levels","New sales personnel as well as seasoned professionals"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2015-11-25T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2015-11-28T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fd59c9b04f3f624d69b"],"topics":[],"reviews":[],"meta":{"ratingCount":1173,"studentCount":3959,"avgRatingScore":4.5031047,"contentVideoLength":5865},"basicInfo":{"udemyCourseId":1512040,"slug":"b2b-sales-objections-simplified","title":"B2B Sales Objections Simplified","subtitle":"B2B Sales Skill: Learn How to Handle the Most Common Sales Objections, Over the Phone and in Person!","image":"https://img-c.udemycdn.com/course/240x135/1512040_b75e_2.jpg","price":1949670,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["Learn directly from an ACTUAL Sales Director of Training for a Fortune 500 Company!","Master Objection Handling BOTH In Person and Over the Phone","Learn the Fortune 500 Framework to Handle Objections IN PERSON","Learn 5 Successful Pro Techniques for Handling Objections in Seconds OVER THE PHONE","This will PREPARE You for the 4 MOST COMMON Objections You’ll hear from Your Clients","Get Examples on How to Handle the Main 4 Objections whether its’s OVER THE PHONE or IN PERSON","BONUS Technique Included - How to Handle “YOUR PRICE IS TOO HIGH!”","Discover WHERE OBJECTIONS COME FROM and How to Sympathize with Your Client","Benefit from HANDOUTS Designed to Help You Customize Custom Objection Handling Scripts for Your Business","Never Be SURPRISED or INTIMIDATED to Get an Objection Again!","Handle objections with CONFIDENCE"],"requirements":["You should have a sales job (preferably in Business to Business)"],"description":"<p><strong>&gt;&gt; The fastest-growing Sales Training&nbsp;Series on Udemy! Learn directly from an actual Sales Director of Training for a Fortune 500 Company!&nbsp; The material inside is currently being taught at the highest level in the Fortune 500 sales space.&nbsp; You can't afford to miss this! &lt;&lt;</strong></p><p>**********&nbsp;</p><p><em>Are you afraid of&nbsp;getting an objection in sales?&nbsp; &nbsp;Are you using the same method to handle&nbsp;objections&nbsp;over the phone and in person?</em></p><p>In this part of SALES&nbsp;in 21 DAYS Program, all of your sales objections will be simplified. &nbsp;You will experience objections from clients in all&nbsp;aspects of your sales cycle. &nbsp;Each situation, whether it happens face to face or over the phone,&nbsp;you must use a different technique to handle them&nbsp;if you want to&nbsp;be successful. &nbsp;In this course we will cover where sales objections come from, how to handle them when the customer is in front of you, different techniques on how to handle them over the phone and even a technique on handling&nbsp;the price objection!&nbsp; You will leave this course with the materials ready to create custom&nbsp;objection handling scripts&nbsp;that will work for your business. &nbsp;Get ready to&nbsp;<strong>learn various&nbsp;sales techniques&nbsp;around the&nbsp;different scenarios you will receive objections, how to understand where your&nbsp;clients are coming from, and benefit from the objection handling materials that will be provided inside of the&nbsp;assignments section of the course!&nbsp;</strong><em>&nbsp;</em></p><p>**********&nbsp;</p><p>Peter, VP of Sales said:&nbsp;<strong>\"Derek's series on Sales are great on their own, but when taken together they make for a rounded experience covering the sales cycle in great detail. Derek is highly competent as a sales trainer, and while I've taken a lot of sales courses on Udemy, the courses by Derek stands head and shoulders above the rest.\"</strong></p><p>Scott says:&nbsp;<strong>“The instructor has a way of making the overwhelming task of handling objections&nbsp;seem achievable. He is very motivating!”</strong></p><p>Barbara says:&nbsp;<strong>“Another great course by Derek Shebby.”</strong></p><p>Learn directly&nbsp;from a highly successful Fortune 500 sales coach&nbsp;who has trained hundreds of sales reps, sales managers and vice presidents in their sales careers. &nbsp;The sales strategies you will learn are still being taught in the sales training&nbsp;classroom today. &nbsp;</p>","suitableLearners":["This course is for anyone in business to business (B2B) sales who wish to improve their objection handling skills!"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-01-06T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-01-09T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fd59c9b04f3f624d69b"],"topics":[],"reviews":[],"meta":{"ratingCount":1090,"studentCount":4197,"avgRatingScore":4.419535,"contentVideoLength":3314},"basicInfo":{"udemyCourseId":1338126,"slug":"create-b2b-sales-cold-calling-scripts-value-propositions","title":"Create B2B Sales Cold Calling Scripts & Value Propositions","subtitle":"B2B Sales Skill: Create Personalized Talk Tracks for Sales Reps that Win more Prospects and Close more Deals","image":"https://img-c.udemycdn.com/course/240x135/1338126_6a58_3.jpg","price":1949670,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["Learn directly from an ACTUAL Sales Director of Training for a Fortune 500 Company!","Learn the IMPORTANCE of Value Propositions and Why They Could Be the KEY to Increasing Your Sales Results!!","Easily Apply Fundamental Sales Techniques that Separate Your Product or Service From Other Vendors","Understand The 4 STEP Framework to Use to Create Sales Value Propositions","Discover How to DELIVER a Value Proposition in a Way Your Customer WILL REMEMBER IT","How to Create a COLD CALLING TALK TRACK to set appointments from Scratch!","How to Create an ELEVATOR PITCH for your product or service"],"requirements":["This course is meant for anyone in the field of sales"],"description":"<p><strong>&gt;&gt; The fastest-growing Sales Training&nbsp;Series on Udemy! Learn directly from an actual Sales Director of Training for a Fortune 500 Company!&nbsp; The material inside is currently being taught at the highest level in the Fortune 500 sales space.&nbsp; You can't afford to miss this! &lt;&lt;</strong></p><p>**********&nbsp;</p><p><em>How do you know if the talk tracks you're using to set appointments and close clients are good enough?</em></p><p>In this part of SALES&nbsp;in 21 DAYS Program, you will learn how to create value propositions that help you in all parts of your&nbsp;sales career.&nbsp;&nbsp;What you say to get clients interested in meeting with you is important and the better your sales&nbsp;skills are, the more effective you will become. &nbsp;At client meetings you have moments to connect what they care about most to what you could offer them. &nbsp;When closing, there is a transfer of excitement and the importance of them remembering why your product or service is special. &nbsp;&nbsp;Get ready to learn sales techniques&nbsp;of how to create and&nbsp;structure&nbsp;value propositions,&nbsp;phone cold calling talk tracks and elevator pitches that will result in higher commissions. &nbsp;</p><p>**********&nbsp;</p><p>Peter, VP of Sales said:&nbsp;<strong>\"Derek's series on Sales are great on their own, but when taken together they make for a rounded experience covering the sales cycle in great detail. Derek is highly competent as a sales trainer, and while I've taken a lot of sales courses on Udemy, the courses by Derek stands head and shoulders above the rest.\"</strong></p><p>Jessica says: <strong>“This was a fantastic course! I've always had trouble putting my talk track together, and stumbled through my elevator pitch. I loved the tips, the process given AND the documents attached are super helpful!”</strong></p><p>Rachel says: <strong>“Really valuable videos!! The instructor really explained the whole progress of how to create the value proposition in an easy to implement way, and the scenarios also made it easy for me to understand. The take aways were a great bonus too!”</strong></p><p>Colleen says: <strong>“Very informative and relevant to real life situations”</strong></p><p>Chris says: <strong>“It's giving me a lot of good tips to keep me motivated and improve my sales.”</strong></p><p>Learn directly&nbsp;from a highly successful Fortune 500 sales coach&nbsp;who has trained hundreds of sales reps, sales managers and vice presidents in their sales careers. &nbsp;The sales strategies you will learn are still being taught in the sales training&nbsp;classroom today. &nbsp;</p>","suitableLearners":["All students who wish to increase their commissions and sell more of their product or service","This course is for anyone in sales who wants to learn the fundamentals for creating talk tracks, cold calling scripts, and customized elevator pitches"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-01-06T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-01-09T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fd59c9b04f3f624d69b"],"topics":[],"reviews":[],"meta":{"ratingCount":863,"studentCount":5651,"avgRatingScore":4.4269104,"contentVideoLength":3593},"basicInfo":{"udemyCourseId":383398,"slug":"customer-service-how-to-sell-more-without-advertising","title":"Customer Service: How to sell more without advertising","subtitle":"Learn how to create a customer experience that earns you customer loyalty and creates word of mouth advertising.","image":"https://img-c.udemycdn.com/course/240x135/383398_b53b_4.jpg","price":1146770,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["Master the strategies, the psychology, the systems, processes and people that go into creating a great customer experience, one that creates loyalty and generates word of mouth sales.","Put in place a cycle of continuous improvement that enables you to grow the business organically, reduce marketing costs and increase profits.","Discover the 10 essential ingredients for creating the wow factor."],"requirements":["No additional materials or software are necessary.","You will need to a good understanding of the English language, ideally to business level.","You'll need the right setting to be able to concentrate and you may find it helpful to take notes, although all of the texts are downloadable. "],"description":"<p>Most businesses concentrate all their marking effort on attracting new customers, but smart businesses focus on providing a customer experience so fantastic that they&#039;re able not only to retain their existing customers but they also attract new ones through word of mouth.</p><p>In this course you&#039;ll learn how to develop a customer-centric strategy and put in place the people, processes and systems to create the wow factor and transform your customer experience, following in the footsteps of the world&#039;s favourite brands.</p><p>With over an hour&#039;s worth of carefully structured videos using real world examples, plus interactive quizzes I&#039;ll give you the tools to understand what makes customers tick, to shape your business around the customer experience and create a cycle of activity which leads to constant improvement, gets your employees on board and has your customers doing your advertising for free.</p><p>This course offers owners and managers of small to medium sized enterprises the opportunity to grow their profits organically, without spending a fortune on marketing.</p><p></p><p></p>","suitableLearners":["This course is designed for owners and managers of small to medium sized enterprises with an existing customer base. Many of the examples used are based on a business to consumer model but are equally valid for business to business. ","This course is not designed for sole traders or freelancers, although some of the principles covered are applicable to this group."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2015-06-02T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2015-06-05T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fd59c9b04f3f624d69b"],"topics":[],"reviews":[],"meta":{"ratingCount":855,"studentCount":11313,"avgRatingScore":4.9189243,"contentVideoLength":34994},"basicInfo":{"udemyCourseId":948452,"slug":"how-to-sell-anything-to-anyone","title":"How to Sell Anything to Anyone","subtitle":"Ethically Proven Persuasion Techniques, Sales Systems, Effective Negotiations & Pitches, All Backed By Years of Science","image":"https://img-b.udemycdn.com/course/240x135/948452_71eb_8.jpg","price":2064370,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["Understand The True, Deep-Down Needs of Your Potential Customer","Learn How To Talk So That People Buy","Bypass Common Excuses & Close The Deal","Overcome Shyness To Sell By Backing Your Confidence In This Proven Sales Technique"],"requirements":["Understand English"],"description":"<p>Are you nervous about selling products &amp; services online or off?</p><p>Do you feel that some people don't take you seriously enough or that you don't have the much-needed confidence?</p><p>Are you happy with your income? Are there missed opportunities slipping through your fingers that you don't know about?</p><p>If you want to drastically improve your sales success then you've come to the right place.</p><p>These testimonials sum up what this course can do for you:</p><p><strong><br></strong></p><p><strong>Scott Jackson</strong></p><p>In this course on sales Desmond points out some very enlightening information. I have been in outside sales for a number of years and thought I was an old hat at it. He showed me that and \"old dog can learn new tricks\" with his training and new insights on this course. His delivery keeps me very interested in the subject matter and I seem to be able to remember it even better. Everyone is in sales no matter what you are doing so this course can be a benefit to anyone who needs to improve their sales skills. Even if you are just trying to get a date, job, promotion, talk your partner into going out to dinner - this course if for you!<br>Desmond's training is spot on. He has a style that is easy to understand and learn from. So don't hesitate - get this course and you will have a better grasp of sales!</p><p><strong><br></strong></p><p><strong>Jennifer Johnson</strong></p><p>Calling all entrepreneurs, salespeople, career driven people, and anyone looking to boost their productivity! This class provides you with actionable methods to understand how your potential customers think, what tools you can use to hook them with the unexpected, and how to lead them to the proverbial water most effectively, rather than forcing them to drink. Instructor Desmond Bryam introduces concrete techniques for pitching to clients and investors, what you need to become awesome at public speaking (which we all need), and how to close the sale. I’m not a salesperson, but this course taught me how to pitch myself in career settings (after all, we have to be selling our skills and framing ourselves the best we can in order to snag that job or promotion), as well as boost my productivity at work with hacks such as the pomodoro technique, and how to set “mini habits” for success. Desmond is a phenomenal speaker and teacher, and he truly practices what he preaches. I highly recommend this course, and encourage you to learn from the best!</p><p><br></p><p><br></p><p><strong>A Little About My Experience:</strong><br></p><p>I started my first sales company when I was 15 years old &amp; I already had a team working for me at that time (we sold embroidered polo shirts) </p><p>By age 22 I owned a full-time investment agency (Doyle Wealth Financial) with my own team. </p><p>But my age &amp; shyness were always a factor. Being taken seriously &amp; being assertive enough to demand the authority that I deserved in each industry was a problem for me.</p><p>The answer came when I discovered Neuro-Scientific research that pointed to why we all do what we do &amp; think how we think. </p><p>These ideas gave me the confidence to overcome the unknown because it shined a bright light on everything that I needed to know to own the sales world.</p><p>Have you ever learned something about a topic that once seemed so terrifying, and then when you understood it all, you sort of laughed at yourself for fearing it all this time?</p><p>Well that's exactly what happened to me &amp; what will happen to you once you learn the killer system in this very course.</p><p>I developed this proven method in order to now share with you what led to my success so early on.</p><p>The Close More Sales Method (Years In The Making) Is Backed By Science &amp; Proven Results:\n</p><ul><li><p>Learn This One Thing That Gets Everyone's Attention (Fast)</p></li><li><p>Create Your Own Inner Value Proposition</p></li><li><p>Gather Specific Intelligence To Present Like A Pro</p></li><li><p>Get Real-Time Insights About Your Prospect</p></li><li><p>Work With Screeners, Gatekeepers, And Assistants</p></li><li><p>Perfect Your Opening &amp; Closing Statements</p></li><li><p>Minimize Resistance</p></li><li><p>Get A Commitment For The Next Action</p></li><li><p>Stay Motivated</p></li><li><p>And Much, Much More!</p></li></ul><p><br></p><p>\n You are going to learn the rock-solid neuroscience &amp; psychology behind these unstoppable sales techniques. \n</p><p> I’ve learned over time that those who truly want to succeed in sales, for the longterm &amp; for many years to come, are those that know the value of a good reputation &amp; trust, plus they aren’t lazy, they actually want to succeed &amp; make a good living off of helping everyone win.\n</p><p> This course will teach you how to craft a true win-win-win scenario where first the customer wins by getting exactly what they want &amp; the company wins by growing &amp; you automatically win by getting paid for your results. The more you help everyone else win, the more you will win &amp; this is a timeless method that will boost your career for a lifetime. \n</p><p> Honesty never goes out of style in selling, but short gimmicks only last so long.\n\n</p><p> I am going to show you how I was so frustrated in sales because I was being so honest with my customers but still not selling as much as I could have, I was barely making it.\n</p><p> Then I discovered that honesty &amp; trust needed one more critical key added to it in order to become the ultimate selling machine.\n</p><p>After learning these simple ideas (all backed by science &amp; proven results) I was then able to work part time hours &amp; earn the same (or more) commissionable income than the top agents in my firm who worked fulltime hours!</p><p> I found those critical pieces that were missing, what we all desire &amp; what specific pieces of information mean the most to us &amp; help us feel good &amp; secure about our purchase. This drastically increased my success in sales.</p><p> I am going to show you exactly what they are &amp; how you can easily obtain these skills in your own career/pursuit/venture or project.</p><p>\n\n It's interesting how we all create a narrative based on what we think is important.\n\n We see what we want to see. But just because you’re not looking at something…    doesn’t mean it’s not there. Learn the missing key to your sales success right here &amp; right now.\n</p><p> This strategy kept working in every industry I moved on to, it was insane! This is because of a very fundamental fact, you are always selling to a human, robots don’t buy stuff. \n</p><p> Even the most reasonable person is still a human &amp; has feelings &amp; emotions no matter how hard you think it is to find it in them. But they always have a direct route or channel to their emotion switch. We are all hardwired with that same exact switch. \n</p><p> Some people's emotional switch might be a little harder to turn, you might have to put a little more effort into it, but its still there &amp; I’ll show you how to find it &amp; work with it so that both you &amp; your customer truly win every single time.\n\n\n</p><p> Your probably having the same exact doubt that I had: this works fine with person to person sales in the public, but working B2B is a different game all together. \n\n</p><p> I thought the same exact thing too! \n</p><p> And I was wrong, this method works even better!!!\n</p><p> I found out that in bigger industries where selling to big companies is so important, the employees are even more desperate to be treated this way &amp; to be truly understood even more so because everyone just sees them as one big company faceless company with no individuality. \n</p><p> But when you put a face on something it changes how you view it, even how you treat them. A study done with X-Ray technicians found that if you add a photo of the person to their folder, then the technician spends more time, gives more accurate &amp; thorough findings &amp; overall gives better quality. All they did was add a photo of the person to the chart. They put a face on them.\n</p><p> I found a way to be unexpected &amp; it worked so well that I used a presentation time &amp; again that was just a restaurant menu template. The first time I used it was with an extremely hard to sell accountant who counted everything twice. \n</p><p> After I delivered the presentation to the CEO &amp; then again to the tight budgeted CFO, this simple presentation resulted in a six figure deal that lasted for years. I will show you how to the deliver like this.\n</p><p> If you want to learn how to close more sales &amp; reach your full selling potential then this course is right for you. </p><p>Let's take this journey together. I'll see you inside.</p>","suitableLearners":["Entrepreneurs","Small Business Owners","Managers","Young Professionals","B2B sales people","B2C sales people","Sales Executives","Business Directors"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2020-06-17T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2020-06-20T00:00:00.000Z"},"promotions":{"discountPrice":298220,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}}]