[{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fe09c9b04f3f624d6a5"],"topics":[],"reviews":[],"meta":{"ratingCount":3188,"studentCount":24048,"avgRatingScore":4.090512,"contentVideoLength":1877},"basicInfo":{"udemyCourseId":698362,"slug":"understand-swot-analysis-in-30-minutes","title":"Understand SWOT Analysis in 30 minutes","subtitle":"Learn every aspect of SWOT analysis and how you can apply it to real-world problems!","image":"https://img-c.udemycdn.com/course/240x135/698362_78e9_4.jpg","price":458570,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["Successfully perform a SWOT analysis","Understand every aspect of SWOT analysis","Learn what makes a great SWOT analysis","Understand the value of SWOT analysis to any business","Apply SWOT analysis at any stage of the project lifecylce ","Understand the concept behind the SWOT analysis"],"requirements":["No specific materials or knowledge is required prior to taking this course"],"description":"<p><strong>UPDATED&nbsp;02/2020:</strong></p><p><strong>Added several quizzes to help you check your knowledge!</strong></p><p>This course is about SWOT Analysis. Together we will go through every aspect of this fundamental business analysis tool. We will learn why SWOT&nbsp;analysis is so important for any business, how to conduct it and when. We will go through each category in detail:&nbsp;Strenghts, Weaknesses, Opportunities and Threats.&nbsp;</p><p>This course can be taken by both absolute beginners and skilled professionals. All specific terminology&nbsp;used in the course is thoroughly explained and repeated several times. This course follows a logical pattern of going from a broad perspective of the general idea behind SWOT&nbsp;analysis to specific rules and tips. This course also features case studies help you practice all the theoretical knowledge you have received.</p><p>There isn't any unnecessary information in the course, letting you complete it in under an hour. This course is perfect to learn SWOT&nbsp;analysis or refresh your memory on any particular topic about it.</p><p><br></p>","suitableLearners":["Students who are not familiar with SWOT analysis or have troubles implementing it in their projects","Students who want to improve their knowledge of SWOT analysis and resolve any troubles they might have had earlier.","Students who want to refresh their knowledge of a SWOT analysis in general or its any particular topic."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2020-02-07T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2020-02-10T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fe09c9b04f3f624d6a5"],"topics":[],"reviews":[],"meta":{"ratingCount":2636,"studentCount":58973,"avgRatingScore":3.8794055,"contentVideoLength":2520},"basicInfo":{"udemyCourseId":170840,"slug":"how-to-write-the-ultimate-1-page-strategic-business-plan","title":"How to Write the Ultimate 1 Page Strategic Business Plan","subtitle":"Learn to Write a 1 Page Strategic Plan That Will Easily Bring You a 6 - 7 Figure Income & Guaranteed Business Success","image":"https://img-c.udemycdn.com/course/240x135/170840_3e57_5.jpg","price":458570,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["To create a powerful business vision that will motivate you to succeed.","To create a the most powerful goals that will help take your business to the next level.","To layout a step-by-step action plan that will guarantee you succeed at achieving your goals.","To establish a 90 Day Action Plan that will show you what to do every week for the next 90 days.","To help you use all of your strengths, advantages and opportunities to boost your results.","To find solutions for any potential obstacles and threats that can keep you from succeeding","To hold you accountable throughout the year, to make sure you accomplish all of your business goals."],"requirements":["Download the 1 Page Strategic Plan Template and follow with the class.","Write out your full 12 month strategic plan by the end of this program.","Write out your 90 Day Action by the end of this program.","Begin putting to practice your 90 Day Action plan and start seeing some success."],"description":"<p style=\"\">  \t       You've probably had many dreams of where you would like to take your small business...  </p>  <p style=\"\">  \t              It could be that you want to make a 6 or 7 figure income...  </p>  <p style=\"\">  \t     Or, it could be that you want to expand your business and succeed greatly...  </p>  <p style=\"\">  \t     Or maybe you just want to get more customers for your business...  </p>  <p style=\"\">  \t              Whatever your goals and visions are for your business, the one thing you will need to get there is a great plan.  </p>  <p style=\"\">  \t              Think about it for a minute...  </p>  <p style=\"\">  \t              Have ever wanted to get somewhere, and you didn't have the directions to get there?  How frustrating was that?  </p>  <p style=\"\">  \t   Didn't it save you so much time and frustration, when you could easily use your GPS to help you get to your location?  </p>  <p style=\"\">  \t <strong style=\"\">           A strategic plan is the GPS for your business</strong>.  A strategic plan is the roadmap that will:  </p>  <ul style=\"\">  \t<li style=\"\">Tell you what to do, step-by-step, in your business until you reach all your goals.</li>  \t<li style=\"\">Help you identify the most important things you should be doing so that you don't waste your valuable time and money.</li>  \t<li style=\"\">Help you break up your key actions steps into small chunks, so that you can do a little at a time, until you eventually reach all of your business goals.</li>  </ul>  <p style=\"text-align: center;\">  \t<strong style=\"\">Do I Need a 20 Page Business Plan?  No Way! </strong>  </p>  <p style=\"text-align: center;\">  \t<strong style=\"\"></strong> <strong style=\"\"></strong><strong style=\"\">Use this 1 Page Strategic Plan Instead...</strong>  </p>  <p style=\"\">  \t              Many people believe that you need pages and pages of complex information in order to build a successful business.  </p>  <p style=\"\">  \t              But that is <strong style=\"\">just not true</strong>...  </p>  <p style=\"\">  \t   Think about it... Do you read the 50 page manual that comes with all your electronic products? Or do you simply just follow the <strong style=\"\">1 page basic instructions</strong> that comes with the box?  </p>  <p style=\"\">  \t   They are both helpful, but the 1 page instructions get you started much quicker, and helps you to enjoy your product much faster.  </p>  <p style=\"\">  \t              In the same way, this 1 Page Strategic Business Plan will give you everything you need to reach all of your business goals.  </p>  <p style=\"\">  \t              Also, because it's so simple, it makes it easier to do everything you are supposed to do to succeed in your business.  </p>  <p style=\"text-align: center;\">  \t<strong style=\"\">Why is This Strategic Business Plan Just 1 Page?</strong>  </p>  <p style=\"\">  \t              Since 20% of the things we do bring 80% of the results, we've created a 1 Page Strategic Plan that focuses only on the <strong style=\"\">Top 20% that bring the biggest results.</strong>  </p>  <p style=\"\">  \t              Most business plans are full of a lot of unnecessary information, and they make you do a lot of steps that just waste your valuable time.  </p>  <p style=\"\">  \t              This 1 Page Strategic Plan only describes the <strong style=\"\">most important and powerful steps</strong> you should take to help you <strong style=\"\">achieve your 6 - 7 figure goals</strong>, or help you achieve all of your other goals.  </p>  <p style=\"text-align: center;\">  \t<strong style=\"\">Does this 1 Page Strategic Business Plan Really Work?</strong>  </p>  <p style=\"\">  \t              Absolutely!  </p>  <p style=\"\">  \t              This 1 Page strategic plan has helped many business owners take their business to the next level in their business by helping them:  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">Increase revenue by 30 - 50%.</strong></li>  \t<li style=\"\"><strong style=\"\">Operate more efficiently</strong></li>  \t<li style=\"\"><strong style=\"\">Get more customers</strong></li>  \t<li style=\"\"><strong style=\"\">Increasing profits</strong> by helping them use their money more wisely,</li>  \t<li style=\"\">And much more...</li>  </ul>  <p style=\"text-align: center;\">  \t<strong style=\"\">Will It Work for Me?</strong>  </p>  <ul style=\"\">  \t<li style=\"\">If you're a small business owner or entrepreneur, and you have important goals that you want to achieve -  then <strong style=\"\">this 1 Page Strategic Plan will help you succeed.</strong></li>  \t<li style=\"\">If you're a person that wants to start a new business, but you want a <strong style=\"\">roadmap to help guarantee your success</strong>, then this 1 Page Strategic Plan will help create that roadmap for you.</li>  \t<li style=\"\">If you want to get yourself and your business to a <strong style=\"\">new level of success</strong>, this 1 Page Strategic Business Plan, will lay out a <strong style=\"\">step-by-step plan</strong> to show you everything you need to do.</li>  </ul>  <p style=\"\">  \t     There are 2 types of business plans:  </p>  <ul style=\"\">  \t<li style=\"\">Business plans to get you business funding and</li>  \t<li style=\"\">A Strategic plan to help you succeed in your business.</li>  </ul>  <p style=\"\">  \t <strong style=\"\"><strong style=\"\"> The \"How to Write the Ultimate Strategic Plan\" course will show you how to guarantee the success of your business, so that you can see all of your business goals, visions and dreams become a reality.</strong></strong>  </p>","suitableLearners":["Entrepreneurs","Small Business owners","Wanna Be Entrepreneurs","Established small business owners that want to take their business to the next level of success."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2014-02-27T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2014-03-02T00:00:00.000Z"},"promotions":{"discountPrice":298220,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fe09c9b04f3f624d6a5"],"topics":[],"reviews":[],"meta":{"ratingCount":2597,"studentCount":17633,"avgRatingScore":4.4921117,"contentVideoLength":40085},"basicInfo":{"udemyCourseId":240450,"slug":"business-strategy-execution-agile-organization-design","title":"Business Strategy Execution: Agile Organization Design","subtitle":"Transforming Culture and Capabilities to Execute Business Strategy: The Agile Way to Business Strategy Success","image":"https://img-c.udemycdn.com/course/240x135/240450_3b78_7.jpg","price":1949670,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["To create a process of agile action to achieve strategic business goals.","To align the internal technical systems (work process), social systems, and economic system to achieve business strategy.","To achieve agile adaptation and alignment of the organization's systems, structure, skills, style and symbols.","To engage the maximum number of leaders and associates in the process of building the future culture and capabilities that will lead to sustainable performance."],"requirements":["Any prior understanding of organization culture and strategy; as well as change management experience, will be helpful."],"description":"<p>Your business success is not merely having a goal, a direction, a vision. It is the ability to change, to create the process, the organization, the capabilities and culture, that result in performance. This course is a roadmap that will enable you to successfully execute strategy.</p><ul><li><p><em>\"Engaging and enlightening. Larry's wealth of experience allows you to easily apply the subject matter to the real world.\"&nbsp;</em>Neil Shaw</p></li></ul><p>Note: Now included is the complete ebook <strong><em>Getting to Lean - Transformational Change Management</em></strong>. It is attached to lecture 4.&nbsp;</p><p>Business Strategy Execution is a hot topic in management today. The Conference Board's recent Survey of CEOs revealed that chief executives are so concerned about strategy execution that they rated it as both their number one and number two most challenging issue.</p><p>Why does strategy execution so often fail? Because most strategic plans are little more than a series of vertically integrated objectives. But, the problem is not objectives and it is not vertical. It is the \"whole-system\" and its ability to adapt and align, internally and externally in fast cycles. In other words, to be agile. The problem is the culture and capabilities of the organization and a process to design and deploy those capabilities. This course provides that process and is based on forty years of experience improving the performance of organizations.</p><p>The problem is developing new capabilities and a new culture that will enable the organization to achieve its goals. The term <strong><em>\"Agile\"</em></strong> implies an iterative process of experimentation, learning, adaptation to the changing environment, and alignment with other business units and support groups. This course is about creating that agility, adaptation and alignment.</p><p>Every organization has capabilities that are embedded in the culture. This course will take the leader through a process of assessing the current culture, its assets and liabilities, sensing the changing landscape that presents threats and opportunities, and then engaging the organization in the design of those processes and systems that will represent competitive advantage.<br></p><p>&nbsp; \tThe author of this course is the author of ten books on leadership, lean management and change process. This course includes the text and material from three of his books. </p>","suitableLearners":["Leaders and leadership teams with business unit responsibility."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2020-03-24T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2020-03-27T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fe09c9b04f3f624d6a5"],"topics":[],"reviews":[],"meta":{"ratingCount":2023,"studentCount":5775,"avgRatingScore":4.3547683,"contentVideoLength":4548},"basicInfo":{"udemyCourseId":632782,"slug":"best-practices-in-document-management","title":"Best Practices in Document Management","subtitle":"Develop your cost-effective and future-proof documentation strategy","image":"https://img-b.udemycdn.com/course/240x135/632782_c91f_3.jpg","price":1490870,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["Identify the causes of inefficient documentation","Apply a set of best practices to roll out a cost-effective and future-proof corporate strategy for documentation","Champion change management processes related to documentation, from an enterprise analysis perspective","Speak the lingo of technical publications at a conceptual level"],"requirements":[],"description":"<p>Documentation is nowadays regarded as <strong>an integral part of selling a product or service to customers</strong>. You might have at your disposal the best technological systems, publishing applications and the related tools for working and editing your content, but without <strong>the proper best practices in place</strong>, chances are the processes you implement for taking care of the life cycle of your documentation will not be planned and managed adequately, which means that you will be less successful in your operations.</p><p>You need best practices for several reasons - for example, they allow you to plan the delivery of your documentation in a more rigorous manner, allow you to cut down on costs, have more visibility of your processes and be able to manage your human and technological resources in a better way, among other benefits. The great thing with best practices is that they allow you to <strong>implement your systems, processes, and roles within a framework that is future-proof</strong> and that you can reconfigure as, and when required.</p><p>This course is all about these best practices and is <strong>an invaluable reference for anyone wishing to take document management to the next level</strong>. You will gain awareness of all the fundamental considerations for turning documentation into, not only a corporate-wide function, but also to improve the way you think about the delivery of your documentation at a personal level. Furthermore, while this course is primarily focused on document management, it is by no means limited to that - meaning you will find it really <strong>helpful in any environment where building a successful strategy for the delivery of content</strong> is required, whether that be finance, legal, engineering, software and many more. So, dive in and unleash the full potential of your content by adopting these best practices in document management!</p>","suitableLearners":["Anyone who is directly or indirectly impacted by documentation","Individuals wishing to gain knowledge of how to plan and manage the documentation cycle","This course is not intended for those who already have extensive knowledge of document management"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-02-16T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-02-19T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fe09c9b04f3f624d6a5"],"topics":[],"reviews":[],"meta":{"ratingCount":2005,"studentCount":26425,"avgRatingScore":4.3306665,"contentVideoLength":23944},"basicInfo":{"udemyCourseId":179174,"slug":"how-to-write-a-business-plan-and-a-winning-business-model","title":"How To Write A Business Plan And A Winning Business Model","subtitle":"Business plan template & business plan examples: Create a top business model & business plan for your business ideas","image":"https://img-b.udemycdn.com/course/240x135/179174_fe95_10.jpg","price":1146770,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["Write your business plan that contains winning business strategies","Create a strong business model for businesses like: Local services, freelancing, eCommerce, affiliate, self-branded businesses, and innovative start-ups","Step-by-step walkthroughs for writing each section of a business plan","Evaluate your target market: Is it big enough? Is it lucrative enough?","Identify the most effective monetization strategy for your business","Master business planning concepts like cash flow statement, lifetime customer value, and unit economics","Save money by not having to hire a business plan consultant or buying business plan templates"],"requirements":["Desire to write a business plan that would bring you one step closer to realizing your dreams"],"description":"<p><strong><em>Revolutionary, new way to write a professional business plan that will help you identify the most effective business strategies for your situation.</em></strong></p><p><strong><em>Take this step to start your business, achieve independence, and become your own boss.</em></strong></p><p><strong><em>Latest course update for 2022:</em></strong></p><ul><li><p><em>More business plan examples of different businesses across different industries</em></p></li><li><p><em>Innovative three-sentence business plan to get you started</em></p></li><li><p><em>Take your three-sentence business plan, expand it into a&nbsp;one-page business plan, and then a full and professional business plan&nbsp;</em></p></li><li><p><em>Top-ten business planning mistakes and exercises to help you avoid them</em></p></li><li><p><em>More details added to the financials section</em></p></li><li><p><em>How you can turn yourself into a stronger entrepreneur</em></p></li></ul><p>============================</p><p><strong>WHY&nbsp;YOU&nbsp;NEED&nbsp;MORE&nbsp;THAN&nbsp;A&nbsp;BUSINESS&nbsp;PLAN&nbsp;DOCUMENT</strong></p><p>Many courses just focus on writing a business plan document. But the value of business planning is that it helps you start - not have some useless document that no one wants to read. </p><p>This is the issue in the business planning industry: People selling useless fill-in-the-blank business plan templates that have useless information that isn't catered to your unique business.</p><p>In this course, you'll learn how to create great business strategies that will help you have an ideal start your business.</p><p>============================</p><p><strong>INSTRUCTOR BACKGROUND: THOUGHT LEADER&nbsp;IN&nbsp;BUSINESS&nbsp;PLANNING</strong></p><p>My business plan book 'How To Write A Business Plan' is consistently the top business plan book on Amazon. My book is used by a number of universities and high schools, and I regularly get invited by these institutions to give talks about starting a business.</p><p>I've been an entrepreneur for 20 years, have personally coached over 1,000 entrepreneurs, taught 150,000+ students online, and helped millions of entrepreneurs worldwide, some of whom created 6 and 7-figure businesses, and I&nbsp;can help you too.</p><p>============================</p><p><strong>ARE&nbsp;YOU&nbsp;FACING THESE COMMON&nbsp;BUSINESS PLANNING&nbsp;PROBLEMS? </strong></p><p>After coaching over 1,000 entrepreneurs, I&nbsp;saw entrepreneurs make the same business planning mistakes time and time again:</p><ul><li><p>Confusion from cumbersome templates that don't give you the right strategies for your unique situation</p></li><li><p>Not knowing which business strategies are best to choose</p></li><li><p>Feeling confused, losing confidence, and quitting </p></li><li><p>Over-planning and never starting </p></li><li><p>Under-planning and stumbling into common costly errors </p></li><li><p>Stress! Lots and lots of stress</p></li></ul><p>Not only have I&nbsp;coached people like you, but I've also been there myself. I've felt the stress and confusion you might be feeling now. I know how difficult it can be, and I'll do whatever I&nbsp;can to help you put it all behind you.</p><p>============================</p><p><strong>IMPROVED&nbsp;BUSINESS&nbsp;PLANNING BASED&nbsp;ON EXPERIENCES&nbsp;OF&nbsp;ENTREPRENEURS&nbsp;JUST&nbsp;LIKE&nbsp;YOU</strong></p><p>I created a new and much easier way to write a business plan that solves all the problems plaguing entrepreneurs and helps to ensure that the strategies you plan are optimal.</p><p>Say goodbye to confusion, stress, frustration, confusing templates, and most importantly say goodbye to costly business errors. </p><p>My innovation is the three-sentence business plan that focuses on the core elements of your business and naturally expands into a full business plan. </p><p>When you focus on the most important aspects of your business, you are more likely to plan those parts of your business correctly, make fewer mistakes, and ultimately create a stronger business. </p><p>After you create your three-sentence business plan,&nbsp;I'll show you how to expand it into a one-page business plan, and then into a full business plan that has optimal strategies.</p><p>============================</p><p><strong>BALANCE THE&nbsp;BUSINESS&nbsp;PLAN WITH&nbsp;EXECUTION</strong></p><p>You can't start without planning, but over-planning is also a problem. This course balances the two. </p><p>Real-world execution of your business strategies is more important than planning. Each section of the course shows you how to plan your business and at the same time gives you actionable, real-world advice for how to execute after you start.&nbsp; </p><p>============================</p><p><strong>START PLANNING&nbsp;NOW AND START&nbsp;YOUR&nbsp;BUSINESS&nbsp;SOONER</strong></p><p>Upon completion of this business plan course, you will be able to write a good business plan on the very same day. The sooner you plan, the sooner you'll start your business with a stronger foundation, business model, and ultimately reach all your goals. So start today by enrolling in this business plan course. Stop waiting and start doing! </p><p>============================</p><p><strong>IS&nbsp;BUSINESS&nbsp;PLAN&nbsp;WRITING&nbsp;STILL&nbsp;POPULAR OR&nbsp;NECESSARY?</strong></p><p>Some people say that business plan writing isn't a good thing to do. In fact, business plan writing has become less popular with start-ups. There is a good reason for that. Start-ups tend to go all in quickly with little time to plan. A business plan for startups isn't common because startups don't have time to focus on writing a long business plan document. </p><p>But strategic business planning is still necessary even if extensive business plan writing isn't always ideal.</p><p>============================</p><p><strong>WHICH&nbsp;BUSINESSES CAN&nbsp;BENEFIT&nbsp;FROM&nbsp;WRITING&nbsp;A&nbsp;BUSINESS&nbsp;PLAN&nbsp;USING&nbsp;THIS&nbsp;COURSE?</strong></p><p>This course can help different businesses from local brick and mortar businesses to online businesses and startups.</p><p>Common brick and mortar businesses planned with this course: restaurant, cleaning, gym, coaching, boutiques, stores, and various services.&nbsp; </p><p>Comm startups planned with this course:&nbsp;mobile apps, YouTube, influencer businesses, eLearning businesses, eCommerce businesses, freelancing, innovative startups.</p><p>============================</p><p><strong>BONUSES&nbsp;INCLUDED</strong></p><p>* Extra freebies and downloadable worksheets</p><p>* Personal invitation to my Facebook community where you can discuss business strategy with other entrepreneurs</p><p>* My list of 50 business-success skills after course completion (business plan writing is only one of them)</p><p>============================</p><p><strong>THIS&nbsp;COURSE&nbsp;IS&nbsp;IDEAL&nbsp;FOR&nbsp;YOU&nbsp;IF YOU:</strong></p><ul><li><p>Are a first-time entrepreneur writing your first business plan</p></li><li><p>Are stressed and stuck on writing a business plan</p></li><li><p>Want to create a great strategy before starting their business</p></li><li><p>Need a business plan to help them raise money</p></li><li><p>Are starting an Ecommerce business, local business, affiliate business, self-branded business, innovative start-up, mobile app, B2B business, service business, or home-based business with one or two people</p></li></ul><p>============================ </p><p><strong>TYPES&nbsp;OF BUSINESSES&nbsp;YOU&nbsp;CAN&nbsp;PLAN&nbsp;WITH&nbsp;THIS&nbsp;COURSE</strong></p><p>You can plan any type of business including a restaurant or diner, coffee shop, barbershop, spa, salon, nightclub, local event, most kinds of stores ranging from boutiques to grocery stores to jewelry shops, animal care or grooming, lawn care or landscaping businesses, moving businesses, gym, frozen yogurt or ice cream shop, a deli, liquor store or a sandwich shop, a beauty salon or a hair salon, a spa, a daycare business, a hardware store, commercial cleaning or residential cleaning, car wash, general contractor business, dog walking or pet sitting, t-shirt business, martial arts studio, dance studio, residential cleaners, commercial cleaners, dentist office, therapy services, medical offices and doctor's medical practices.</p><p>============================ </p><p><strong>RESPONSIVE&nbsp;AND&nbsp;CARING&nbsp;INSTRUCTOR: WORLD-CLASS&nbsp;STUDENT&nbsp;SUPPORT</strong></p><p>If you have questions, know that I&nbsp;am here to help!&nbsp;I&nbsp;answer 99% of student questions within 24 hours. Many students tell me that other instructors don't respond. Well, I do because </p><p>1) I care about my students.</p><p>2) I feel a responsibility to make sure that students get their money's worth from the course.</p><p>============================</p><p><strong>CERTIFICATE&nbsp;OF&nbsp;COMPLETION WHEN&nbsp;YOU&nbsp;FINISH&nbsp;100% OF&nbsp;THIS&nbsp;BUSINESS&nbsp;PLAN&nbsp;COURSE</strong></p><p>When you complete 100% of the videos in this business plan course, you will be emailed a certificate of completion by Udemy so you can show it as proof of your business planning expertise and that you have completed a certain number of hours of instruction in writing business plans.</p><p>============================</p><p><strong>MONEY-BACK GUARANTEE&nbsp;SO BUY NOW</strong></p><p>The business plan course comes with an unconditional, Udemy-backed, 30-day money-back guarantee. This is not just a guarantee. It's my personal promise to you that I will go out of my way to help you succeed just like I've&nbsp;done for thousands of my other students.&nbsp; </p><p><strong>Invest in your future! Enroll in this business plan course now and create a winning foundation for achieving your dreams.</strong></p>","suitableLearners":["Aspiring entrepreneurs who are writing a business plan - be your own boss, start a business, and reach great potential"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-04-01T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-04-04T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fe09c9b04f3f624d6a5"],"topics":[],"reviews":[],"meta":{"ratingCount":1892,"studentCount":6154,"avgRatingScore":4.33842,"contentVideoLength":4699},"basicInfo":{"udemyCourseId":1434698,"slug":"2022-negotiating-learn-negotiation-skills-in-70-minutes","title":"[2022] Negotiating: Learn Negotiation Skills in 70 Minutes!","subtitle":"Used by PayPal, Oracle, Adidas & other successful firms. Boost your skills in B2B sales, contract negotiation, and more.","image":"https://img-c.udemycdn.com/course/240x135/1434698_3096.jpg","price":1949670,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["Create value for all parties though integrative bargaining","Claim value while collaborating with your counterparties","Use pro-social framing to elevate negotiation discussions","Close deals through deal creativity and subjective value","Earn your negotiating certificate in less than 90 minutes"],"requirements":["There are no prerequisites to participating in this course!"],"description":"<p><strong><em>Version 3.2 Fresh as of January 2022!</em></strong></p><p>5/5 Stars:&nbsp;<em>\"I was very impressed with the material in this course. The information was communicated clearly with good examples and the presentation was well organized.\"</em> - Ashley Dixon</p><p>5/5/&nbsp;Stars:&nbsp;<em>\"Really enjoyed the course. It was broken down into bite-sized chunks that contained exactly the information that I needed.\"</em> - Paul Walsh</p><p><strong>Upgrade Your&nbsp;Negotiation&nbsp;Skills Fast and Earn a Career-Boosting&nbsp;Certificate!</strong></p><ul><li><p>Successful negotiation through collaboration</p></li><li><p>Generate or limit alternatives as a strategic approach</p></li><li><p>Persuasion, influence, and&nbsp;reciprocal negotiation</p></li><li><p>Using negotiation psychology and&nbsp;subjective value</p></li><li><p>Leadership in negotiations the preparation and managing alternatives</p></li></ul><p><strong>Perfect for Recruiters, Salespeople, Account Managers, Brokers, and Entrepreneurs</strong></p><p>Some audiences that will likely find immediate applications for their new integrative bargaining skills are:</p><ul><li><p>Recruiters and HR professionals involved in compensation package negotiations</p></li><li><p>Salespeople and account managers looking to close deals while preserving long-term relationships</p></li><li><p>Brokers involved in negotiating the sale or purchase of high-dollar assets (e.g. businesses or property)</p></li><li><p>Entrepreneurs or freelancers looking to get fair value for their work while building strong relationships with clients</p></li></ul><p>If you’re interested in learning how to be a leader at the negotiation table then this course is for you. &nbsp;Eazl’s Negotiation Certificate Course introduces you to integrative negotiation, the BATNA, and other upgrades to your negotiation skillset. In this course, you’ll learn how to prepare for high-stakes negotiations, how to create value while claiming value, how to close more deals and more. Because you’re learning with Eazl, you’ll learn how to do it in a way that’s both informative and engaging.</p><p>In this course, you will:</p><ul><li><p>Create value for all parties though integrative bargaining</p></li><li><p>Claim value while collaborating with your counterparties</p></li><li><p>Use pro-social framing to elevate negotiation discussions</p></li><li><p>Close deals through deal creativity and subjective value</p></li><li><p>Earn your negotiating certificate in less than 90 minutes</p></li></ul><p>This course is also chock full of activities that allow you to practice what you’re learning. You’ll work with your instructor over 3 exercises prepare a negotiation strategy, label concessions, and analyze major cases when negotiations both failed and succeeded. </p><p><strong>Why Further Develop Your Negotiation Skills?</strong></p><p>Learning how to lead negotiations can benefit you professionally as you gain the ability to collaboratively make deals and structure relationships between people and organizations. Leading as a negotiator can be challenging and complex. To navigate this maze, you need &nbsp;a resource that brings research from Harvard, MIT, and other top institutions with practical applications presented in an engaging format. </p><p>Your course leverages Davis Jones’ experience as a headhunter in the San Francisco Bay Area, the research of Eazl’s subject-matter expert community, and Eazl’s award-winning approach to creating online learning experiences. Davis Jones has taught managers in more than 180 countries and more than 100,000 students worldwide. </p><p>By the end of the course, you will be able to prepare for and lead in negotiations and you’ll earn a verifiable certificate issued by the Eazl team. Join us on this adventure today! We’ll see you inside the course.</p><p>---------------------------</p><p>Content&nbsp;Upgrade Journal</p><p>• Version 3.2 (January 2022)<br>In this upgrade, our team has generated professional-grade English language captions for the course. This will be a great addition for ESL&nbsp;learners!</p><p>• Version 3.1&nbsp;(November 2021):&nbsp;In this update, we've added a new series of lectures that you'll find throughout your learning experience.&nbsp;They're called \"Voices from the Field\", and they are a way for you to see how different professionals who deal with negotiations in different business sectors answer the same questions about negotiation back-to-back-to-back. We hope you enjoy the upgrade!</p><p>• Version 3&nbsp;(November 2020):&nbsp;In this update, many of your lectures have been re-recorded and/or re-animated. Specifically, any lecture that introduces a concept (e.g. \"Integrative Negotiation\"&nbsp;or \"Reciprocity\") has now been modified so that, as you learn the new concept, there is a complimentary visual on screen. This approach is in line with the most cutting-edge learning science. By taking this approach, you should be able to learn faster, and retain a higher percentage of the information presented on-screen. Also, you now have an interactive Assignment in the course. In it, you will see a real-world case presented, and then be asked to take an action as if you were involved in the mentioned negotiations. Enjoy version 3!</p><p>• Version 2 (November 2019):&nbsp;In this update, we've done a massive update to the study guide and included links to all of the scholarship that powers the course curriculum. We've also added those links as external references to your lectures on the platform, and added full English-language captions to the lectures. Enjoy the update!</p><p><br></p>","suitableLearners":["Recruiters and HR professionals involved in compensation package negotiations","Salespeople and account managers looking to close deals while preserving long-term relationships","Brokers involved in negotiating the sale or purchase of high-dollar assets (e.g. businesses or property)","Entrepreneurs or freelancers looking to get fair value for their work while building strong relationships with clients"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-10-27T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-10-30T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fe09c9b04f3f624d6a5"],"topics":[],"reviews":[],"meta":{"ratingCount":1840,"studentCount":7155,"avgRatingScore":4.4242253,"contentVideoLength":5247},"basicInfo":{"udemyCourseId":1684752,"slug":"business-strategy-development-the-art-of-differentiation","title":"Business Strategy Development: The Art of Differentiation","subtitle":"Learn 3 key business strategy tools. Improve your business innovation skills and drive profitable business development.","image":"https://img-c.udemycdn.com/course/240x135/1684752_f71a_16.jpg","price":2179070,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["Find ways to stand out from your competitors by differentiating better than them","Play to your strengths and confidently identify the areas that will grow your business","Practice 3 strategic tools to strengthen your business strategy","Avoid common mistakes & learn how top companies have successfully differentiated themselves","Increase your value - shape a strategy to attract customers that truly value you","Business Analysis: Fix potential disablers that could be hurting your business development"],"requirements":["An interest in business development and strategy","For entrepreneurs, business analysts, consultants and marketers who want to grow successful business development"],"description":"<p><strong>Are you interested in learning why some business strategies are better than others?</strong></p><p>From Apple to Netflix, leading businesses and start-ups have all made their mark with a strategy that sets them apart</p><p>This course is all about learning how leading companies create successful strategies for growth - and then learning the tools and techniques to develop your own brilliant and profitable business strategies</p><p>Developing a strategy that can grow a business is an essential skill for any budding entrepreneur - whether as CEO, marketing professional, manager or consultant </p><p><strong>Easy-to-Follow Guide</strong></p><p>This is your guide to learning business strategy in just a few minutes - with eye-opening yet pragmatic tools that can be put to work on Monday morning</p><p>With this course you'll get a clear understanding of what makes a winning business strategy, and learn the methods to help you attract devoted customers, but also, do so without having to compete on price all the time</p><p><strong>Master The Art of Differentiation</strong></p><p>This course teaches you the tools, tips and techniques to help you identify and increase your differentiation<strong> </strong>so you can successfully stand out and grow your company</p><p>It's a valuable skill to learn and in this course you'll soon have it mastered. </p><p><strong>Strategic Mentor</strong></p><p>Tony Prouse is an enthusiastic and well-respected strategic mentor with over 30 years of hard-earned wisdom. Tony has worked closely with leading institutions such as the <strong>Institute for Manufacturing at Cambridge University</strong> and helped develop successful strategies for a wide range of organisations and startups all around the world. </p><p><strong>Learn Quickly</strong></p><p>This is a fun and practical course with plenty of examples which will show you&nbsp;the techniques to&nbsp;take any team, business model, idea, product or service to the next level.</p><p><strong>Ready?</strong> <strong>So, Where Do We Begin?</strong> &nbsp; </p><p>It starts by identifying what your current competences are - and which ones will enable you to capture greater business. But it’s not just a case of knowing your strengths and weaknesses – Tony will show you how&nbsp;some competences are more important than others!</p><p><strong>Create Value for Your Customers and Business</strong></p><p>It’s also about understanding how we can create value for our customers -&nbsp;and who those customers should be.&nbsp; &nbsp; </p><p>And it's&nbsp;the reason industry leaders have achieved excellent business development.&nbsp; &nbsp; </p><p>In addition, Tony will&nbsp;explain&nbsp;the common mistakes, having worked with many businesses&nbsp;around the world for over 30 years - so you can learn from these too.</p><p><br></p><p><strong>Enrol&nbsp;now to learn how to:</strong></p><ul><li><p><strong>Define a successful business strategy</strong></p></li><li><p><strong>Assess how well a business is currently differentiating itself&nbsp;</strong></p></li><li><p><strong>Identify areas where you can improve your differentiation and innovation</strong></p></li><li><p><strong>Increase your value and move away from competing purely on price or basic feature</strong>&nbsp; &nbsp;</p></li><li><p><strong>Attract the right customers with a winning business strategy</strong></p></li><li><p><strong>Identify your core competences - which are often&nbsp;very&nbsp;different to what you currently believe!</strong>&nbsp; &nbsp;</p></li><li><p><strong>Avoid the&nbsp;common pitfalls of&nbsp;differentiation, business strategy and business development</strong></p></li><li><p><strong>Grow a business in a long-lasting and fun&nbsp;way</strong>&nbsp; &nbsp;</p></li><li><p><strong>Identify potential disablers to your differentiation - and know which ones could be hurting you</strong></p></li><li><p><strong>Create value for your target&nbsp;customers for a brighter&nbsp;future</strong>&nbsp; </p><p><strong><br></strong></p></li></ul><p><strong>This course also includes:</strong>\n\n&nbsp; </p><ul><li><p><strong>3 Downloadable&nbsp;Tools for Business Strategy </strong>to help you assess and build&nbsp;your differentiation and business strategy</p></li><li><p><strong>Activities + Quizzes</strong>&nbsp;to put your knowledge into action immediately\n\n&nbsp; </p></li></ul><p>Gain&nbsp;the skills and tools to ultimately&nbsp;improve your differentiation and develop your own successful business strategy -&nbsp;and most importantly, know&nbsp;where to start.&nbsp; &nbsp; </p><p>This course is an exciting journey of business strategy&nbsp;discovery for those with the desire to grow.</p><p>Let’s get started!\n\n</p>","suitableLearners":["If you are an entrepreneur, business analyst, manager, marketer, salesperson, consultant, student","If you want to attract customers who truly value you","If you want to build successful business strategies for long-term growth"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2020-01-24T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2020-01-27T00:00:00.000Z"},"promotions":{"discountPrice":367040,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fe09c9b04f3f624d6a5"],"topics":[],"reviews":[],"meta":{"ratingCount":1701,"studentCount":4128,"avgRatingScore":4.522392,"contentVideoLength":3283},"basicInfo":{"udemyCourseId":2830804,"slug":"creating-team-vision-mission-values","title":"Creating Team Vision, Mission & Values","subtitle":"Build a high-performing team with  clear, compelling, and concise Vision, Mission, and Values statements","image":"https://img-b.udemycdn.com/course/240x135/2830804_24be_2.jpg","price":3440770,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["Discover the Differences Between Vision & Mission Statements and Why They're Both Important","Discover What Values Are & Why They're Important","Explore How Having Vision, Mission, and Values at the Team Level Can Be Valuable","Ensure Alignment Between Your Team and the Larger Organization's Vision, Mission, and Values Statements","Learn How To Engage Your Team In The Process of Creating Vision, Mission, and Values Statements","Develop a Plan For Creating Vision, Mission, and Values Statements with Your Team","Explore How To Put Your Vision, Mission, and Values Into Action","Assess Your Leadership Approach and Identify Ways to Be The Change You Want to See in Your Organization"],"requirements":["Be leading or managing a team of people."],"description":"<p>Are you looking for ways to engage and inspire your team? Research shows that employees are more engaged when the mission and purpose of their company makes their job feel important.&nbsp; In larger organizations the link between the company mission and an individual contributor's work can be tenuous. But team leaders can strengthen that link by creating team-level vision, mission, and values statements that align with the larger organization's vision, mission, and values.&nbsp; </p><p>This course is designed to prepare and empower you to do just that. </p><p>Having a vision is important because it paints an inspirational picture of the future that your team can work toward,&nbsp; providing clarity and purpose for all. Having a mission is important because it supports the vision and communicates what your team will do, for whom, to bring about the vision. The mission is particularly useful when communicating beyond your team to internal and external customers, partners, vendors, and other stakeholders. Finally, values are important because they shape the overall culture of an organization, and guide the day-to-day interactions of team members. </p><p>In this course, you will...</p><ul><li><p>Connect with your intention for creating team-level vision, mission, and values statements</p></li><li><p>Identify metrics you'd like to move as a result of having done this work</p></li><li><p>Discover the differences between vision &amp; mission statements and why they're both important</p></li><li><p>Discover what values are &amp; why they're important</p></li><li><p>Reconnect with the vision, mission, and values for your company so you can be re-inspired and ensure alignment when you do the work with your team</p></li><li><p>Learn how to engage your team in the process of creating vision, mission, and values statements in a collaborative, inclusive way</p></li><li><p>Develop a plan to create vision, mission, and values statements with your team</p></li><li><p>Explore how to put your team vision, mission, and values into action through communication, aligning work, prioritizing work, and resolving conflicts</p></li><li><p>Assess your leadership approach and identify ways to model the behaviors you want to see in your organization</p></li></ul><p>I’ve been working with leaders and teams for more than two decades as a leadership coach, consultant, facilitator, and human resources professional. The vision I hold for my work is a world where everyone is thriving in their purpose, realizing their boldest visions, and contributing to the greater good.&nbsp; Join me and learn how to create Vision, Mission, and Values statements with your team today.</p>","suitableLearners":["Leaders whose teams have been in transition and are now ready to forge a clear path forward.","Leaders who are ready to take their teams - and their leadership - to the next level.","Leaders who are creating a new functional area for their company.","Leaders who are ready to clarify the value their team brings to the organization.","Entrepreneurs who are ready to get clear about what they're offering to the world.","Leaders whose teams have been experiencing conflict.","Human Resources and Learning & Development professionals who are partnering with leaders to support their organization's development"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2020-03-04T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2020-03-07T00:00:00.000Z"},"promotions":{"enabled":false}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fe09c9b04f3f624d6a5"],"topics":[],"reviews":[],"meta":{"ratingCount":1620,"studentCount":8574,"avgRatingScore":4.4842873,"contentVideoLength":25220},"basicInfo":{"udemyCourseId":2413388,"slug":"management-consulting-approach-to-problem-solving","title":"Management Consulting Approach to Problem Solving","subtitle":"A practical guide with case studies & real-life examples how to make better decisions using McKinsey, BCG, Bain tricks","image":"https://img-c.udemycdn.com/course/240x135/2413388_5c27_7.jpg","price":1949670,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["Make better decisions on the basis of data","Analyze fast problems in your private life and business","Master management consulting tools, techniques and frameworks","Apply the right elements from your management consulting toolbox","Find fast potential improvements your life and achieve your goals","Calculate in Excel the impact of your decision on your life"],"requirements":["Basic or intermediate Excel"],"description":"<p><strong>What is the aim of this course?</strong></p><p>Time and again you will come across problems that are seemingly unsolvable. In many cases, you don’t even know how to approach them. Luckily, there are a lot of nice management consulting tools, techniques, and frameworks that will help you solve everyday problems. You don’t have to go to a top consulting firm to master them. You can master them by taking my course.</p><p>This course will help you drastically improve your skills in solving problems using management consulting tools, techniques, and frameworks. In this course, we will mainly concentrate on solving real-life problems like goal settings and defining what and when to do, estimating the cost of a wedding, losing weight and getting in shape, deciding whether to do an MBA or not, choosing the right boyfriend/girlfriend, deciding whether you should buy a car or not, deciding when to retire and many more. If you have a specific problem just let me know and I will give you tips on how to solve it using the tools presented in this course.</p><p>The course is designed for people who want to become more data-driven and less emotional in the way they solve problems and make decisions. Thanks to the course you will be making better decisions and solving problems that have seemed so far unsolvable. In the course you will learn 3 things:</p><ol><li><p><strong>What</strong> <strong>consulting techniques, tools, and frameworks there are</strong></p></li><li><p><strong>When to apply</strong> each and one of them</p></li><li><p>How to <strong>use them in practice </strong>including examples of how to calculate specific things in Excel</p></li></ol><p>This course is based on my 15 years of experience as a consultant in top consulting firms and as a Board Member responsible for strategy, performance improvement, and turn-arounds in the biggest firms from Retail, FMCG, SMG, B2B, and services sectors that I worked for. I have carried or supervised over 90 different performance improvement projects in different industries that generated in total 2 billion of additional EBITDA. On the basis of what you will find in this course, I have trained in person over 100 consultants, business analysts, and managers who now are Partners in PE and VC funds, Investment Directors and Business Analysts in PE and VC, Operational Directors, COO, CRO, CEO, Directors in Consulting Companies, Board Members, etc. On top of that my courses on <strong>Udemy</strong> were already taken by more than <strong>110 000 students</strong> including people working in EY, Walmart, Booz Allen Hamilton, Adidas, Naspers, Alvarez &amp; Marsal, PwC, Dell, Walgreens, Orange, and many others.</p><p>I teach through case studies, so you will have a lot of lectures showing examples of analyses, tools that we use. To every lecture, you will find attached (in additional resources) the Excels as well as additional presentations, materials shown in the lectures so as a part of this course you will also get a library of ready-made analyses that can, with certain modification, be applied by you or your team in your work.</p><p><strong>Why did I decide to create this course?</strong></p><p>Management consulting has been very creative and has produced or popularized the application of many tools, techniques, and frameworks that can be used to improve not only a business but also your private life. By putting those tools and techniques in one course and explaining them using real-life examples related to everyday life, I wanted to make this knowledge available to everybody that wants to make better decisions, especially students that are considering joining Management Consulting firms as well as managers that simply need to expand their toolbox with few useful tools.</p><p>Things you will find in this course will improve your awareness and skills in analyzing problems that you will be facing in private life as well as in business. Thanks to this course, you will know what tools, techniques, or frameworks to use and how to use them in practice.</p><p>To sum it up, I believe that if you want to make better decisions, solve faster problems in your private life you should master the techniques presented in this course. That is why I highly recommend this course not only to consultants or business analysts that have to advise their customers but also to everybody that wants to make better decisions in his or her life.</p><p><strong>In what way will you benefit from this course?</strong></p><p>The course is a practical, step-by-step guide loaded with tones of analyses, tricks, hints that will significantly improve the speed and efficiency with which you solve problems and make decisions. There is little theory – mainly examples, a lot of tips from my own experience as well as other notable examples worth mentioning. Our intention is that thanks to the course you will learn:</p><ol><li><p><strong>What</strong> management consulting tools, techniques, and frameworks <strong>are available</strong></p></li><li><p>How to <strong>use them in practice to solve problems and make better decisions</strong></p></li><li><p><strong>How to make decisions and solve problems </strong>using available information/data</p></li></ol><p>You can also ask me any question either through the discussion field or by messaging me directly in Udemy.</p><p><strong>How the course is organized?</strong></p><p>The course is divided into the find the following sections:</p><ul><li><p><strong>Introduction. </strong>We begin with a little intro into to the course</p></li><li><p><strong>Basic tools, techniques, and frameworks used by management consultants. </strong>In the second section, I will discuss the main tools that you can use to analyze and solve problems in real life. We will talk about things like issue tree, bottom-up approach, top-down approach, backward reasoning, 80/20 rule, benchmarking, cost drivers, opportunity tree, and many, many more</p></li><li><p><strong>Intermediate tools, techniques, and frameworks used by management consultants. </strong>In this section, I will discuss more advanced techniques such as rankings, scenario analysis, representative element analysis, decision tree, OEE, OLE, the Theory of Constraints, Critical Chain, and many, many more</p></li><li><p><strong>Advanced tools, techniques, and frameworks used by management consultants. </strong>In this section, I will discuss further more advanced techniques such as simulation analysis, decomposition analysis, feasibility analysis, and sensitivity analysis</p><p><br></p></li></ul><p><strong>You will be able also to download many additional resources</strong></p><ul><li><p>Excels with analyses shown in the course</p></li><li><p>Presentation of slides shown in the course</p></li><li><p>Links to additional presentations and movies</p></li><li><p>Links to books worth reading</p></li></ul><p><strong>At the end of my course, students will be able to…</strong></p><ul><li><p>Make better decisions</p></li><li><p>Analyze fast problems in your private life and business</p></li><li><p>Master management consulting tools, techniques, and frameworks</p></li><li><p>Apply the right elements from your management consulting toolbox</p></li><li><p>Find fast potential improvements in your life and achieve your goals</p></li><li><p>Prepare you to move on to intermediate level management consulting training</p></li><li><p>Calculate in Excel the impact of your decision on your life</p></li></ul><p><strong>Who should take this course? Who should not?</strong></p><ul><li><p>People interested in making better decisions based on data</p></li><li><p>Students that are considering becoming management consultants</p></li><li><p>Management Consultants</p></li><li><p>Business Analysts</p></li><li><p>Small and medium business owners</p></li><li><p>Startups founders</p></li><li><p>Managers</p></li></ul>","suitableLearners":["Students interested in making better decisions based on data","Students that are considering becoming management consultants","Management Consultants","Business Analysts","Small and medium business owners","Startups founders","Managers"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-03-25T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-03-28T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fe09c9b04f3f624d6a5"],"topics":[],"reviews":[],"meta":{"ratingCount":1547,"studentCount":3380,"avgRatingScore":4.1990213,"contentVideoLength":23205},"basicInfo":{"udemyCourseId":3249386,"slug":"learn-online-workshop-facilitation-tips-for-ms-teams","title":"Learn Online Workshop Facilitation & Tips For MS Teams","subtitle":"Prepare, facilitate, present & follow up to drive alignment through engaging online workshops using Microsoft Teams","image":"https://img-b.udemycdn.com/course/240x135/3249386_1a94_4.jpg","price":1949670,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["How to prepare, run and follow up workshops when everyone is working from home","Increase online workshop engagement by running a poll to get people voting on topics","How to present using PowerPoint and Teams in online workshops and meetings","Tips and tricks of running meetings using video conferencing software such as Microsoft Teams","How to earn valuable credibility by running effective meetings and respecting people’s time","How to create alignment in your teams and drive productivity in your organisation","How to prepare for your online workshop with a clear action plan and well defined agenda","Running an online workshop by professionally balancing everyone's input to achieve y our objectives","Following up beyond your workshop to ensure everyone gets maximum value from new alignment","How to use Google countdown timer to display the time left of a break so that everyone resumes at the same time"],"requirements":["This course is geared towards Microsoft Teams as your main online meeting software but many of the principles and practices apply to other tools like Zoom"],"description":"<p><em>\"</em><strong><em>It was insightful, exactly what I needed</em></strong><em>. Some leaders would just talk about strategy and not tactics. You have covered it all, I will implement as many as I can from these three sections, and I am certain my next virtual meetings/training will be different. Thank you!\" - Rebecca P.</em></p><p><em>\"</em><strong><em>I got a lot of great tips and tricks</em></strong><em>, not only on how to run efficient workshops, but also on how to perform it in a smarter way. Thank you ;-)\" - Hanne L.</em></p><p><em>\"Love it, </em><strong><em>the way he explains in details makes me eager to be a better training facilitator in future</em></strong><em>, thanks!\" - Sazali S.</em></p><p><em>\"The information is </em><strong><em>well organized and well presented. Great tips and the instructor kept me engaged.</em></strong><em>\" - Jacqueline C.</em></p><p><em>\"</em><strong><em>Definitely a good match for me</em></strong><em> I am keen to learning about how to deal with this new normal being online and t</em><strong><em>he tips and advice are valuable.</em></strong><em>\" - Nurunisa J.</em></p><p><em>\"Having had to attend numerous online meetings, webinars, and congresses this year due to the COVID-19 pandemic, I quickly realized that it is easy to lose personal interaction in the online environment. </em><strong><em>This short course has equipped me with practical tips on how to facilitate meetings and workshops in an online environment, but more so it has provided me with key skills to maintain continuous interaction between presenters and attendees, which is vital to the successful outcome of such a virtual gathering</em></strong><em>.\" - Jaco Theron</em></p><p><strong><em>\"This is a good course useful for facilitating meetings and online workshop.\"</em></strong><em> - Deborah Solomon</em></p><p><em>\"Thank you Peter, for the </em><strong><em>precise, well informing and educative course very relevant after this pandemic</em></strong><em>.\" - Tapiwa</em></p><p><em>\"</em><strong><em>I achieved the goal set for the training</em></strong><em>, and I am glad I attended. Thank you\" - Eluwumi</em></p><p><em>\"This was a very interesting course. </em><strong><em>It gave me some great tips that I hadn't thought about.</em></strong><em>\" - Marisa Wilkes</em></p><p><em>\"What I found most valuable about this course was the </em><strong><em>integration of facilitation skills for use on online platforms</em></strong><em>.\" - Lorna</em></p><p>This course will teach you how to run an online workshop that will keep people engaged and achieve your objectives. Effective meeting discipline will ensure that you use people’s time wisely as you meet together virtually to share ideas and collaborate effectively. <strong>This course is geared towards Microsoft Teams as your main online meeting software but many of the principles and practices apply to other tools like Zoom.</strong></p><p>Why you should do this course:</p><ul><li><p>Learn how to prepare for a workshop by setting up a proper agenda that has context and objectives</p></li><li><p>Use a second device to access the meeting from which you can view your presentation, while interacting on your main PC / laptop</p></li><li><p><strong>Set up a poll in MS&nbsp;Teams to get input from attendees on up to 6 different options without interrupting the flow of the meeting</strong></p></li><li><p><strong>Use Google countdown timer to display the time remaining for a workshop break so that everyone resumes at the same time</strong></p></li><li><p>Agenda timings should match the content and discussion; learn to plan this effectively</p></li><li><p>A meaningful title for your workshop will set the right tone and ensure people understand what they will be getting from attending</p></li><li><p><strong>Professional table of slots and outcomes for each item will help keep your workshop on track when you facilitate</strong></p></li><li><p>The right length for a workshop and the importance of including a break so everyone can get refreshed</p></li><li><p><strong>Content preparation; slides, AV and other pre-reads that help drive the workshop objectives</strong></p></li><li><p>The importance of sending out the pre-reads and relevant content at least 48 working hours prior to the meeting</p></li><li><p>Mental and physical preparation that ensures you are ready to run an effective online workshop which is totally different from in-person</p></li><li><p><strong>Working From Home distractions and how you will need to step up even more to ensure everyone stays engaged</strong></p></li><li><p>The importance of kicking off on time and how this sets a professional tone for the session</p></li><li><p>How to balance and engage different participants and ensure sufficient input from diverse teams and different departments</p></li><li><p><strong>Leave sufficient time to wrap up at the end of the session by reviewing carefully noted and agreed actions that will drive momentum</strong></p></li><li><p><strong>Ensure SMART&nbsp;objectives will be followed up after the workshop to maintain momentum</strong></p></li><li><p>Get feedback from people about your facilitation skills and get input on how you can improve for next time</p></li><li><p>Use the handy worksheet as a checklist for running your next online workshop</p></li><li><p><strong>Earn valuable credibility by running effective meetings and respecting people’s time</strong></p></li><li><p><strong>Create alignment and productivity in your teams</strong></p></li></ul><p>I look forward to hearing about how you have transformed your online workshop facilitation skills!</p>","suitableLearners":["Workshop facilitators running meetings from home","Anyone trying to create alignment in teams","People who want to learn how to present in a virtual meeting"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-12-28T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-12-31T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fe09c9b04f3f624d6a5"],"topics":[],"reviews":[],"meta":{"ratingCount":1497,"studentCount":7260,"avgRatingScore":4.52857,"contentVideoLength":12197},"basicInfo":{"udemyCourseId":17782,"slug":"master-your-mindset-brain-framestorm-your-way-to-success","title":"Master Your Mindset & Brain: Framestorm Your Way to Success","subtitle":"Excel in any situation. Tweak your mindset in brain-smart ways. Master class in reframing based on neuroscience. ","image":"https://img-c.udemycdn.com/course/240x135/17782_50e2_14.jpg","price":1949670,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["By the end of this course you will know the three-step Framestorm method, understand the key neuroscientific principles behind it and be able to apply it powerfully in your daily life"],"requirements":["The Neuroscience of Reframing - And How To Do It"],"description":"<p style=\"\">  \tDo you also find yourself in an ever-changing business environment? In the midst of complex decision-making processes? And with expectations of constant peak performance? If so, this course is for you!  </p>  <p style=\"\">  \tThe course helps individuals and teams grow their mental flexibility and self-regulation so that they can succeed in business. When you take this course, you:  </p>  <p style=\"\">  \t- learn a unique three-step reframing method, Framestorm  </p>  <p style=\"\">  \t- understand the key neuroscientific principles behind Framestorm and how to apply them  </p>  <p style=\"\">  \t- get inspired via a lot of powerful cases  </p>  <p style=\"\">  \tFramestorm is a registered, brain-based and elegant multiple reframing method. It helps you to cope with - and transform - mental hindrances. And it helps you move from resisting and feeling stuck, angry, sad or fearful to feeling optimally resourceful and at choice.  </p>  <p style=\"\">  \tIf facilitating change, staying cool under pressure, collaborating with others and/or decision making and problem solving is your business - or if you want to boost your innovation and communication skills - this course is definitely for you.  </p>  <p style=\"\">  \tIn a typical \"Anette Prehn fashion\", this course makes complicated things seem easy to grasp and wonderfully fun to apply. If you liked \"The Neuroscience of Reframing - And How to Do It\", you are going to love this master class. For more about Anette Prehn's down-to-earth training style and the gain of the participants, feel free to check out the testimonials of \"The Neuroscience of Reframing - And How to Do It\" or visit www.anetteprehn.com/testimonials  </p>","suitableLearners":["Business Professionels "],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2014-01-14T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2014-01-17T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fe09c9b04f3f624d6a5"],"topics":[],"reviews":[],"meta":{"ratingCount":1163,"studentCount":4128,"avgRatingScore":4.352145,"contentVideoLength":6320},"basicInfo":{"udemyCourseId":1520372,"slug":"business-intelligence-with-microstrategy-10-analytics","title":"Business Intelligence with Microstrategy 10 Analytics","subtitle":"Learn about Microstrategy 10. A step-by-step course for beginners with exercises and certificate of completion.","image":"https://img-c.udemycdn.com/course/240x135/1520372_b667_6.jpg","price":1032070,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["Understand the components and main functionality of Microstrategy and Microstrategy 10.","Load data from different sources (ODBC, Web files, Salesforce etc.) to your Microstrategy application.","Manage data within your Microstrategy Application","Build applications within Microstrategy 10 Desktop","Build visualizations within your Microstrategy application.","Data Storytelling and sharing insights."],"requirements":["Basic knowledge of Business Intelligence and Visualization.","Some experience with Visualization tools would be helpful, but not required."],"description":"<p>Learn the essentials of Microstrategy 10&nbsp;through this<strong>&nbsp;step-by-step tutorial</strong>. This course takes you through the basics of Microstrategy&nbsp;, how to integrate your application with different data sources, manage data, build visualizations and sheets and share your insights with visual&nbsp;Data Stories!</p><p><em>..Learn to build dashboards with&nbsp;Microstrategy 10&nbsp;from scratch!</em></p><p><em>..Learn some of the most common mistakes made when building building sheets and visualizations..</em></p><p><em>..Forget about reports and presentations, learn more about Data Storytelling</em></p><p>The course contains&nbsp;<strong>training materials</strong>,&nbsp;where you can practice,&nbsp;apply your knowledge and build an app&nbsp;from scratch. The training materials&nbsp;are provided in an Excel file that you can download to your computer. Each module also ends with a short quiz and there is a final quiz at the end of the course.</p><p>After completion of this course, you will receive a&nbsp;<strong>certificate&nbsp;of completion</strong>.</p><p>Good luck and hope you enjoy the course.</p><p><strong>Pre-requisites:</strong></p><ul><li><p>Basic knowledge of Business Intelligence and Visualization.</p></li><li><p>Some experience with Visualization tools would be helpful, but not required.</p></li></ul><p><strong>Course content:</strong></p><p>The course consists of the following modules:</p><ul><li><p>Introduction, Installation and Setup</p></li><li><p>Data Loading - Basic Concepts</p></li><li><p>Data Loading - Exercises</p></li><li><p>Build Dashboards- Visualizations</p></li><li><p>Build Dashboards - Exercises</p></li><li><p>Data Storytelling and Sharing Insights&nbsp;- Presenting Insights</p></li><li><p>Data Storytelling and Sharing Insights&nbsp;- Exercises</p></li><li><p>Final Quiz</p></li></ul><p><strong>Who should follow this course?</strong></p><ul><li><p>Students that want to learn the basics of Microstrategy 10</p></li><li><p>Business Analysts and Designers&nbsp;who are already familiar with other visualization tools and want to learn Microstrategy.</p></li><li><p>Managers considering using Microstrategy within their organization.</p></li></ul><p><br></p><p><br></p>","suitableLearners":["Students that want to learn the basics of Microstrategy","Business Analysts and Designers who are already familiar with other visualization tools and want to learn Microstrategy.","Managers considering using Microstrategy within their organization.","Anyone who has used Microstrategy before and considers using Microstrategy."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2018-05-11T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2018-05-14T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fe09c9b04f3f624d6a5"],"topics":[],"reviews":[],"meta":{"ratingCount":1146,"studentCount":3941,"avgRatingScore":4.533982,"contentVideoLength":7598},"basicInfo":{"udemyCourseId":3380208,"slug":"smart-tips-innovation","title":"Smart Tips: Innovation","subtitle":"Become a strong leader and innovator: get recognized for the innovation, influence, and value you bring.","image":"https://img-b.udemycdn.com/course/240x135/3380208_fa8c_4.jpg","price":1834970,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["Master the mindset for becoming a confident innovator","Overcome the internal and external resistors sabotaging your efforts to innovate","Learn how to stop working hard, and start working smart and at peak performance","Get access to the innovation tools you need to solve sticky challenges and unearth new opportunities","Discover how to be a strong leader of innovation in your colleagues and teams","Be recognized for the innovation, influence, and value you bring to work daily"],"requirements":["Students will get the most out of this course if they have a growth mindset and willingness to put learning into action."],"description":"<p>If you are an individual contributor looking to make an impact, an emerging leader looking to get recognized for your ideas or a leader of a team, big or small, seeking to build a culture of innovation, you will need to develop the mindset, skills, and tools to become a confident innovator.&nbsp; </p><p>Welcome to <strong>Smart Tips: Innovation</strong>! In this course I’ll provide <strong>short lectures to help you do something new - fast</strong>, so that you can immediately apply it to your work or life. The videos in this course are <strong>standalone</strong>. That means you don’t have to watch in any particular order. If you’re searching for a specific skill or topic that’s relevant for you, take a look through the available tips to find the knowledge you need when you need it.</p><p>In this series of engaging videos you'll discover key insights to help you tap the power of innovation to ignite ideas, influence others, and be valued for your contributions. The tips in this series are specifically designed to make innovation tangible, actionable, and personal so that you can apply what you learn and get results fast. </p><p>In the lightning-fast, power-packed video series you'll learn things like:</p><ul><li><p>Clearing Up The Confusion Between Creativity And Innovation</p></li><li><p>Avoiding The Four Traps Of Certainty That Are Sabotaging Your Efforts</p></li><li><p>The Science Behind How You Innovate</p></li><li><p>Eliminating The Lack Of Results That Happens When You Think Outside The Box</p></li><li><p>3 Simple Tools For Overcoming Your Lizard Brain</p></li><li><p>Managing Your Energy To Drive Innovation</p></li><li><p>3 Tactics To Help You Embrace Instead Of Fear Failure</p></li><li><p>2 Steps For Creating A&nbsp;Wealth Of Innovation</p></li><li><p>How To Set Expectations So Your Ideas Don't Get Killed To Early</p></li><li><p>3 Tips For Improving Your&nbsp;Brainstorms</p></li><li><p>How To Innovate When Your Business Has Hit The Decline</p></li><li><p>4 Simple Techniques To Get Legacy Thinkers On Board With Change</p></li><li><p>How to Avoid Getting Stuck In&nbsp;Perfection&nbsp;Paralysis That Shuts Down Innovation</p></li><li><p>...and so much more</p></li></ul><p>I want to take the confusion, frustration, and complication out of innovation for you. With these tips I want to help you avoid being overlooked, undervalued, or stuck. I've spent 25 plus years in the innovation space, delving into the neuroscience, understanding the behavioral psychology, and working with clients to transform them into confident innovators that solve sticky challenges and unearth new opportunities. I'm proud of the results my clients across the globe have achieved and I&nbsp;look forward to bringing that momentum and success to you as well. </p><p>If you're ready to drive innovation that leads to impactful results, join me in this course!</p>","suitableLearners":["Individual contributors looking to make a bigger impact at work","Emerging leaders seeking to have a stronger, more innovative voice at work","Leaders who need the tools to build a culture of innovation on their teams"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-04-12T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-04-15T00:00:00.000Z"},"promotions":{"enabled":false}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fe09c9b04f3f624d6a5"],"topics":[],"reviews":[],"meta":{"ratingCount":1060,"studentCount":57752,"avgRatingScore":4.5183663,"contentVideoLength":30600},"basicInfo":{"udemyCourseId":3726964,"slug":"management-consulting-essential-training","title":"Management Consulting Essential Training","subtitle":"Everything you need to know about the techniques of world’s top management consulting firms to land 6-figure job offer","image":"https://img-c.udemycdn.com/course/240x135/3726964_07e4.jpg","price":1949670,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["Gain a well-rounded consulting techniques. This program is taught by industry professionals who have real-world experience to bring to the table.","Explore the techniques and frameworks for approaching each type of consulting case to dominate your upcoming interview and land your dream consulting job","Understand from a high level perspective what a management consulting firm is as well as what the role/job is of a management consultant.","Participate in case studies to apply the consulting skills you learn in a real-world situation","Understand the real-life consulting case interview processes and principles","Identify strategies you can use to analyze businesses and industries","Learn how management consultants break a business problem into its core components","Learn effective brainstorming techniques from Bain and McKinsey","Making your business more profitable involves looking at ways to increase sales revenue as well as decreasing costs","Learn how to perform an industrial analysis and competitor analysis","Explore what to do to enter a new market","Understand the strategy to improve capacity utilization","Know the steps to executing a successful merger or acquisition","Learn things to consider before your company makes investing decisions","Understanding organizational behaviors","Learn how to approach market sizing case questions"],"requirements":["Nothing except a positive attitude!"],"description":"<p>**Updated for 2022!**</p><p><strong>Imagine you could learn the techniques taught by the world’s top consulting firms such as McKinsey and BCG without ever working at a firm! What if you could put yourself in a position to earn a six-figure salary, not to mention maximize the efficiency of any business interests you have, all from the comfort of your own home?</strong></p><p>Management consulting involves identifying and suggesting important changes to what a company does and how they do it—developing a working strategic plan and guiding its execution with optimum effectiveness. A management consultant learns everything about the product or service a company sells for profit and then finds more efficient and more profitable ways to sell that product or service.</p><p>You can see why management consulting is a growing field very much in demand in today’s marketplace.</p><p><strong>College graduates with management consulting degrees receive offers from top firms with compensation approaching or exceeding $90,000 in their first year alone. Experienced management consultants can earn well over 6 figures—and that’s not accounting for bonuses.</strong></p><p>And while these consultants are helping companies improve their bottom lines—and being compensated nicely for their efforts—certain consulting techniques can be applied to individual problems, allowing you to employ what you learn to improve your business and personal life.</p><p>Our goal in this training program is to help you improve your day to day operations, career and yourself, so I will show you techniques and toolkits that we use in management consulting industry, and ones that I frequently share with my clients and students.</p><p>You simply have to find a way to acquire practical skills that will give you an edge over the other candidates.</p><p><strong>But how can I help you do that?</strong></p><p>Management Consulting Essential Training is the most comprehensive, dynamic, and practical course you will find online. It covers several topics, which are fundamental for every aspiring management consultant:</p><p><strong>What makes this course different from the rest of the consulting courses out there?</strong></p><ul><li><p>Knowledgeable instructor (experience in companies like BCG)</p></li></ul><ul><li><p>Complete training: We will cover all major topics and skills you need to become a top-class management consultant</p></li></ul><ul><li><p>Extensive Case studies: To help you reinforce everything you’ve learned</p></li></ul><p><strong>Why should you consider a career as a management consultant?</strong></p><ul><li><p>Salary. A management consultant job usually leads to a very well-paid career</p></li></ul><ul><li><p>Promotions. Management consultant acquire valuable technical skills, which makes them the leading candidates for senior roles within a corporation</p></li></ul><ul><li><p>Secure Future. There is high demand for management consultant on the job market, and you won’t have to be concerned about finding a job</p></li></ul><ul><li><p>Growth. This isn’t a boring job. Every day, you will face different challenges that will test your existing skills</p></li></ul><p>You will make your money back from the price of this course. Udemy guarantees it with their no-risk 30 day money back guarantee. You really have nothing to lose.</p><p><strong>Thank you for signing up for this course on Udemy. The course will always be up-to-date here and nowhere else. I am also available for questions inside the course discussion board.</strong></p>","suitableLearners":["You should take this course if want to learn management consulting completely from scratch","You should take this course if you know some consulting skills but want to get better","You should take this course if you are a good strategy consultant and want to take your skills to the next level and truly leverage the full potential of consulting techniques at work","You should take this course if you're a beginner to business strategy","You should take this course if you're a student eager to learn about job opportunities in the field of management consulting","You should take this course if you're a candidate willing to boost your resume by learning how to combine the knowledge of problem solving, creative thinking and business consulting in a real-world working environment"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-02-09T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-02-12T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fe09c9b04f3f624d6a5"],"topics":[],"reviews":[],"meta":{"ratingCount":944,"studentCount":3114,"avgRatingScore":4.3263187,"contentVideoLength":6627},"basicInfo":{"udemyCourseId":2536576,"slug":"fmea-training-fmea-specialist-certification-accredited","title":"FMEA Training | FMEA Specialist Certification (Accredited)","subtitle":"What is FMEA & How it Works? FMEA Definition | FMEA Significance | FMEA Stages | PFMEA | FMEA Steps | FMEA Format | RPN","image":"https://img-c.udemycdn.com/course/240x135/2536576_7be3_10.jpg","price":1949670,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["What is a Failure Mode and Effects Analysis (FMEA)?","History of FMEA","Types of FMEA","Process FMEA (PFMEA)","Stages of FMEA","Risk Priority Number (RPN)","Steps to Construct FMEA","Benefits and Shortcomings of FMEA"],"requirements":["Have a basic understanding of your business process","Have a know-how to use Excel templates"],"description":"<p><strong>THE COMPLETE FMEA TRAINING AND FMEA SPECIALIST CERTIFICATION (ACCREDITED)</strong></p><p><em>This FMEA Specialist Certification Course is </em><strong><em>accredited by the internationally recognized Continuing Professional Development (CPD) Certification Service</em></strong><em> (Provider No:&nbsp;14627, Certificate No: A029014-15).</em></p><p><strong><em>Want to become a Failure Mode and Effects Analysis (FMEA) Specialist?</em></strong> <em>If so, you've come to the right place!</em></p><p>This Failure Mode and Effects Analysis (FMEA) Masterclass is a Specialization program that provides you a practical perspective of Reliability Management, Risk Management and Risk Measurement in your business process. Failure Mode and Effects Analysis (FMEA) is a methodical and systematic technique that helps in identifying predictable failure modes and either eliminates them or at least minimizes them. This is one of the best Failure Mode and Effects Analysis (FMEA) courses available online that not only helps you understand the concepts of Failure Mode and Effects Analysis (FMEA) but also helps you do realistic examples and activities in a step-by-step manner. The structure of this Failure Mode and Effects Analysis (FMEA) Masterclass allows you to understand how to easily apply your knowledge and skills in your work environment. Your business process becomes absolutely reliable. You are able to measure Risk in your business process. This in-turn helps you get the desired visibility in your organization resulting in career growth and a positive impact on your salary. This Failure Mode and Effects Analysis (FMEA) Specialization not only adds the Failure Mode and Effects Analysis (FMEA) qualification to your skill set but also provides you an opportunity to enhance your resume helping you stand out in this competitive world.</p><p>By choosing this Failure Mode and Effects Analysis (FMEA) Masterclass, you are enrolling the most in-depth, beginner to intermediate level FMEA Specialization programs.</p><p>What would you get after taking this Failure Mode and Effects Analysis (FMEA) Masterclass program?</p><ul><li><p>Get a Failure Mode and Effects Analysis (FMEA)&nbsp;Specialization</p></li><li><p>Master the art of streamlining products and processes that are free from any defects or failures</p></li><li><p>Focus on getting reliable products and services</p></li><li><p>Start measuring risk in your business process</p></li><li><p>Become effective at Risk Management and Risk Maintenance</p></li><li><p>Complete your own first Failure Mode and Effects Analysis </p></li><li><p>Get access to the Failure Mode and Effects Analysis template</p></li><li><p>Get access to 40+ downloadable pdf(s)</p></li></ul><p>This course is for those of you who have at least a basic know-how of your business process and its potential failure modes. You can be a beginner in using this tool: Failure Mode and Effect Analysis. If you have absolutely no understanding of your business process than this course is NOT for you. For those individuals who are looking for advanced techniques in FMEA, this course is NOT for you too.</p><p><strong>What makes this course a Bestseller?</strong></p><p>Like you, thousands of others were frustrated and fed up with fragmented online know-it-all tutorials which assumed you can understand the complex Failure Mode and Effects Analysis (FMEA) jargons and left you without having you practice what you have learnt.</p><p>Like you, they were tired of low-quality lessons, poorly explained topics and all-round confusing info presented in a wrong way. That's why so many find success in this Failure Mode and Effects Analysis (FMEA) Masterclass program. It's designed with simplicity and seamless progression in mind through its HD, comprehensive tutorials.</p><p>This course is very well structured:</p><ul><li><p>The course length is over 1.5 hours</p></li><li><p>You become an expert in constructing Failure Mode and Effects Analysis (FMEA) and facilitating those discussions</p></li><li><p>These concepts are explained in over 8 sections; Each section is dedicated to a specific FMEA concept</p></li><li><p>These concepts are taught in more than 45 lectures</p></li><li><p>Each lecture covers bite-sized information; easy to grasp and apply</p></li><li><p>Each lecture consists of a video screencast</p></li><li><p>Each section is well rounded with:</p><ul><li><p>A section objective discussed at the beginning</p></li><li><p>Then the concept discussed at length</p></li><li><p>Then examples are discussed to review concepts from a practical perspective</p></li><li><p>This is followed by either an activity or a quiz</p></li><li><p>Each section ends with an apt summary</p></li></ul></li><li><p>Each activity is supplemented with specific instructions</p></li><li><p>Each activity has a subsequent video lecture discussing the activity solution for self-review</p></li><li><p>The training presentation used in every lecture is provided as a downloadable pdf</p></li><li><p>Some students prefer to get a consolidated pack of training presentation. That is provided too in the last lecture of this course. There are over 40 downloadable files</p></li><li><p>You are also taught the do's and dont's of FMEA. So you gain TRUE&nbsp;FMEA&nbsp;specialization</p></li></ul><p><strong>****No Prior Experience Needed****</strong></p><p>This Failure Mode and Effects Analysis (FMEA) Masterclass assumes that you have no prior FMEA background. With over 1.5 hours of on-demand video, over 45 lectures, over 40 supplemental resources and several activities, these comprehensive tutorials cover everything you'll ever need to become a Failure Mode and Effects Analysis (FMEA) Specialist.</p><p>Whether you want to:</p><ul><li><p>Get an in-demand Failure Mode and Effects Analysis (FMEA)&nbsp;Specialization</p></li><li><p>Get freelancing assignments and work from home, setting your own schedule and rates</p></li><li><p>Sharpen your process improvement skills</p></li><li><p>Simply identify process failure modes with your FMEA skills</p></li></ul><p>...this complete Failure Mode and Effects Analysis (FMEA) Masterclass is exactly what you need, and more. (You'll even get a certificate of completion to add to your arsenal).</p><p>This course is backed by Udemy's 30-Day Money Back Guarantee. If you are not satisfied for any reason, you will get the money back. In addition to that you will keep all the downloadable reference documents of the course as a thank you for trying out our course!</p><p><strong>What are you waiting for? Enroll today and become a Failure Mode and Effects Analysis (FMEA) Specialist!!!</strong></p>","suitableLearners":["Service Industry and Manufacturing Operations Professionals","Individuals who are Beginners are using FMEA","This course is NOT for Individuals who want to learn advanced skills of constructing FMEA"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-04-06T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-04-09T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fe09c9b04f3f624d6a5"],"topics":[],"reviews":[],"meta":{"ratingCount":861,"studentCount":3069,"avgRatingScore":4.429151,"contentVideoLength":13765},"basicInfo":{"udemyCourseId":3198572,"slug":"digital-transformation-and-industry-40-masterclass","title":"Digital Transformation and Industry 4.0 Masterclass","subtitle":"Build real world understanding of Digital Transformation, Industry 4.0, value drivers and best practices to implement","image":"https://img-c.udemycdn.com/course/240x135/3198572_ecc0_6.jpg","price":2293770,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["Understand what do terms like Digitalization, Industry 4.0, Society 5.0 mean","Build a deep understanding of 7 core Industry 4.0 technologies (AI, IoT, Blockchain, AR/VR, RPA, Cloud, 3D Printing) and their applications in business","Learn the key business drivers of digitalization and a framework for crafting digital strategy","Practice a hands on case to implement digital transformation in a company and address the practical challenges involved","Learn best practices, tip & tricks across various industries and functions to identify, design and implement digital initiatives"],"requirements":["Access to internet"],"description":"<p>Update 2022: It is one of the highest-rated courses on Digital Transformation and Industry 4.0 at Udemy with students from ~100 countries and all 6 continents. Thanks a lot for the overwhelming response !!!</p><p>***</p><p>Digital transformation is a very popular topic these days. But what does it really mean and how can you identify the right digital technologies to create value at work and successfully implement them?</p><p>This course offers the <strong>right balance between the insights and best practices from top tier consulting firms and practical wisdom of what really works in a large corporate</strong>. The course content has already been vetted with digitalization experts across multiple events, forums and training sessions before and brings you the best of their collective experience. The course is filled with many <strong>cases and quizzes to reinforce your learning, covers digital use cases across 20+ sectors &amp;&nbsp;industries, and includes a full case study in the end</strong> to design and implement a digital transformation program.</p><p>The course is structured in four sections:</p><p><strong>Section 1: Introduce</strong></p><ul><li><p>What is digital, exactly, and what does it mean for individuals, companies and the broader society?</p></li><li><p>What do terms like Industry 4.0 and Society 5.0 mean?</p></li></ul><p><strong>Section 2: Learn</strong></p><ul><li><p>What are the most relevant digital technologies (AI/ML, IoT, AR/VR, RPA, Cloud, Blockchain, 3D Printing) and how do they work?</p></li><li><p>What are their applications, use cases and limitations today?</p></li></ul><p><strong>Section 3: Challenge</strong></p><ul><li><p>How can companies create value from digitization?</p></li><li><p>What are the value drivers and principles for crafting a robust digital strategy?</p></li><li><p>What percentage of digital transformations are really successful? What are the top reasons behind their failure?</p></li></ul><p><strong>Section 4: Apply</strong></p><ul><li><p>What are the best practices in creating a digital transformation roadmap?</p></li><li><p>How to secure commitment for resources, manage stakeholders and scale up beyond the pilot phase?</p></li><li><p>What are the different models for external partnerships (e.g., incubators, accelerators) and open innovation?</p></li></ul><p>By the end of this course you will be able to:</p><ul><li><p>Build a strong foundation of key digital technologies</p></li><li><p>Know how to apply them at work and create value for the company</p></li><li><p>Design and implement a successful digitalization program</p></li></ul><p>The <strong>entire course material including the slide presentation, frameworks and toolkits are fully downloadable</strong>. Further, there are additional handpicked reading material and resources available for your reference. </p><p>Feel free to reach out if you have any additional questions or clarifications. All the best for your learning journey!</p>","suitableLearners":["This course is relevant for senior managers and executives who are involved in crafting digital strategy and leading digital transformation program for their companies","It is equally useful for anyone who wants to learn about digitization and how can technology create value in their profession today"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2020-11-16T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2020-11-19T00:00:00.000Z"},"promotions":{"discountPrice":458800,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fe09c9b04f3f624d6a5"],"topics":[],"reviews":[],"meta":{"ratingCount":541,"studentCount":4497,"avgRatingScore":4.402909,"contentVideoLength":14543},"basicInfo":{"udemyCourseId":934616,"slug":"start-and-run-a-successful-consulting-business","title":"Start and Run a successful consulting business","subtitle":"The ultimate guide how to build and run a consulting firm","image":"https://img-b.udemycdn.com/course/240x135/934616_d1c9_3.jpg","price":2179070,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["Find an idea that you can turn into consulting business","How to get your first customers","Calculate in Excel whether the business makes sense or not","Sell in a scalable manner consulting projects","Manage consulting firm","Expand your consulting business into new area and scale it","You will get ready-made templates of presentations from top consulting firms","Scale the business and transform it into established firm"],"requirements":["Basic knowledge of economics","Some common sense and logic "],"description":"<p><strong>What is the aim of this course?</strong></p><p>No matter what you do at some point you will be fed up with your boss, your work, and the corporate life. Most likely you will start thinking about having your own business - something that you can put your effort into and make great as well as profitable. Maybe, a small restaurant? Maybe, a startup? &nbsp;If you are working in professional services one of the options you should seriously consider is to start and run a consulting firm. It can be a very profitable business and help you build other businesses on top of that, especially technological startups.&nbsp; &nbsp; &nbsp;</p><p>In this course, I will <strong>show you how to start and run consulting company fast and efficiently. </strong></p><p>This course is based on my 15 years of experience as a consultant in top consulting firms and owner of a&nbsp; small consulting company (the last 7 years). I&nbsp;have been also a Board Member responsible for strategy, performance improvement, and turn-arounds in the biggest firms from the Retail, FMCG, SMG, B2B, and services sectors that I worked for. Thanks to my versatile experience I know the subject from all sides including the customer of consulting firms.&nbsp;</p><p>I have carried or supervised over 90 different performance improvement projects in different industries that generated in total 2 billion of additional EBITDA. Based on what you will find in this course, I have trained in person over 100 consultants, business analysts, and managers who now are Partners in PE and VC funds, Investment Directors and Business Analysts in PE and VC, Operational Directors, COO, CRO, CEO, Directors in Consulting Companies, Board Members, etc. On top of that my courses on <strong>Udemy</strong> were already taken by more than <strong>124 000 students</strong> including people working in EY, Walmart, Booz Allen Hamilton, Adidas, Naspers, Alvarez &amp; Marsal, PwC, Dell, Walgreens, Orange, and many others.</p><p>I teach through case studies, so you will have a lot of lectures showing examples of analyses, tools that we use. To every lecture, you will find attached (in additional resources) the Excels as well as additional presentations, materials shown in the lectures so as a part of this course you will also get a library of ready-made analyses that can, with certain modification, be applied by you or your team in your work.</p><p>I do not like to overcomplicate things so in every lecture I will be quite straightforward. Most lectures will have also a lot of additional resources: templates, examples, procedures, list of tools. The idea is that you have everything that you need to start and run a consulting business in one place. If you don’t find something that you need let me know - I will try to prepare something and I will add it to the course.<strong>&nbsp;</strong>&nbsp; &nbsp; </p><p><strong>Why have I decided to create this course?</strong>&nbsp; &nbsp; </p><p>For our teams, we have created courses that help us improve the consultant onboarding and the teaching process. We have started to use them extensively also with customers that we work with and their teams. Since we made them available to a wider public we got many requests, especially on Quora, on how to run a consulting business. We try to minimize repetitive work so we decided to take this course in order to cut down on the questions we are getting.&nbsp; &nbsp; </p><p>This course is based on our extensive experience in working and running consulting companies. In many cases, we use also a lot of clever solutions from other service companies that we helped set up and improve.&nbsp; &nbsp; </p><p><strong>In what way will you benefit from this course?</strong>&nbsp; &nbsp;</p><p>The course is a practical, step-by-step guide loaded with tones of, tricks, hints, examples that will significantly speed up your process of starting the company and afterward scaling to a sensible size. There is little theory – mainly examples, a lot of tips from my own experience as well as other notable examples worth mentioning. We intend that thanks to the course you will know:&nbsp; &nbsp; </p><ol><li><p>Where to find ideas for consulting business, consulting firm?</p></li><li><p>How to analyze in Excel whether the business makes sense or not?</p></li><li><p>How to get first customers?</p></li><li><p>What to concentrate on if you are a 1-man show, a freelancer?</p></li><li><p>What kind of tools you should have?</p></li><li><p>How and in what way you can set up pricing for your services?</p></li><li><p>How to prepare for scaling, expanding?</p></li><li><p>What kind of business you can build based on a consulting firm?&nbsp;&nbsp;&nbsp;</p></li></ol><p>You can also ask me any question either through the discussion mode or by messaging me directly.&nbsp; &nbsp; &nbsp; </p><p><strong>How the course is organized?</strong>&nbsp; &nbsp;</p><p>The course is divided into the following sections:&nbsp; &nbsp; </p><ul><li><p><strong>Introduction. </strong>We begin with a little intro into the course &nbsp;and consulting</p></li><li><p><strong>Where you can get ideas for your consulting businesses. </strong>In the second section, we show where you can find ideas on which you can build a consulting business.</p></li><li><p><strong>The business model of a service company.</strong> In the third section, I will show you how to calculate whether your consulting business will make money. We start with a general service company and show how to put it in Excel, how to draw conclusions out of this.</p></li><li><p><strong>1-man show. The next</strong> section will show you what you should concentrate on if you are running a 1-man show, you are forced to be a jack of all trades. This is also very good for freelancers and coaches.</p></li><li><p><strong>Getting first customers. </strong>In the fifth section, you will learn how to sell your services, where you can get the first customers for your consulting services. For the time being, we show 8 ways but we will constantly update with new ideas</p></li><li><p><strong>Tools you need in a consulting company. </strong>To be successful in consulting you need a lot of tools created in a proper manner. We will show you what you should use and in what way to be successful in your business</p></li><li><p><strong>Pricing. </strong>One of the most important things in consulting business is pricing. I will show you how you can set your price, what should be your pricing positioning and how you calculate the price and margins of a specific project. We will talk also about dynamic pricing and how to get sell cheap projects to your customers with high margins for you</p></li><li><p><strong>Managing consulting company. </strong>We have a separate section on the organization of the consulting company. We talk here about the structure of the company and the role of specific positions.</p></li><li><p><strong>Preparation for scaling of consulting company. </strong>In this section, we talk about things that have to be properly set up before scaling them to significant sizes. If you have already a functioning consulting business this section is for you.</p></li><li><p><strong>How you can expand. </strong>In the last section, we talk about ways in which you can expand and build based on consulting new business.</p></li></ul><p>&nbsp;&nbsp; &nbsp; </p><p><strong>You will be able also to download many additional resources</strong>&nbsp; &nbsp;</p><ol><li><p>Examples in Excel, Word, PowerPoint</p></li><li><p>Presentation of slides shown in the course</p></li><li><p>Links to additional presentations and movies</p></li><li><p>Links to books worth reading&nbsp; &nbsp;</p></li></ol><p>So enjoy the course and if you have any questions let me know</p>","suitableLearners":["People working in professional services","Consultants","Startups founders","Entrepreneurs","Freelancers","Coaches"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-03-08T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-03-11T00:00:00.000Z"},"promotions":{"discountPrice":321160,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fe09c9b04f3f624d6a5"],"topics":[],"reviews":[],"meta":{"ratingCount":290,"studentCount":956,"avgRatingScore":4.2975774,"contentVideoLength":11067},"basicInfo":{"udemyCourseId":2380650,"slug":"the-fundamentals-of-end-to-end-supply-chain-management","title":"The Fundamentals of end-to-end Supply Chain Management","subtitle":"Supply Chain Management - Level 1: Introducing all the Key Components of a Supply Chain","image":"https://img-c.udemycdn.com/course/240x135/2380650_2f5a.jpg","price":458570,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["An overview of: the end-to-end supply chain, supply chain management, procurement & supplier management, contracts & negotiations, supply chain strategy, logistics (inbound & outbound), supply chain enablement, supply chain planning, supply chain network optimisation."],"requirements":["No"],"description":"<p><strong>SUPPLY CHAIN MANAGEMENT TRAINING MODULES – DR DION GLASS</strong></p><p><br></p><p>1. INTRODUCTION TO END-TO-END SUPPLY CHAIN</p><p>a. Introducing the end-to-end Supply Chain and its components</p><p><br></p><p>2. CONTRACT MANAGEMENT &amp; NEGOTIATIONS (2 Parts)</p><p>a. What is contracting all about?</p><p>i. Plan for the best, prepare for the worst</p><p>ii. Guidelines and relationships</p><p>b. Typical contract scenarios</p><p>i. Service agreements (simple/complex)</p><p>ii. Goods/Material supply (simple/complex)</p><p>iii. Goods &amp; Services (simple/complex)</p><p>iv. EPC/EPCm/Project contracts (fixed term)</p><p>v. **We will explain contract types in the advanced module</p><p>c. Critical components of a contract</p><p>i. Company information</p><p>ii. Price</p><p>iii. Payment terms</p><p>iv. Supply/Volume</p><p>v. Service</p><p>vi. Quality</p><p>vii. Lead times/Completion times</p><p>viii. R&amp;D</p><p>ix. Penalties/Performance/Warranties/Guarantees</p><p>x. Non-disclosure/Confidentiality</p><p>xi. Contract duration</p><p>xii. Legal landscape (T&amp;Cs)</p><p>1. Force majeure</p><p>2. Overarching law</p><p>3. Dispute resolution</p><p>4. Breach</p><p>5. SHERQ</p><p>6. Risk</p><p>7. Company closure</p><p>8. General terms</p><p>d. Contracting with strategic intent – what are the actual key drivers?</p><p>i. Why is contract management beyond T&amp;C’s?</p><p>ii. The four quadrants of suppliers – where does the power lie?</p><p>e. Keeping a contract register</p><p>i. Lapsing contracts</p><p>ii. Lapsing guarantees</p><p>f. Negotiations</p><p>i. Knowing what your business needs</p><p>ii. Knowing what your suppliers need</p><p>iii. The correct negotiating team</p><p>1. Frontline</p><p>2. Backline</p><p>iv. TCO</p><p>v. The optimal solution</p><p><br></p><p>3. PROCUREMENT &amp; SUPPLIER MANAGEMENT</p><p>a. What is procurement compared to purchasing?</p><p>i. What is TCO?</p><p>b. Procurement in the four quadrants</p><p>c. Procurement and Supplier categories</p><p>d. Spend analysis</p><p>e. Classic supplier performance KPAs</p><p><br></p><p>4. STRATEGIC SOURCING</p><p>a. What is Strategic Sourcing?</p><p>b. Why is Strategic Sourcing important?</p><p>c. Strategic Sourcing categories</p><p><br></p><p>5. INBOUND, OUTBOUND LOGISTICS AND NETWORK DESIGN</p><p>a. What is Inbound and Outbound Logistics?</p><p>i. Different types</p><p>b. What is Supply Chain Network Design?</p><p>c. What are the key elements in Network Design?</p><p><br></p><p>6. SUPPLY CHAIN PLANNING</p><p>a. Supply-Demand Planning</p><p><br></p><p>7. ON-SITE LOGISTICS</p><p>a. On-site storage and warehousing – Inbound and Outbound</p><p>b. Materials management</p><p><br></p><p>8. SUPPLY CHAIN ENABLEMENT</p><p>a. Supply Chain systems</p><p>b. Policies, Processes and Procedures</p><p>c. Supply Chain Governance</p><p><br></p><p>9. SUPPLY CHAIN STRATEGY</p><p>a. What is Supply Chain Strategy?</p><p>b. Different Supply Chain Strategies</p><p>c. Supply Chain Strategy and Business Strategy</p>","suitableLearners":["People interested in a career in Supply Chain; People working in Supply Chain & would like to enhance their skills; People who want to have a better understanding of Supply Chain Management"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2019-08-29T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2019-09-01T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fe09c9b04f3f624d6a5"],"topics":[],"reviews":[],"meta":{"ratingCount":272,"studentCount":907,"avgRatingScore":4.3025694,"contentVideoLength":4472},"basicInfo":{"udemyCourseId":196236,"slug":"key-account-management-program-kam","title":"Key Account Management Program (KAM)","subtitle":"This program is teaching, how to sell to major accounts. You can develop Key Account Program if you get this course","image":"https://img-c.udemycdn.com/course/240x135/196236_b74d_2.jpg","price":573270,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["You can start developing Key Account Program","You can start developing selling strategies for major customers","You can learn executive sales strategies","You can learn internal and external lobbying technics","You can develop executive business speaking","You can increase business knowledge","Deliver results for your company and your client","You can develop your consultative selling skills"],"requirements":["Experience in sales","Minumum 3-4 years experience in the enterprise and goverment market","Experience in managing sales and support people","preferred project management knowledge"],"description":"<p>  \t        As you know, in enterprise market, 80 % of revenue comes from 20% of company’s customers. So the company should allocate its resources according this percentage. (People-investment-marketing-) In some cases, like telecom or energy sector, one customer generate 90 % of the revenue. This means, an account manager or a team with managers should be very senior end experienced to manage this account. What do you think? Do you need a key account program in your company? Do you need a key account manager in your company? If yes you should take this course.  </p>","suitableLearners":["Salespeople, Account Managers, Key account Managers, Sales Managers, CEO who wants to learn KEY Account Management Program"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2014-08-19T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2014-08-22T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["625e7f939c9b04f3f624d66b","625e7fe09c9b04f3f624d6a5"],"topics":[],"reviews":[],"meta":{"ratingCount":217,"studentCount":1580,"avgRatingScore":4.4263625,"contentVideoLength":16038},"basicInfo":{"udemyCourseId":3719230,"slug":"certified-strategy-professional-csp","title":"Certified Strategy Professional (CSP)","subtitle":"Learn strategy from \"Strategy Planning & Execution From A to Z\" best-selling author (Free Book, APP, & Forms)","image":"https://img-b.udemycdn.com/course/240x135/3719230_729f.jpg","price":1949670,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["Strategy Development","Environmental Scanning","Strategy Management","Balanced Scorecard","KPIs Selection","KPIs Forms & Types","KPIs Polarity & Documentation","Target Setting Methods","Strategy Vertical Alignment","Strategy Horizontal Alignment","Employee Alignment","OGSM Strategy Method","Cascading in Public Sector","Strategy Execution","Strategy Review Meeting","Leadership & Communication"],"requirements":["Basic business management skills"],"description":"<p>The purpose of this online course is to highlight the <strong>critical factors that lead to successful</strong> <strong>strategy</strong> development and implementation. It focuses on the reasons why some organizations effectively implement their strategic plan while many others fail to do so. In addition, it aims to inform the student on <strong>various effective tools and techniques used</strong> in strategic planning cycle, from development stage to implementation stage.</p><p>Having an <strong>effective strategic planning and execution process</strong> is becoming increasingly critical in today’s dynamic and integrated environment. For this reason, this course fills the gap by introducing most common weaknesses that could help strategic planning and performance professionals to avoid them and do their job more effectively.</p><p>Leaders had been developing and executing strategies for centuries, but with <strong>most common weaknesses highlighted</strong> here, there is a fairly high likelihood that they will do fewer mistakes in the future. Summarizing all what \"To-Do\" and what \"Not-To-Do\" in one <strong>free book \"Strategy Planning &amp; Execution From A to Z\"</strong> is an advantage. </p><p><br></p><p>Best Used Tools &amp; Techniques For a Winning Strategic Plan: (Included)</p><p><strong><em>11 FREE BOOK, TEMPLATES, PHONE APP, &amp; CLOUD SYSTEM</em> </strong>are included with this master course: (with explanation during the course)</p><p>1) <strong>\"Strategy Planning &amp; Execution From A to Z\"</strong> Book (Free soft copy) </p><p>2) <strong>Kippy Cloud system</strong> (To host strategy, KPIs, projects, &amp; appraisals)</p><p>3) <strong>\"KPI Mega Library\"</strong> <strong>Phone APP</strong> with 36,000 KPIs </p><p>4) <strong>Balanced Scorecards template</strong> with dashboards (Excel) x 2</p><p>5) <strong>Projects template</strong> with dashboards (Excel) </p><p>6) <strong>HR appraisal template</strong> with individual KPIs (Excel) </p><p>7) <strong>Quarterly performance review template</strong> for review meeting (PPT) </p><p>8) <strong>Strategy &amp; KPI Terminologies</strong> for future use (PDF)</p><p>9) <strong>Kaizen Initiative Template</strong> and process (Excel)</p><p>10) <strong>Strategy development &amp; alignment</strong> template (PPT)</p><p><br></p><p><strong><em>“Your Complete Tool Set for Successful Strategy Implementation”</em></strong></p><p><br></p><p><strong>Note: </strong>There is an optional additional online exam (excluded) that you can take to become a \"Certified Strategy Professional (CSP)\"</p>","suitableLearners":["Anyone who is involved in strategy planning and execution, staff level, HR team, managers, team leaders, directors, statistics team, and strategists"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-03-15T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-03-18T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}}]