[{"status":"active","categories":["622c1fa5a2de424e23bbe971","6255171e87671dccf53fbc3c"],"topics":[],"reviews":[],"meta":{"ratingCount":26875,"studentCount":117851,"avgRatingScore":4.5602617,"contentVideoLength":47292},"basicInfo":{"udemyCourseId":461160,"slug":"learn-and-understand-nodejs","title":"Learn and Understand NodeJS","subtitle":"Dive deep under the hood of NodeJS. Learn V8, Express, the MEAN stack, core Javascript concepts, and more.","image":"https://img-c.udemycdn.com/course/240x135/461160_8d87_6.jpg","price":1949670,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["Grasp how NodeJS works under the hood","Understand the Javascript and technical concepts behind NodeJS","Structure a Node application in modules","Understand and use the Event Emitter","Understand Buffers, Streams, and Pipes","Build a Web Server in Node and understand how it really works","Use npm and manage node packages","Build a web application and API more easily using Express","Connect to a SQL or Mongo database in Node","Understand how the MEAN stack works","Be the coder that explains NodeJS to everyone else because you understand it better than anyone else"],"requirements":["Basic Javascript knowledge (variables, loops, and basic functions)","Basic HTML knowledge","A text editor"],"description":"<p>NodeJS is a rapidy growing web server technology, and Node developers are among the highest paid in the industry. Knowing NodeJS well will get you a job or improve your current one by enabling you to build high quality, robust web applications.</p><p>In this course you will gain a deep understanding of Node, learn how NodeJS works under the hood, and how that knowledge helps you avoid common pitfalls and <em>drastically improve your ability to debug problems</em>. </p><p>In this course we'll look at <strong>how the C++ written V8 Javascript engine works and how NodeJS uses it to expand the abilities of Javascript</strong>. You'll learn how to structure your code for reuse and to be easier to understand, manage, and expand using <strong>modules and understand how modules really work</strong>.</p><p>You'll learn <strong>how asynchronous code works in Node and the Node event loop</strong>, as well as how to use the <strong>event emitter, streams, buffers, pipes, and work with files</strong>. We'll see how that leads to <strong>building a web server in Node</strong>. </p><p>We'll dive into<strong> web sites, web apps and APIs with Express</strong> and learn how Express can save us time as Node developers.</p><p>You'll also gain an understanding of <strong>npm, connecting to databases, and the MEAN stack</strong>!</p><p>During it all you'll gain a deep understanding of the Javascript concepts and other computer science concepts that power Node.</p><p>NodeJS doesn't have to be hard to learn. The biggest mistake most coding tutorials make is expecting someone to learn simply by imitating others' code. Real world situations are never exactly like the tutorial.</p><p>I believe the best way to learn is to understand how a tool works and what it does for you, look at examples, and then try it yourself. That's how this course is built, with the goal to help you both learn and understand NodeJS.</p><p><em>Note: In this course you'll also get </em><strong><em>downloadable source code</em></strong><em>. You will often be provided with 'starter' code, giving you the base for you to start writing your code, and 'finished' code to compare your code to.</em></p>","suitableLearners":["Those looking to build a career as a NodeJS developer","Those desiring to become MEAN stack developers","Those who don't have server technology experience but wish to gain this skill","Those coming from other server technologies (like PHP, ASP.NET, or Ruby on Rails) and want to learn Node","Those who want to only have to write both client and server code in one language: Javascript","Those who want to grasp Express"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2020-09-24T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2020-09-27T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["622c1fa5a2de424e23bbe971","6255171e87671dccf53fbc3c"],"topics":[],"reviews":[],"meta":{"ratingCount":22272,"studentCount":68601,"avgRatingScore":4.708802,"contentVideoLength":74770},"basicInfo":{"udemyCourseId":2153774,"slug":"modern-html-css-from-the-beginning-including-sass","title":"Modern HTML & CSS From The Beginning (Including Sass)","subtitle":"Build modern responsive websites & UIs with HTML5, CSS3 & Sass! Learn Flex & CSS Grid","image":"https://img-b.udemycdn.com/course/240x135/2153774_bef0_4.jpg","price":1949670,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["Build Multiple High Quality Website & UI Projects","HTML5 Semantic Layout & CSS Fundamentals","Flexbox & CSS Grid Projects","CSS Variables, Transitions, Dropdowns, Overlays & More","Website Hosting & Deployment With FTP & Git","All Skill Levels"],"requirements":["This course is for any developer, beginner to advanced"],"description":"<p>This course is for both beginners and seasoned developers that want to learn how to build responsive websites and user interfaces with modern HTML5 and CSS3+ technologies like Flexbox and CSS Grid as well as the Sass pre-compiler. This course includes hours of both learning &amp; studying sections along with real life projects. Stop having to rely on frameworks like Bootstrap for your user interface and learn how to create your own layouts and utility classes to build custom responsive websites and app UIs.</p><p>The first few sections are tailored for beginners so even if you have never built anything before, you will learn all of the basics. If you already have experience with basic HTML &amp; CSS, just move to section 3 or 4 and get started.</p><p><strong>Things We Cover</strong></p><ul><li><p>How Websites Work</p></li><li><p>Visual Studio Code Setup, Shortcuts, Live Server &amp; Emmet</p></li><li><p>HTML5 Semantic Layout</p></li><li><p>CSS Fundamentals</p></li><li><p>Responsive Design With Media Queries</p></li><li><p>CSS Units - rem, em, vh, vw, etc</p></li><li><p>Flexbox</p></li><li><p>CSS Grid</p></li><li><p>Animation with Keyframes &amp; Transitions</p></li><li><p>CSS Variables</p></li><li><p>Sass Pre-compiler with portfolio project</p></li><li><p>Full Projects &amp; Mini Projects</p></li><li><p>Website Deployment to Shared Hosting &amp; Netlify With Git</p></li><li><p>Much More</p></li></ul><p><em>Sections on </em><strong><em>Sass</em></strong><em> will be being added very shortly!</em></p>","suitableLearners":["From absolute beginner to seasoned developer"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-03-23T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-03-26T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["622c1fa5a2de424e23bbe971","6255171e87671dccf53fbc3c"],"topics":[],"reviews":[],"meta":{"ratingCount":21858,"studentCount":110019,"avgRatingScore":4.6126804,"contentVideoLength":45669},"basicInfo":{"udemyCourseId":833442,"slug":"angular-nodejs-the-mean-stack-guide-2022-edition","title":"Angular & NodeJS - The MEAN Stack Guide [2022 Edition]","subtitle":"Learn how to connect your Angular Frontend to a NodeJS & Express & MongoDB Backend by building a real Application","image":"https://img-c.udemycdn.com/course/240x135/833442_b26e_5.jpg","price":1949670,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["Build real Angular + NodeJS applications","Understand how Angular works and how it interacts with Backends","Connect any Angular Frontend with a NodeJS Backend","Use MongoDB with Mongoose to interact with Data on the Backend","Use ExpressJS as a NodeJS Framework","Provide a great user experience by using Optimistic Updating on the Frontend","Improve any Angular (+ NodeJS) application by adding Error Handling"],"requirements":["Concepts behind NodeJS, Express and MongoDB (with Mongoose) will be refreshed in this course but as this course is focused on the connection of these technologies with Angular, basic knowledge about them is strongly recommended","It is recommended to have beginner-level Angular knowledge, though this course will provided a detailed refresher and will explain the core concepts used in detail","HTML, CSS and basic JavaScript knowledge is assumed throughout this course","NO advanced or expert knowledge about any of these topics is assumed or required"],"description":"<p><strong>I created the bestselling Angular course - this course now allows you to take your Angular knowledge to the next level!</strong></p><p><strong>Learn how to create modern, scalable and high-speed web applications with Angular + Node.js + Express + MongoDB.</strong></p><p>Angular 1 and NodeJS, together with ExpressJS (a&nbsp;NodeJS Framework) and MongoDB formed the very popular MEAN stack. Now is the time to dive into MEAN 2.0 and replace Angular 1 with Angular 2+.</p><p>Benefit from the many improvements and advantages Angular&nbsp;offers you: Speed, ease of development, highly reactive, awesome support for asynchronous operations, great scalability and more!<br>And combine these advantages with the power of a NodeJS + Express + MongoDB backend!</p><p><strong>Learn or refresh the Angular&nbsp;Basics!</strong></p><p>This course is no Angular&nbsp;course, but it includes detailed explanations of the core concepts used as well as about Angular&nbsp;in general. However, keep in mind that, as this course is no Angular&nbsp;course, having additional&nbsp;resources&nbsp;like my \"Angular - The Complete Guide\"&nbsp;course&nbsp;is recommended.</p><p><strong>In this course, Maximilian, experienced web developer as well as author of many 5-star rated Udemy courses and host of the \"Academind\"&nbsp;coding channel on YouTube, will take you on a hands-on journey to get you to build your own Angular&nbsp;+ NodeJS Applications in no time.</strong></p><p>This course follows a hands-on approach, which means that the whole course is structured around one big application and the different concepts will be explained detailedly&nbsp;as they are introduced in this application.</p><p><strong>Specifically, you will learn how to:</strong></p><ul><li><p>Set up a NodeJS + Express + MongoDB + Angular&nbsp;Application with the help of the Angular CLI</p></li><li><p>Use NodeJS and Express efficiently</p></li><li><p>Build reusable Components in Angular&nbsp;and create a reactive User Experience with the Tools provided by Angular</p></li><li><p>Connect your NodeJS (or any other language!) backend with your Angular&nbsp;App through Angular’s HttpClient service</p></li><li><p>Provide appropriate endpoints on your Backend, for your Frontend to consume</p></li><li><p>Add advanced features like file upload and pagination</p></li><li><p>Make your Application more secure by implementing Users,&nbsp;Authentication as well as Authorization</p></li><li><p>Handle Errors gracefully</p></li><li><p>And much more...!</p></li></ul><p>This hands-on&nbsp;concept allows you to not get stuck in the theory, but instantly see real implementation examples!</p><p><strong>Hear what students of other courses as well as viewers of my YouTube channel have to say</strong></p><p><em>Max has gone through great lengths to create great content and this course has been great. His teaching style covers everything from basic to advanced topics, and his explanations have been thorough on each topic</em></p><p><em>Max demonstrates very good knowledge of the subject matter and great enthusiasm in delivering the lectures.</em><br></p><p><em>Max does a wonderful job making the core concepts of Angular&nbsp;approachable and accessible.</em></p><p><strong>Don’t stop at the basics!</strong></p><p>Do you know those courses which show you a \"Hello World“ example and then call it an end? That won’t happen to you in this course. While beginning with a very basic app and basic features, you will quickly be able to incorporate many different Routes, Observables, Events, Authentication and Authorization, Error Handling and much more into your applications.<br>The best thing is: You’ll learn all that by putting it into practice immediately! No wall of powerpoint slides, no unrealistic mini-examples – this is the real deal!</p><p><strong>Who should take this course?</strong></p><ul><li><p>Basic NodeJS/Express and Angular&nbsp;Experience is strongly recommended</p></li><li><p>You should be familiar with HTML, CSS and JavaScript basics, too</p></li><li><p>MongoDB (+ Mongoose)&nbsp;knowledge is a plus as MongoDB will be used in this course but won’t be subject of in-depth explanations</p></li><li><p>NO&nbsp;expert or advanced knowledge on any of these topics is required or assumed</p></li></ul><p>By the end of this course, you will be able to create your own, awesome NodeJS + Angular&nbsp;applications!</p>","suitableLearners":["This course is for everyone interested in putting existing Angular and NodeJS knowledge into action","If you're familiar with the basics of Angular and NodeJS, this course provides a detailed guide on how to connect both technologies","Everyone interested in building a modern, full-stack application","Students who want to exercise with their NodeJS and Angular skills will find a great opportunity to do so"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-12-10T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-12-13T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["622c1fa5a2de424e23bbe971","6255171e87671dccf53fbc3c"],"topics":[],"reviews":[],"meta":{"ratingCount":21728,"studentCount":107914,"avgRatingScore":4.388364,"contentVideoLength":137672},"basicInfo":{"udemyCourseId":405282,"slug":"php-for-beginners-become-a-php-master-cms-project","title":"PHP for Beginners - Become a PHP Master - CMS Project","subtitle":"PHP for Beginners: learn everything you need to become a professional PHP developer with practical exercises & projects.","image":"https://img-b.udemycdn.com/course/240x135/405282_27d2_3.jpg","price":1949670,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["You will learn to create a (CMS) Content Management System like WordPress, Drupal or Joomla","You will learn how to use Databases","You will learn MySQL","Object Oriented Programming","You will learn how to launch your application online","How to use forms to submit data to databases","How to use AJAX to submit data to the server without refreshing the page","You will learn about PHP security","You will learn about sessions","Password hashing","Email sending","You will learn to use composer (PHP package manager)","You will learn to create clean URL's and remove the .php from files","You will learn to use bootstrap by getting experience from the project","You will learn to debug your code","You will learn to create pagination","You will code refactoring","You will learn to debug (fix your code)","You will learn to use an API to bring data from a database to a graphical interface","There is so much more and my hands are just tired of typing :)"],"requirements":["Some HTML is needed for this course (You can get my free HTML course on that)"],"description":"<p><strong>One of the biggest PHP Courses in UDEMY ........</strong></p><p><strong>Best Rated PHP course on UDEMY......</strong></p><p><strong>Over 90,000 Students taking this course already.........</strong></p><p><strong>BEST Reviewed PHP beginners course for a reason.....</strong></p><p><strong>-------------------------------------------------------------------------------------------------------------</strong></p><p><strong>Are you new to PHP or need a refresher?</strong> Then this course will help you get all the fundamentals of Procedural PHP, Object Oriented PHP, MYSQLi, and ending the course by building a CMS system similar to WordPress, Joomla, or Drupal.</p><p><strong>Knowing PHP has allowed me to make enough money to stay home and make courses like this one for students all over the world.</strong> Being a PHP developer can allow anyone to make really good money online and offline, developing dynamic applications.</p><p>Knowing <strong>PHP </strong>will allow you to build web applications, websites or Content Management systems, like WordPress, Facebook, Twitter or even Google.</p><p><strong>There is no limit to what you can do with this knowledge.</strong> PHP is one of the most important web programming languages to learn, and knowing it, will give you <strong>SUPER POWERS</strong> in the web development world and job market place. </p><p><strong>Why? </strong></p><p>Because Millions of websites and applications (the majority) use PHP. You can find a job anywhere or even work on your own, online and in places like freelancer or Odesk. You can definitely make a substantial income once you learn it.</p><p>&nbsp; \t<strong>Some of my students reviews for this course and others</strong></p><p><strong><em>Holy cr*********</em></strong></p><p><em>Readed some books about PHP but it was such boring that i never finished a book and withhold me from learning, this course helped me out straight.. After seeing a free tut on youtube i subscribed the course and jeez, i don't even need goals to get or stay motivated cause i have the instructor: Edwin Diaz, his way of teaching is friggin awesome (and fun) and easy listening! To be honest its keeping me away from bed xD.. I really really love the course. If i need to describe the course from my personal view, one word: Epic! Really looking forward for the stuff that will be added in the future! Great job and thumbs up! Greetings from a Dutchy</em></p><p><strong><em>Best PHP course************</em></strong></p><p><em>This course is just awesome. You will learn the basics and then you will jump to making your own CMS. Every little piece of code is described very well, so you exactly know, what you are doing. After finishing this course I was ready to make my own social networking site and that's amazing isn't it? Another great part of this course is its instructor, who helps you with every issue you have in short time. I've have already done many internet courses, but this is definetly the best one.</em></p><p><strong><em>The Best Php course made FUN and EASY worth The Money!!! *************</em></strong></p><p><em>Hi Edwin You have made 'learning PHP very fun an easy to follow. I got so many ideas that I want to do and had been searching around for 3 years now looking for the right course and lecturer that will help me fulfill my dream. I want to thank you that I have gone through more than half of your online course now and I am still interested to complete it. Thank you for your motivation and kind words. It what keeps me going and I know that once I finish this, I will be able to achieve my goal. I believe that your course is the key to my success in fulfilling my dream. AND the best part is the Lecturer always replies to your questions</em></p><p><strong><em>The best course I have taken so far ***************</em></strong></p><p><em>Every programming course I have taken until now has been extremely boring and I found it difficult to concentrate, but your course was clear, entertaining and kept me hooked till the very end. I remember everything I learnt in your course and have gained a deeper understanding of terms and methodologies that seems incomprehensible until now. Thank you</em></p><p><strong><em>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; ***************************End of Reviews ***********************</em></strong></p><p><strong>My Promise to You</strong></p><p>&nbsp; \t&nbsp; &nbsp; &nbsp; I created this course not just to make money but to teach you the knowledge that will help you with PHP since I was in your shoes some years ago. If you need support, I will be just a message or an email away. I love what I do, but most importantly I love when my students succeed and that for me is priceless. You success depends on yours and I will make sure with that you get all the help you need when you need it.</p><p><strong>I will not bore you :)</strong></p><p>I take my courses very seriously but at the same time I try to make it fun since I know how difficult learning from an instructor with a monotone voice or boring attitude is. This course is fun, and when you need some energy to keep going, you will get it from me.</p><p><strong>My Approach</strong>&nbsp; </p><p>&nbsp; \t&nbsp; &nbsp; &nbsp; Practice, practice and more practice. Every section inside this course has a practice lecture at the end, reinforcing everything with went over in the lectures. I also created a small application the you will be able to download to help you practice PHP. To top it off, we will build and awesome CMS like WordPress, Joomla or Drupal.</p><p><strong>Your $ invested in this course will be multiplied over and over again</strong></p><p> With over <strong>176 lectures and over of 20 hours </strong>of PURE PHP knowledge from the real world, you can bet, your money will be well spent in this course.</p><p><strong>100% Money Back if you don't like it</strong></p><p>With 100% money guaranteed within 30 days, you have NOTHING to lose and a world of possibilities for your future. If for some reason you don't like the course or me, you can get your money back from Udemy.</p><p>&nbsp; \t<strong>Commonly Asked Questions.....</strong>&nbsp; </p><p>&nbsp; \t<strong>Q: Is PHP worth it to learn? </strong>&nbsp; </p><p>&nbsp; \t<strong>A: YES YES YES...</strong>&nbsp; </p><p>&nbsp; \t&nbsp; &nbsp; &nbsp; PHP is one of the best web programming languages in the world, and all the large important websites, like Google, Apple, Facebook, Yahoo, Wikipedia and many more use it for their web applications.&nbsp; </p><p>&nbsp; \t<strong>Q: Can I make Money if I know PHP?</strong>&nbsp; </p><p>&nbsp; \t<strong>A: LOTS of it</strong>&nbsp; </p><p>&nbsp; \t&nbsp; &nbsp; &nbsp; Go over to freelancer dot com and search for PHP projects. You will see so many projects waiting for people to finish them in that site. There are actually more projects in PHP than in any other language.&nbsp; </p><p>&nbsp; \t<strong>This PHP Course Covers the following and then some...</strong>&nbsp; </p><ul><li><p>Databases in PHP</p></li><li><p>Object Oriented PHP</p></li><li><p>CMS project-similar to (Wordpress)</p></li><li><p>Form Submissions in PHP</p></li><li><p>Security in PHP</p></li><li><p>Variables in PHP</p></li><li><p>Math in PHP</p></li><li><p>Arrays in PHP</p></li><li><p>Control Structures in PHP</p></li><li><p>Comparison Operators in PHP</p></li><li><p>Mayor Loops in PHP</p></li><li><p>Functions in PHP</p></li><li><p>Constants in PHP</p></li><li><p>Super Globals in PHP</p></li><li><p>Sessions in PHP</p></li><li><p>Cookies in PHP</p></li><li><p>Learn to work with FILES</p></li><li><p>Custom search feature</p></li><li><p>Authentication</p></li><li><p>Learn to use jQuery + Bootstrap</p></li><li><p>RealTime Notifications with JS</p></li><li><p>Protect your credentials with .ENV</p></li><li><p>Learn Composer (PHP dependency Manager)</p></li><li><p>Learn to send emails - from PHP or using a third party Package</p></li><li><p><strong>And much much more .....</strong></p></li></ul><p>With the AMAZING&nbsp;project we build, you will learn all the SKILLS&nbsp;to land that job or project. This is a real project that we take online and I&nbsp;walk step by step on everything from scratch.</p><p><br></p><p>&nbsp; \t<strong>Please look at all the lectures to see more things that are covered.</strong>&nbsp; </p>","suitableLearners":["This course is meant for TOTAL beginners in PHP","No programming experience is needed at all"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-01-20T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-01-23T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["622c1fa5a2de424e23bbe971","6255171e87671dccf53fbc3c"],"topics":[],"reviews":[],"meta":{"ratingCount":21430,"studentCount":77885,"avgRatingScore":4.603083,"contentVideoLength":141113},"basicInfo":{"udemyCourseId":1286908,"slug":"the-complete-react-developer-course-w-hooks-and-redux","title":"The Complete React Developer Course (w/ Hooks and Redux)","subtitle":"Learn how to build and launch React web applications using React, Redux, Webpack, React-Router, and more!","image":"https://img-c.udemycdn.com/course/240x135/1286908_1773_6.jpg","price":1949670,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["Build, test, and launch React apps","Use cutting-edge ES6/ES7 JavaScript","Setup authentication and user accounts","Deploy your React apps live to the web","Learn the latest React libraries and tools","Master React, Redux, React-Router, and more"],"requirements":["A computer on which you can install software (Windows, MacOS, or Linux)","An understanding of core JavaScript (functions, objects, arrays, callback functions)"],"description":"<p><strong>This course was just updated to support React v16, React Hooks, the Context API, and more!</strong></p><p><strong>--</strong></p><p><strong>Have you tried to learn React before?</strong></p><p>It’s easy to go down the rabbit hole of libraries and tools only to come out of it not knowing how to build and launch a real-world React application. You get things configured, but you’re not sure how the libraries fit together (or if you’re even using the right one).</p><p>Sound familiar? </p><p><strong>I built this course to show you how you can build and launch real-world React web applications.</strong></p><p>The Complete React Web Developer Course 2 starts with the fundamentals and covers everything you’ll need to build and launch React web apps.</p><p>You’ll see what it takes to build and launch a React app, from the first line of code to the final production deployment.</p><p>This course was designed around one goal: turning you into a professional React developer capable of developing, testing, and deploying real-world production applications.</p><p><strong>You’ll learn React by doing, not watching.</strong></p><p>From the first videos you’ll be building out each project as well as completing programming challenges I’ve designed to test and reinforce what you’ve learned.</p><p>Throughout the course you’ll build two React web apps:</p><ol><li><p>The first app, a decision-making app called Indecision, is our starter application. You’ll learn the fundamentals of React while seeing exactly what it takes to get a React app up and running.</p></li><li><p>The second app, an expense manager called Budget, has all the features you’d expect from a real application. You’ll set up authentication, user accounts, routing, testing, form validation, database storage, and more.</p></li></ol><p><strong>Stay up-to-date in an ever changing world.</strong></p><p>The world of React changes fast, and that’s why I’m always working to keep this course as up-to-date as possible. You can jump in knowing you’re getting access to hot-off-the-press features.</p><p><strong>Everything you need comes in one easy-to-use package.</strong></p><p>There’s no need to worry if you’re learning the right skills to land that React job or launch that React app. I’ve mapped out everything you need to know in an interactive easy-to-follow package designed to get you up and running in a couple of weeks.</p><p><strong>There’s no better time to learn React.</strong></p><p>React’s not going anywhere. Companies like Facebook, Walmart, Uber, Airbnb, and Netflix are all using React in production right now.</p><p>They’ve also made heavy investments in the React ecosystem, creating new libraries and tools that speed up and simplify React development. From the biggest to the smallest, everyone’s using React and new jobs are popping up every day.</p><p><strong>Get access to fast support if you get stuck.</strong></p><p>There’s nothing worse than getting stuck ten hours into a course and not getting the help you need to continue. Getting stuck is part of the learning process. That’s why I’m here to answer every single question.</p><p>I’ll work with you to get you unstuck and back on track. It’s one of the reasons students love taking my courses:</p><p><em>“This is the absolute best course I've taken on udemy. Andrew is amazing at explaining things concisely, and the flow of the course is perfect. He doesn't skip over anything and he doesn't over-explain anything. On top of all that, he responds to questions so quickly that you won't be stuck at any point.\"</em> - Tanya Gamarian</p><p><em>\"The lessons are of high quality and even more important, he actually takes time to answer your questions!\"</em> - Thomas Vercamer</p><p>\"The instructor does an excellent job in explaining how to build React Apps. He also responds quickly to any questions that are asked.\" - Matt Willy</p><p>I guarantee that this is the most up-to-date and engaging React course available, and it comes with a Udemy 30-day money-back guarantee.</p><p><strong>Over eighteen sections you’ll learn:</strong></p><ol><li><p>React</p></li><li><p>Redux</p></li><li><p>React-Router</p></li><li><p>Webpack</p></li><li><p>Babel</p></li><li><p>Testing with Jest</p></li><li><p>Enzyme</p></li><li><p>App Debugging</p></li><li><p>App Deployment</p></li><li><p>Firebase</p></li><li><p>Authentication</p></li><li><p>Git/GitHub</p></li><li><p>ES6/ES7</p></li><li><p>And many more tools</p></li></ol><p>I can’t wait to see you on the inside!</p><p>- Andrew</p>","suitableLearners":["Anyone looking to launch their own React applications, switch careers, or freelance as a React developer"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2020-10-26T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2020-10-29T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["622c1fa5a2de424e23bbe971","6255171e87671dccf53fbc3c"],"topics":[],"reviews":[],"meta":{"ratingCount":21330,"studentCount":76906,"avgRatingScore":4.5223255,"contentVideoLength":19126},"basicInfo":{"udemyCourseId":505208,"slug":"responsive-web-design-html5-css3-for-entrepreneurs-2018","title":"Responsive Web Design: HTML5 + CSS3 for Entrepreneurs 2018","subtitle":"Build a coding foundation as an entrepreneur, where I’ll take you through the entire process of coding your own website","image":"https://img-c.udemycdn.com/course/240x135/505208_2307_5.jpg","price":1949670,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["Write HTML Code","Write CSS Code","Understand the CSS Box Model","Combine CSS and HTML to build websites"],"requirements":["A Windows or Mac computer"],"description":"<p>Learn the basic concepts, tools, and functions that you will need to build beautiful and modern websites using HTML5 &amp; CSS3.<br></p>\n\n<p>Build a strong foundation in HTML and CSS with this tutorial for beginners. </p>\n\n\n\n<ul><li>Code in HTML</li><li>Code in CSS</li><li>Understand the CSS Box Model</li><li>Combine CSS and HTML to create a beautiful modern website</li></ul>\n\n\n\n<p><br></p>\n\n\n\n<p><strong>A Powerful Skill at Your Fingertips </strong><br>Learning the fundamentals of HTML5 &amp; CSS3 puts a powerful and very useful tool at your fingertips. HTML &amp; CSS are free, easy to learn, has excellent documentation, and is the base for all things on the web. . </p>\n\n\n\n<p>When I am asked: Where should I start if I want to learn programming? My response is always HTML and CSS. Have you ever wanted to dive further into Wordpress themes? Have you ever wanted to create a beautiful HTML email? Or maybe you just want to be able to design websites. This course is the place to start.</p>\n\n\n\n<p><strong>Content and Overview </strong><br><br>Suitable for beginning programmers, through this course of 56 lectures and 6 hours of content, you’ll start by downloading a text editor and coding in HTML. Random lectures have specific \"challenges\" sprinkled in. </p>\n\n\n\n<p>After creating some basic web pages and learning about HTML syntax we will go over the differences and changes in HTML 5.(Todays standard)</p>\n\n\n\n<p>With the basics of HTML established, we will begin to dive into the world of cascading style sheets.(CSS) We can supercharge our learning by tackling both at the same time.</p>\n\n\n\n<p>Finally, we take the course into \"project mode.\" We will go step by step, line by line, and code our own modern and beautiful website using CSS3 and HTML5. </p>\n\n\n\n<p><br></p>\n\n\n\n<p>This course was created to establish a foundation in programming by learning HTML5 and CSS3. These are the building blocks of all websites.<br></p>\n\n\n\n<p>This course is targeted towards teaching every day people to code, not just computer science majors. </p>\n\n\n\n<p><br></p>\n\n\n\n<p><br></p>","suitableLearners":["Beginners that have no HTML or CSS experience."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2018-09-04T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2018-09-07T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["622c1fa5a2de424e23bbe971","6255171e87671dccf53fbc3c"],"topics":[],"reviews":[],"meta":{"ratingCount":21004,"studentCount":107777,"avgRatingScore":4.621034,"contentVideoLength":85800},"basicInfo":{"udemyCourseId":1466612,"slug":"ethereum-and-solidity-the-complete-developers-guide","title":"Ethereum and Solidity: The Complete Developer's Guide","subtitle":"Use Ethereum, Solidity, and Smart Contracts to build production-ready apps based on the blockchain","image":"https://img-b.udemycdn.com/course/240x135/1466612_bead_2.jpg","price":1949670,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["Understand the why engineers would want to create an app with Ethereum","Build compelling blockchain applications using the Ethereum Blockchain","Design, test, and deploy secure Smart Contracts","Learn the true purpose and capabilities of Ethereum and Solidity","Use the latest version of Ethereum development tools (Web3 v1.0)","See practical examples to comprehend what the blockchain and mining are"],"requirements":["Basic Knowledge of Javascript and NPM","A Mac, PC, or Linux Machine"],"description":"<p><strong>Smart Contracts? </strong>They're here.  <strong>The </strong><strong>Ethereum Blockchain?  </strong>Covered.  <strong>Solidity?  </strong>Yep!</p>\n\n<p>There can be no understating it: Ethereum and Blockchain technology is the most disruptive force in years.  Companies cannot hire developers who understand blockchain technologies fast enough, but there are a tiny number of resources published to help you truly <em>understand</em> what blockchains are used for, let alone build apps with them.  That's the purpose of this course: <strong></strong>to be the <strong>best resource online</strong> for learning about Ethereum, blockchains, and how to build apps with this new technology.<strong></strong></p>\n\n\n\n\n\n\n\n<p>The development community is still figuring out the best way to use Ethereum in the creation of new and exciting apps.  I spent a tremendous amount of time to research and create best practice for interfacing with Ethereum from Javascript.  I can't overstate it enough; this course will show you the best and <strong>most easily repeatable patterns</strong> for creating production-ready apps with Ethereum.</p><p><br></p>\n\n\n\n\n\n<p><em><strong>What tools and libraries are used?</strong></em></p>\n\n\n\n\n\n<p>The Ethereum tech ecosystem is in constant change.  Don't be fooled by other courses that mention how you'll learn a dozen different libraries!  Every library that you'll use with Ethereum breaks and is deprecated on a near-weekly basis!  Instead, this course will teach you <strong>how to assemble your own boilerplate package </strong>to develop, compile, and test Smart Contracts.  By learning the <strong>core technologies</strong>, you'll be prepared to adjust to Ethereum no matter how the ecosystem changes.<br></p>\n\n\n\n\n\n\n\n<p><em><strong>What is Ethereum?</strong></em><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Ethereum is a cryptocurrency much like Bitcoin, and it has been heralded as <strong>Bitcoins successor</strong>.  Whereas Bitcoin currently has issues scaling with an increasing backlog of transactions, Ethereum is poised to surpass Bitcoin in performance, popularity, and value.  Ethereum was created to help developers like you create applications focused around transferring money or value from one party to another.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em><strong>What is Solidity?</strong></em></p>\n\n\n\n\n\n\n\n<p>Solidity is a programming language for writing Smart Contracts.  Essentially, think of it as a way to control a bank account with code.  With Solidity, we can write applications that simulate a crowd funding campaign, a lottery, a loan, or any other type of financial instrument.  Don't be intimidated by learning 'another' programming language; Solidity is known to be quite similar to Javascript and exceptionally easy to pick up for anyone who has previous JS experience.  This course will give you all the tools you need to master Solidity.<br></p>\n\n\n\n\n\n\n\n<p><br></p>","suitableLearners":["Programmers looking to leverage blockchain technology for advanced apps","Engineers who want to understand Ethereum and how to build apps with it"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-04-01T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-04-04T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["622c1fa5a2de424e23bbe971","6255171e87671dccf53fbc3c"],"topics":[],"reviews":[],"meta":{"ratingCount":20721,"studentCount":92437,"avgRatingScore":4.5546727,"contentVideoLength":24693},"basicInfo":{"udemyCourseId":289230,"slug":"learn-and-understand-angularjs","title":"Learn and Understand AngularJS","subtitle":"Master AngularJS and the Javascript concepts behind it, design custom directives, and build a single page application.","image":"https://img-c.udemycdn.com/course/240x135/289230_1056_16.jpg","price":1949670,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["Learn fundamental Javascript concepts that power AngularJS.","Write quicker, better AngularJS code by discovering how AngularJS itself is built.","Become fluent in AngularJS terminology, such as dependency injection, services, directives, transclusion, and more.","Realize the power of dependency injection, and how AngularJS accomplishes it.","Design custom directives and save time and energy with easily reusable components.","Understand what a Single Page Application (SPA) is, and how they work.","Build a Single Page Application (SPA) in AngularJS.","Be the coder that explains AngularJS to everyone else, because you understand it better than anyone else.","Get new free lectures during 2015, keep up with the development of AngularJS 2.0, and get a MASSIVE discount on a future AngularJS 2.0 course in 2016!"],"requirements":["A browser and a text editor","Basic HTML and Javascript knowledge"],"description":"<p><strong>Includes information on the next version - AngularJS 2.0!</strong></p>  <p>  \t                                                                                                                                                                                                                                                                                                                                                                                                        Knowing AngularJS can get you a job or improve the one you have. It's a skill that will put you more in demand in the modern web development industry, and make your web software life easier, that's why it's so popular and backed by Google.  </p>  <p>  \t                                                                                                                                                                                                This course will get you up and running quickly, and teach you the core knowledge you need to deeply understand and build AngularJS applications - and we'll build a single page application along the way<em>.</em>  </p>  <p>  \t                                                                                                                                                                                            We'll design <em><strong>custom services</strong></em><strong>, </strong>build <em><strong>custom directives</strong></em>, understand <strong><em>two-way binding</em></strong>, design a weather forecast app as a <strong><em>single page application</em></strong>, and <strong>lots more</strong>. Both starter and finished source code is provided as we go.  </p>    <p>  \t<em><strong>Reviews</strong></em>  </p>  <p>  \t<em>\"Best course I have ever seen\"</em>  \t<em>\"Best intro to AngularJS on Udemy\"  \t</em><em>\"</em><em>A fresh way of teaching AngularJS\"  \t</em><em>\"One of the best courses on Udemy that i took if not the best\"  \t</em><em>\"Best teacher I have had on the internet by far\"  \t</em><em>\"I...have taken lots of angular courses and I think this is the best one so far\"  \t</em><em>\"The best teaching style I've seen so far\"</em>  </p>    <p>  \t                                                                                                                                                                        If you are new to AngularJS, or if you've been working to learn it but sometimes feel like you still don't quite 'get it', this is the AngularJS course for you! <strong>To learn AngularJS you have to understand it.</strong>  </p>  <p>  \t                                                                                                                                                                                                                                                                                                                                                                      I've built the course that I would have wanted to take when I was learning AngularJS. A course that explains the concepts and how they're implemented in the best order for you to learn and deeply understand them.  </p>  <p>  \t                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  In this course you will:  </p>  <ul>  \t<li><strong>Learn how AngularJS works, covering subjects like <em>directives, </em><em>dependency injection, two way data binding, the digest loop, watchers</em>, and more.</strong></li>  \t<li><strong>Learn fundamental Javascript and HTML principles that are used by AngularJS, such as <em>custom attributes, loosely typed arrays, the hash, and the event loop</em>.</strong></li>  \t<li><strong>Code <em>custom services</em>.</strong></li>  \t<li><strong>Design <em>custom directives</em>, understanding concepts like <em>compile, link, and scope</em>.</strong></li>  \t<li><strong>Build a <em>single page application</em> using AngularJS.</strong></li>  \t<li><strong>Keep up with the latest on the next version of <em>AngularJS 2.0</em>!</strong></li>  </ul>  <p>  \t                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            AngularJS doesn't have to be hard to learn. The biggest mistake most coding tutorials make is expecting someone to learn simply by imitating others' code. Real world situations are never exactly like the tutorial.  </p>  <p>  \t                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            I believe the best way to learn is to understand how a tool works and what it does for you, look at examples, and then try it yourself. That's how this course is built, with the goal to help you both <strong>learn </strong>and <strong>understand </strong>AngularJS.  </p>  <p>  \t<em>Note: In this course you'll also get <strong>downloadable source code</strong>. You will often be provided with 'starter' code, giving you the base for you to start writing your code, and 'finished' code to compare your code to.</em></p>","suitableLearners":["Web developers and designers looking to learn AngularJS","Those who have researched AngularJS but still find it hard to understand","Developers and designers who have used jQuery but are tired of doing everything manually"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2020-09-24T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2020-09-27T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["622c1fa5a2de424e23bbe971","6255171e87671dccf53fbc3c"],"topics":[],"reviews":[],"meta":{"ratingCount":19941,"studentCount":223542,"avgRatingScore":4.4822774,"contentVideoLength":48093},"basicInfo":{"udemyCourseId":1386294,"slug":"python-for-beginners","title":"Python for beginners","subtitle":"Master the fundamentals of Python while working on various usecases in easy steps","image":"https://img-b.udemycdn.com/course/240x135/1386294_cf10_3.jpg","price":687970,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["Master the Features of Python Language","Install Python Virtual Machine and the Eclipse IDE(PyDev)","Execute your first python program","Learn various simple types as well as collection types","Define logic using conditional statements ,looping constructs","Use the different types of operators","See the input and output functions in action","Pass Command line arguments","Create and use functions , Lambdas Decorators and Generators","Learn what Object Oriented Programming is the four OOPs principles","Implement inheritance, abstraction, polymorphism and encapsulation","Understand interfaces, their importance, and their uses","Use abstract classes and interfaces to implement abstraction","Handle Exceptions","Read and Write files using the Files API","Do pattern matching using Regular expressions","Deal with data and time","All in simple steps"],"requirements":["Internet Connection"],"description":"<p><strong>Sample of the reviews:</strong></p><p><strong>Bharath truly knows how to teach, how to educate, and how to make you understand the meaning of his courses. Quite frankly, this guy is really good. You won't regret it!</strong> -- Didier K. Nzimbi</p><p><strong>As a beginner from non IT background, i learnt lot from this course and build a confidence to proceed in python coding and definitely recommending to pursue this course</strong> -- Mahesh Dedge</p><p><br><strong>Great course in Python, Bharath is the best instructor in Udemy, I like his way he teaches and how he structures his course. I come from a Java background and no prior experience with Python, which will be important for me to do with my AI project</strong> -- Bruno Militzer<br></p><p>----<br><br>Whether you are a&nbsp;<strong>College student </strong>learning the fundamentals of Python or a <strong>Data Science expert </strong>using python to analyze your data or a <strong>Web Developer</strong> using python frameworks like DJango or a <strong>Experienced python developer </strong>who wants to fill in the gaps , this course will help you accomplish your goals.</p><ul><li><p>Master the Features of&nbsp;Python Language</p></li><li><p>Install Python Virtual Machine&nbsp;and the&nbsp;Eclipse IDE(PyDev)</p></li><li><p>or Install PyCharm Community Edition</p></li><li><p>Execute your first python program</p></li><li><p>Learn various simple types as well as collection types lists , sets , maps and tuples</p></li><li><p><strong>Work on various Usecases to apply you Python knowledge</strong></p></li><li><p>Define logic using&nbsp;conditional statements ,looping constructs</p></li><li><p>Use the different types of operators</p></li><li><p>See the input and output functions in action</p></li><li><p>Pass Command line arguments</p></li><li><p>Create and use functions , Lambdas Decorators and Generators</p></li><li><p>Learn what Object Oriented Programming is the four OOPs principles</p></li><li><p>Implement&nbsp;inheritance, abstraction, polymorphism and encapsulation</p></li><li><p>Understand interfaces, their importance, and their uses</p></li><li><p>Use abstract classes and&nbsp;interfaces to implement abstraction</p></li><li><p>Spawn of multiple threads</p></li><li><p>Handle Exceptions</p></li><li><p>Read and&nbsp;Write files using the&nbsp;Files&nbsp;API</p></li><li><p>Do pattern matching using Regular expressions</p></li><li><p>Deal with data and time</p></li><li><p>Work with databases</p></li><li><p>Connect with MySql and Postgresql</p></li><li><p>Master the fundamentals of Unit Testing and Virtual Environments</p></li><li><p>All in simple steps</p></li></ul><p><strong>What are the requirements?</strong></p><ul><li><p>Python,PyCharm Community&nbsp;Edition or Eclipse IDE(Installation is covered in easy setup section)</p></li></ul>","suitableLearners":["Any student who wants to learn python in depth","Developers who are getting started with Python","Big Data professionals  who want to learn pythons quickly and in depth","Experienced developers who want to fill in any gaps in their knowledge"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-04-12T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-04-15T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["622c1fa5a2de424e23bbe971","6255171e87671dccf53fbc3c"],"topics":[],"reviews":[],"meta":{"ratingCount":19347,"studentCount":95705,"avgRatingScore":4.605712,"contentVideoLength":139837},"basicInfo":{"udemyCourseId":2365628,"slug":"complete-react-developer-in-2022-w-redux-hooks-graphql","title":"Complete React Developer in 2022 (w/ Redux, Hooks, GraphQL)","subtitle":"Updated! Become a Senior React Developer. Build a massive E-commerce app with Redux, Hooks, GraphQL, Stripe, Firebase","image":"https://img-c.udemycdn.com/course/240x135/2365628_0b60_9.jpg","price":1949670,"lan":"en","level":"beginner","currency":"vnd","isFree":false},"details":{"objectives":["Build enterprise level React applications and deploy to production (using React 18!)","Learn to build reactive, performant, large scale applications like a senior developer","Learn the latest features in React including Hooks, Context API, Suspense, React Lazy  + more","Master the latest ecosystem of a React Developer from scratch","Become the top 10% ReactJS Developer","Using GraphQL as a React Developer","Use Redux, Redux Thunk and Redux Saga in your applications","Learn to compare tradeoffs when it comes to different state management","Set up authentication and user accounts","Use Firebase to build full stack applications","Learn to lead React projects by making good architecture decisions and helping others on your team","Master React Design Patterns","Learn CSS in JS with styled-components","Routing with React Router","Converting apps to Progressive Web Apps","Testing your application with Jest, Enzyme and snapshot testing","Handling online payments with Stripe API","Using the latest ES6/ES7/ES8/ES9/ES10/ES11 JavaScript to write clean code"],"requirements":["Basic HTML, CSS and JavaScript knowledge","You do not need any experience with React or any other JS framework!"],"description":"<p><strong>Just FULLY updated and re-recorded with all new React features for 2022 (React v18)! Join a live online community of over 600,000+ developers and a course taught by industry experts that have actually worked both in Silicon Valley and Toronto with React.js.</strong> <br><br>Using the latest version of React <em>(React 18)</em>, this course is focused on efficiency. Never spend time on confusing, out of date, incomplete tutorials anymore. <strong>Graduates of Andrei’s courses are now working at Google, Tesla, Amazon, Apple, IBM, JP Morgan, Facebook, + other top tech companies.</strong></p><p>We guarantee you this is the most comprehensive online resource on React. This project based course will introduce you to all of the modern toolchain of a React developer in 2022. Along the way, we will build a massive e-commerce application similar to Shopify using React, Redux, React Hooks, React Suspense, React Router, GraphQL, Context API, Firebase, Redux-Saga, Stripe + more. This is going to be a full stack app (MERN stack), using Firebase.</p><p>The curriculum is going to be very hands on as we walk you from start to finish of releasing a professional React project all the way into production.&nbsp;We will start from the very beginning by teaching you React Basics and then going into advanced topics so you can make good decisions on architecture and tools on any of your future ReactJS projects. </p><p>All code is going to be provided step by step and even if you don’t like to code along, you will get access to the the full master project code so anyone signed up for the course will have their own project to put on their portfolio right away.<br><br>The topics covered will be:</p><p><strong>- React Basics</strong></p><p><strong>- React Router</strong></p><p><strong>- Redux</strong></p><p><strong>- Redux&nbsp;Saga</strong></p><p><strong>- Asynchronous Redux</strong></p><p><strong>- React Hooks</strong></p><p><strong>- Context API</strong></p><p><strong>- React Suspense + React Lazy</strong></p><p><strong>- Firebase</strong></p><p><strong>-&nbsp;Stripe API</strong></p><p><strong>- Styled-Components</strong></p><p><strong>- GraphQL</strong></p><p><strong>- Apollo</strong></p><p><strong>- PWAs</strong></p><p><strong>- React Performance</strong></p><p><strong>- React Design Patterns</strong></p><p><strong>- Testing with Jest, Enzyme and Snapshot testing</strong></p><p><strong>- React Best Practices</strong></p><p><strong>- Persistance + Session Storage</strong></p><p><strong>- State Normalization</strong></p><p><strong>+ more</strong></p><p><br></p><p>Wait wait… I know what you’re thinking. Why aren’t we building 10+ projects? Well, here’s the truth: Most courses teach you React and do just that. They show you how to get started, build 10 projects that are simple and easy to build in a day, and just add some CSS to make them look fancy. In real life though, you’re not building silly applications. When you apply to jobs, nobody is going to care that you built a really pretty To Do app. Employers want to see you build large apps that can scale, that have good architecture, and that can be deployed to production.</p><p><br></p><p><strong>Let me tell you 3 reasons why this course is different from any other React tutorial online:</strong></p><p><br></p><p><strong>1</strong>. You will build the biggest project you will see in any course. This type of project would take you months to implement yourself.</p><p><br></p><p><strong>2.</strong> This course is taught by 2 instructors that have actually worked for some of the biggest tech firms using React in production. Yihua has been working on some of the biggest e-commerce websites that you have definitely heard of and probably have shopped at. Andrei has worked on enterprise level React applications for large IPOed tech firms in Silicon Valley as well as Toronto. By having both of them teach, you get to see different perspective and learn from 2 senior developers as if you are working at a company together.</p><p><br></p><p><strong>3.</strong> We learn principles that are important beyond just what you learn as a beginner. Using the instructor's experiences you learn about design patterns, how to architect your app, organize your code, structure your folders, and how to think about performance. Let’s just say we don’t shy away from the advanced topics.</p><p><br></p><p>This course is not about making you just code along without understanding the principles so that when you are done with the course you don’t know what to do other than watch another tutorial. No! <strong>This course will push you and challenge you to go from an absolute beginner in React to someone that is in the top 10% of React developers.&nbsp;</strong></p><p><br></p><p><strong>Taught By:<br></strong></p><p>Andrei&nbsp;Neagoie is the instructor of the <strong>highest rated Development courses on Udemy as well as&nbsp;one of the fastest&nbsp;growing.&nbsp;</strong>His graduates have&nbsp;moved&nbsp;on to work for&nbsp;some of the biggest tech&nbsp;companies around the world like Apple, Google, Amazon, JP Morgan, IBM, UNIQLO etc...&nbsp;He&nbsp;has&nbsp;been working as a senior software developer in&nbsp;Silicon Valley and Toronto for many years,&nbsp;and&nbsp;is now taking all that he has learned,&nbsp;to teach&nbsp;programming skills and&nbsp;to help you&nbsp;discover the amazing career opportunities that being a developer allows in&nbsp;life.&nbsp;</p><p>Having been&nbsp;a self taught programmer,&nbsp;he understands that there is an&nbsp;overwhelming number of online courses, tutorials and books&nbsp;that are overly verbose and inadequate at teaching proper skills.&nbsp;Most people feel paralyzed and don't know where to start when learning a complex subject matter, or even worse, most people don't have $20,000 to spend on a coding bootcamp.&nbsp;<strong>Programming skills should be affordable and open to all. An education material&nbsp;should teach real life skills that are current and&nbsp;they should not waste a student's valuable time.</strong>&nbsp;&nbsp; Having learned important&nbsp;lessons from working for Fortune 500 companies, tech startups, to even&nbsp;founding his own business, he is now dedicating 100% of his time to&nbsp;teaching others valuable&nbsp;software development skills&nbsp;in order to take control of their life and work in an exciting industry with infinite possibilities.&nbsp;</p><p>Andrei promises you that there are no other courses out there as comprehensive and as well explained.&nbsp;<strong>He believes that in order to learn anything of value, you need to start with the foundation and develop the roots of the tree. Only from there will you be able to learn concepts and specific skills(leaves) that connect to the foundation. Learning becomes exponential when structured in this way.</strong>&nbsp;</p><p>Taking his experience in educational psychology and coding, Andrei's courses will take you on an understanding of complex subjects that you never thought would be possible.&nbsp;&nbsp; </p><p><strong>See you inside the courses!<br><br>--------<br><br>Yihua Zhang is one of the Instructors of Zero To Mastery, one of the highest rated and fastest growing Web Development academies on Udemy</strong>. He has been working as a software developer for numerous years in Toronto for some of the largest tech companies in the world. He has also been working as an instructor for more than a decade. He is focused on bringing everything he has learned to help you achieve a new career as a developer, but also give you all the fundamental skills required to flourish in this incredible industry.</p><p><br></p><p>Yihua is a self taught developer, so he fully understands the challenges and mindset of coming into this industry from various other backgrounds. He has been on both sides of the table, as both an instructor and student numerous times so he can empathize with the difficulty of learning something new and challenging. Learning itself is a skill that needs to be practiced and improved upon, and he is dedicated to helping you improve and master that skill for yourself. Courses need to be practical, you need to be able to understand why you are learning the things that you are being taught. You need to understand the problem before you know the solution, and he prides himself on teaching you how to build professional, real world applications so you truly understand why you are doing things a specific way. He will teach you the mindset and skillset required to grow as a developer as fast as possible, so you can have the rich and fulfilling life that comes with this career.</p><p><br></p><p>Yihua's courses will guide you to build beautifully written and richly featured applications, while truly understanding all the complex concepts you will encounter along the way.</p><p><br></p><p><br></p>","suitableLearners":["Students who are interested in going beyond a normal \"beginner\" tutorial","Programmers who want to learn the most in demand skill of a web developer","Developers that want to be in the top 10% of React Developers","Students who want to gain experience working on a scalable large application","Bootcamp or online tutorial graduates that want to go beyond the basics"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-04-14T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-04-17T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["622c1fa5a2de424e23bbe971","6255171e87671dccf53fbc3c"],"topics":[],"reviews":[],"meta":{"ratingCount":18248,"studentCount":78610,"avgRatingScore":4.6256895,"contentVideoLength":107213},"basicInfo":{"udemyCourseId":1455016,"slug":"build-an-app-with-aspnet-core-and-angular-from-scratch","title":"Build an app with ASPNET Core and Angular from scratch","subtitle":"A practical example of how to build an application with ASP.NET Core API and Angular from start to finish","image":"https://img-b.udemycdn.com/course/240x135/1455016_0b2d_2.jpg","price":1949670,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["Learn how to build a web application from start to publishing using ASPNET Core (v2.1), Entity Framework Core and Angular (v6)","Students who complete this course will have a practical understanding of Angular and ASPNET Core","Understand how to structure an Angular application using best practices","Learn how to integrate 3rd party components into the Angular application","Use Visual Studio code effectively to improve workflow","Use AutoMapper","Implement drag and drop photo upload integrating into a cloud platform","Implement a private messaging system","Implement filtering, sorting and paging of data","Display notifications in Angular","Implement Authentication using JWT Authentication tokens","Handling errors in the API and the SPA","Persist data using Entity Framework Core","Real time notifications and presence using SignalR"],"requirements":["Hello world experience in ASPNET Core and Angular","A passion for wanting to learn how to build a fully functional Web Application"],"description":"<p><strong>This course has been updated for .Net 6.0 and Angular 12.&nbsp; &nbsp;</strong></p><p>Have you learnt the basics of ASP.NET&nbsp;Core and Angular?&nbsp;&nbsp;Not sure where to go next? &nbsp;This course should be able to help with that. &nbsp;In this course we start from nothing and incrementally build up our API&nbsp;and Angular front end until we have a fully functional Web Application that we then publish to IIS&nbsp;and a Linux server.</p><p>These are 2 of the hottest frameworks&nbsp;right now for the 'back-end' (Microsoft's ASP.NET Core) and the 'front-end'&nbsp;(Google's Angular) and are well worth spending the time to learn.</p><p>In this course we build a <strong>complete application from start to finish and every line of code is demonstrated and explained.</strong><br></p><p>This course is right up to date as at November 2021 using .Net 6.0 and Angular v12 and as these frameworks evolve, this course will evolve with it.&nbsp;&nbsp;</p><p>Read some of the great reviews of the course:</p><p>Jim says <strong>\"The absolute best course for building an API in .Net core and working with Angular!\"</strong></p><p>Daniyal says:&nbsp;\"<strong>This is a complete project based course from start to finish with real world experience using technologies that are currently in demand in the market. People interested in learning latest technologies should consider this course.</strong>\"</p><p>Here are some of the things you will learn about in this course:</p><ul><li><p>Setting up the developer environment</p></li><li><p>Creating the ASP.NET Core WebAPI and the Angular app using the DotNet CLI and the Angular CLI</p></li><li><p>Adding a Client side login and register function to our Angular application</p></li><li><p>Adding 3rd party components to add some pizzazz to the app</p></li><li><p>Adding routing to the Angular application and securing routes.</p></li><li><p>Using Automapper in ASP.NET Core</p></li><li><p>Building a great looking UI using Bootstrap</p></li><li><p>Adding Photo Upload functionality as well as a cool looking gallery in Angular</p></li><li><p>Angular Template forms and Reactive forms and validation</p></li><li><p>Paging, Sorting and Filtering</p></li><li><p>Adding a Private Messaging system to the app</p></li><li><p>Publishing the application to Heroku free of charge</p></li><li><p>Using SignalR for real time presence and live messaging between users</p></li><li><p>Many more things as well</p></li></ul><p><strong>Tools you need for this course</strong></p><p>In this course all the lessons are demonstrated using Visual Studio Code, a free (and fantastic) cross platform&nbsp;code editor.&nbsp;&nbsp; You can of course use any code editor you like and any Operating system you like... as long as it's Windows, Linux or Mac<br></p><p><strong>Is this course for you?</strong></p><p>This course is very practical, about 90%+ of the lessons will involve you coding along with me on this project.&nbsp; If you are the type of person who gets the most out of learning by doing, then this course is definitely for you.&nbsp;&nbsp;<br></p><p>On&nbsp;this course we will build an example Dating Application, completely from&nbsp;scratch using the DotNet CLI and the Angular CLI to help us get started.&nbsp; All you will need to get started is a&nbsp;computer with your favourite operating system, and a passion for learning how&nbsp;to build an application using ASP.NET Core and Angular.&nbsp;&nbsp;</p>","suitableLearners":["Beginners to ASPNET Core and Angular who want to learn practical usage of these frameworks to build a compelling and functional application","Students who like to learn by doing rather than learning by theory"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2021-11-09T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2021-11-12T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["622c1fa5a2de424e23bbe971","6255171e87671dccf53fbc3c"],"topics":[],"reviews":[],"meta":{"ratingCount":17648,"studentCount":76638,"avgRatingScore":4.730205,"contentVideoLength":150169},"basicInfo":{"udemyCourseId":1010586,"slug":"become-a-wordpress-developer-unlocking-power-with-code","title":"Become a WordPress Developer: Unlocking Power With Code","subtitle":"Learn PHP, JavaScript, WordPress theming & the WP REST API to Create Custom & Interactive WordPress Websites","image":"https://img-c.udemycdn.com/course/240x135/1010586_b622_3.jpg","price":3211370,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["Why code is the key to building whatever you can imagine with WordPress","The ability to write PHP to manipulate the data of a WordPress site","The ability to write JavaScript to add on-the-fly interactivity to a WordPress site","How to code your own new custom block types for the \"Gutenberg\" Block Editor","The skills, knowledge and vocabulary to work professionally as a WordPress developer"],"requirements":["Basic WordPress knowledge (how to create a blog post, etc...)","A basic understanding of HTML (e.g. \"p\" is for paragraph, \"h1\" is for headline, etc...)","No CSS knowledge required (although it helps to understand that CSS is used to add style & design to a page)","No JavaScript knowledge required (although it helps to understand that JS is used to add interactivity to a page)"],"description":"<p>Unlock the full power of WordPress and go beyond \"just a blog platform\" by learning how to code completely custom WordPress powered sites.</p><p><strong>Updated for 2019:</strong> A new 3 part lesson on coding our own custom block type for the new \"Gutenberg\" Block Editor in WordPress.</p><p>I've spent the last 12 years studying <strong>WordPress</strong>, <strong>PHP</strong>, and <strong>JavaScript</strong> and now I'm here to teach you everything I know. Come along on this journey with me and <strong>become a WordPress developer</strong>. </p><p>Together we will build a website for a fictional university and along the way we will:</p><ul><li><p>Install WordPress on your personal computer so you have a private playground copy of WordPress to practice and experiment with</p></li><li><p>Get introduced to the <strong>PHP</strong> language (this is what powers WordPress)</p></li><li><p>Set Up a New Theme (You'll learn how to convert any HTML template into a living breathing WordPress theme)</p></li><li><p>Create Custom Post Types and Custom Fields</p></li><li><p>Relate pieces of content with each other (e.g. a professor and a program)</p></li><li><p>Learn the basics of (object-oriented) JavaScript</p></li><li><p>Leverage the <strong>WP REST API</strong></p></li><li><p>Learn to use JavaScript to communicate with the WordPress back-end <strong>on-the-fly</strong></p></li><li><p>Let visitors sign up for a basic account on our site</p></li><li><p>Build a \"My Notes\" feature (user specific single page application with <strong>real-time CRUD actions</strong>)</p></li><li><p>Let users \"like\" or \"heart\" a professor (update the professor's like count on-the-fly)</p></li><li><p>Deploy our website <strong>live up onto the web</strong> for the entire world to view</p></li><li><p>And much more!</p></li></ul><p><br></p><p>This course may be brand new, but this isn’t my first time teaching. I’ve led training sessions for Fortune 500 companies and I’ve already helped over 17,000 people on Udemy and received the following feedback:</p><p><em>\"Brad definitely has some of the best techniques to embed the lesson into your mind… hands down these are the best tutorials I have had the opportunity to view.\"</em></p><p><em>\"Presentation is concise without being tedious… you honestly feel that you have a thorough understanding of the subject.\"</em></p><p><em>\"…[Brad] explained the process. Not memorize this or that, he explained the process. If you're looking to take a course to understand the foundations of creating websites, look no further.\"</em></p><p>Become highly valuable and relevant to the companies that are hiring WordPress developers; in one convenient place alongside one instructor. If you're ready to begin coding custom websites - I'll see you on the inside!</p>","suitableLearners":["Developers who want to use WordPress as a true Content Management System and not \"just a blog platform.\"","Those looking to learn the PHP and JavaScript languages.","People who want to learn about the \"REST API\" which allows us to interact with WordPress data on-the-fly in realtime.","Anyone interested in custom post types, custom fields, and creating relationships between various content types."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-04-02T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-04-05T00:00:00.000Z"},"promotions":{"discountPrice":458800,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["622c1fa5a2de424e23bbe971","6255171e87671dccf53fbc3c"],"topics":[],"reviews":[],"meta":{"ratingCount":17470,"studentCount":72091,"avgRatingScore":4.586239,"contentVideoLength":37020},"basicInfo":{"udemyCourseId":719002,"slug":"angular-crash-course-for-busy-developers","title":"Angular Crash Course for Busy Developers","subtitle":"Have limited time to learn Angular 4 (Angular 2+)? Take this course and learn Angular in 10 hours!","image":"https://img-c.udemycdn.com/course/240x135/719002_af70_3.jpg","price":2064370,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["Master the essential Angular concepts","Troubleshoot common runtime errors","Write cleaner, more maintainable code"],"requirements":["Basic familiarity with HTML, CSS and JavaScript","No prior knowledge of earlier versions of Angular is required"],"description":"<p>Chances are you have heard that Angular developers are in demand these days. And you are here to learn Angular fast. <br></p>\n\n<p><br></p>\n\n\n\n\n\n<p>There are tons of great courses out there for learning Angular. But most these courses are more than 20 hours long.<strong> If you're a busy developer and need to quickly pick up Angular, this is the ideal course for you.</strong> </p>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p>This course contains 20 hours of content but<strong> you only need to watch the first 10 hours</strong>. The other 10 hours are recorded with an earlier version of Angular. You don't need to watch those videos. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p>So,<strong> in  just 10 hours, you can learn all the essential Angular concepts! </strong>You can simply dedicate a weekend to this course and by the end of the weekend you'll have a good understanding of Angular and you'll be able to build real client apps with Angular. </p>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p><strong></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>More specifically, you'll learn about: </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li><strong>Fundamentals of TypeScript and object-oriented programming </strong></li><li><strong>Displaying data and handling events</strong></li><li>Building re-usable <strong>components</strong></li><li>Manipulating the DOM using <strong>directives</strong> </li><li>Formatting data using <strong>pipes</strong></li><li>Building <strong>template-driven and reactive forms </strong></li><li><strong>Consuming </strong><strong>HTTP services </strong></li><li><strong>Handling HTTP errors </strong>properly </li><li>Using <strong>Reactive Extensions</strong> and observables </li><li>Adding <strong>routing and navigation</strong></li></ul>\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>You don't need any prior knowledge of earlier versions of Angular.</strong> As long as you have some<strong> basic familiarity with HTML, CSS and JavaScript</strong> you can take this course and start learning Angular right now!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>\n</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Every section includes a few <strong>bite</strong>-<strong>sized videos</strong> and concludes with a <strong>coding exercise </strong>to help you master what you learn in that section. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Reviewed by Todd Motto (Google Developer Expert):</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Mosh has a fantastic teaching style, and just delivered the best online course I've seen in a long time. Mosh's approach to teaching and guiding makes no assumptions on existing Angular 1.x knowledge, but helps those who have to clarify new concepts. Mosh guides you through critical concepts slowly without skipping over details, and the course is extremely worth investing a few hours in, your understanding of Angular 2 will reach new levels. He fills all the gaps, presents impeccably well and the preparation was top notch, seriously can't recommend the course enough.\n\n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>WHAT OTHER STUDENTS WHO HAVE TAKEN THIS COURSE SAY:</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\"Great course, even for seasoned developers. I'm a ReactJs developer using this to broaden my horizons!\" -Tyler Markvluwer</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>\n\n</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\"Mosh is a great instructor, he is very clear and concise and breaks down his examples into small \"components\" (drum roll please). Having never used Angular before, I'm really impressed at how easy it was to understand the concepts and even managed most of the examples without having to refer back to the lectures and that is in no small part due to Mosh's understanding of Angular and how well he explains everything. If you can't already tell, I'm really impressed Mosh\" -Chris Graham</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\"It's the best angular2 video that i ever seen. It's all well explained and easy to understand. It's not need have angular1 knowledge. I'm happy because i've grown as a developer. Thanks\" -Miguelangel Cabrera</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\"Very good step by step explainations. Focus on \"why\", then \"how\" instead of \"type after me\". Love it!\" -Krysztof Gurniak</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\"As the absolute Angular newbie I was, I can recommend this course 100%.\" -Guillermo Aguyanes</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\"Mosh does a great job at explaining templates, directives, dependency injections and everything else. 10/10 would take his course again.\" -Rob</p>\n\n\n\n\n\n<p><strong></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>\n\n</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>\n\n</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>30-DAY FULL MONEY-BACK GUARANTEE</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This course comes with a 30-day full money-back guarantee. Take the course, watch every lecture, and do the exercises, and if you feel like you haven't gained the confidence to build real-world apps with Angular, ask for a full refund within 30 days. <strong>All your money back, no questions asked</strong>.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>ABOUT YOUR INSTRUCTOR</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Mosh (Moshfegh) Hamedani is a software engineer with 17 years of professional experience. He is a Pluralsight author and a Udemy instructor with <strong>several best-selling courses</strong> with <strong>more than 130,000 students in 195 countries</strong>. His students describe him as passionate, pragmatic and motivational in his teaching.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong></strong></p>\n\n\n\n\n\n<p>So, if you're looking for an Angular course that quickly teaches you the absolute essentials, don't look further. </p>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p><strong>Enroll in the course now and</strong><strong> you'll build your first Angular app within 10 minutes!</strong><br></p>\n\n\n\n<p><br></p>","suitableLearners":["Web developers wanting to build apps with Angular 2+"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2018-04-25T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2018-04-28T00:00:00.000Z"},"promotions":{"discountPrice":298220,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["622c1fa5a2de424e23bbe971","6255171e87671dccf53fbc3c"],"topics":[],"reviews":[],"meta":{"ratingCount":16711,"studentCount":92347,"avgRatingScore":4.645545,"contentVideoLength":60723},"basicInfo":{"udemyCourseId":970600,"slug":"rest-apis-with-flask-and-python","title":"REST APIs with Flask and Python","subtitle":"Build professional REST APIs with Python, Flask, Flask-RESTful, and Flask-SQLAlchemy","image":"https://img-c.udemycdn.com/course/240x135/970600_68be_4.jpg","price":1949670,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["Connect web or mobile applications to databases and servers via REST APIs","Create secure and reliable REST APIs which include authentication, logging, caching, and more","Understand the different layers of a web server and how web applications interact with each other","Handle seamless user authentication with advanced features like token refresh","Handle log-outs and prevent abuse in your REST APIs with JWT blacklisting","Develop professional-grade REST APIs with expert instruction"],"requirements":["Some prior programming experience in any programming language will help. The course includes a full Python refresher course.","All software used in the course is provided, and completely free","Complete beginners may wish to take a beginner Python course first, and then transition to this course afterwards"],"description":"<p><strong>Are you tired of boring, outdated, incomplete, or incorrect tutorials?</strong> I say no more to copy-pasting code that you don’t understand.</p><p>Welcome to the bestselling REST&nbsp;API course on Udemy! I'm Jose. I'm a software engineer, here to help you truly understand and develop your skills in web and REST&nbsp;API development with Python and Flask.<br></p><p><strong>Production-ready REST&nbsp;APIs with Flask</strong></p><p>This course will guide you in creating <strong>simple, intermediate, and advanced</strong> REST APIs including <strong>authentication</strong>, <strong>deployments</strong>, <strong>databases</strong>, and <strong>much more</strong>.</p><p>We'll start with a Python refresher that will take you from the very basics to some of the most advanced features of Python—that's all the Python you need to complete the course.</p><p>Using <strong>Flask</strong> and popular extensions <strong>Flask-RESTful</strong>, <strong>Flask-JWT</strong>, and <strong>Flask-SQLAlchemy</strong> we will dive right into developing complete, solid,&nbsp;production-ready REST&nbsp;APIs.</p><p>We will also look into essential technologies <strong>Git</strong>, <strong>Heroku</strong>, and <strong>nginx</strong>.</p><p><strong>You'll be able to...</strong></p><ul><li><p>Create resource-based, production-ready REST&nbsp;APIs using Python, Flask, and popular Flask extensions;</p></li><li><p>Handle secure user registration and authentication with Flask.</p></li><li><p>Using SQLAlchemy and Flask-SQLAlchemy to easily and efficiently store resources to a database; and</p></li><li><p>Understand the complex intricacies of deployments and the performance of Flask REST&nbsp;APIs.</p></li></ul><p><br></p><p><strong>But what is a REST&nbsp;API anyway?</strong></p><p>A REST&nbsp;API is an application that accepts data from clients and returns data back. For example, a REST&nbsp;API could accept text data from the client, such as a username and password, and return whether that is a valid user in the database.</p><p>When developing REST&nbsp;APIs, our clients are usually web apps or mobile apps. That's in contrast to when we make websites, where the clients are usually the users themselves.</p><p>Together we'll develop a REST&nbsp;API that not only allows clients to authenticate but also to store and retrieve any data you want from a database. Learning this will help you develop any REST&nbsp;API that you need for your own projects!</p><p><br></p><p>I pride myself on providing <strong>excellent support and feedback</strong> to every single student. I am <strong>always available to guide you and answer your questions</strong>.</p><p>I'll see you on the inside. Take your first step towards REST&nbsp;API mastery!</p>","suitableLearners":["Students wanting to extend the capabilities of mobile and web applications by using server-side technologies","Software developers looking to expand their skill-set by learning to develop professional grade REST APIs","Those looking to learn Python while specifically catering to web services"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-04-06T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-04-09T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["622c1fa5a2de424e23bbe971","6255171e87671dccf53fbc3c"],"topics":[],"reviews":[],"meta":{"ratingCount":13929,"studentCount":79647,"avgRatingScore":4.570282,"contentVideoLength":91994},"basicInfo":{"udemyCourseId":1254420,"slug":"node-with-react-fullstack-web-development","title":"Node with React: Fullstack Web Development","subtitle":"Build and deploy fullstack web apps with NodeJS, React, Redux, Express, and MongoDB.","image":"https://img-c.udemycdn.com/course/240x135/1254420_f6cb_4.jpg","price":1949670,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["Create boilerplate starter projects with React, Redux, Express, and Mongo","Understand common web technologies and design patterns to connect them together","Master deployment techniques between the production and development environments","Make an app with Google OAuth authentication","Learn to effectively create and send emails from a backend server","Accept and process credit card payments from users"],"requirements":["Basic understanding of Javascript, React, and Redux","A Mac, Windows, or Linux computer"],"description":"<p><em>Note: This course assumes you've got the basics of React and Redux down.  Check out my course 'Modern React with Redux', its the perfect preparation!</em></p>\n\n<p>Go beyond the basics of React and Redux!  This course will teach you <strong>to combine the ultra-popular React, Redux, Express, and MongoDB technologies to build a fullstack web application.</strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong></strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong>Advanced Deployment?</strong> You will learn it.  <strong>Billing/Payments</strong><strong>? </strong>Included.  <strong>Handling Email</strong><strong>? </strong>Of course!</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>------------------------------</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><em>What Will You Build?</em></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>All of my courses are 'learn-by-doing': no boring endless lectures with Powerpoints, only live, interactive coding examples.  In this course we'll build <strong>one massive web application</strong> that profiles the <strong>advanced features of React, Redux, Express, and Mongo</strong>.  By putting each concept into a real app, you'll get a better idea of when to use each unique and powerful feature.\n</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Build a large feedback-collection app. </strong>This mega app will include the full gamut of features, including everything from authentication to email handling.  You'll learn how to build an app that can be used to send mass emails to a big list of users for the purpose of collecting feedback.  It's my goal to ensure you understand each feature we build into this app so you can apply them to your own personal or professional projects in the future.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>------------------------------</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Here's what we'll learn:</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Learn the architectural considerations of building a full stack app</li><li>Connect a front-end <strong>Create-React-App</strong> server to a NodeJS and Express backend</li><li>Communicate data from your <strong>Mongo</strong> database to your React application</li><li>Understand how to route user requests on the front end with <strong>React Router</strong> and on the backend with Express</li><li>Build reusable user inputs with <strong>Redux Form</strong>, complete with navigation</li><li>Handle credit cards and receive payments from your users with <strong>Stripe</strong></li><li>Engage your users with automated <strong>emails</strong><strong></strong></li><li>Enhance authentication flows in your app with <strong>Google OAuth authentication</strong><strong></strong></li><li>Separate production and development resources with advanced <strong>API key handling techniques</strong></li><li>Educate your users on how to use your app with<strong> custom build landing</strong> pages</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I've built the course that I would have wanted to take when I was learning to build fullstack apps. A course that explains the concepts and how they're implemented in the best order for you to learn and deeply understand them.</p>","suitableLearners":["Anyone who wants to learn how to build full stack apps with the latest in web technology"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-04-01T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-04-04T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["622c1fa5a2de424e23bbe971","6255171e87671dccf53fbc3c"],"topics":[],"reviews":[],"meta":{"ratingCount":13263,"studentCount":86908,"avgRatingScore":4.730965,"contentVideoLength":46266},"basicInfo":{"udemyCourseId":1409142,"slug":"the-coding-interview-bootcamp-algorithms-data-structures","title":"The Coding Interview Bootcamp: Algorithms + Data Structures","subtitle":"Ace your next Javascript coding interview by mastering data structures and algorithms.","image":"https://img-b.udemycdn.com/course/240x135/1409142_1879_8.jpg","price":2064370,"lan":"en","level":"expert","currency":"vnd","isFree":false},"details":{"objectives":["Master commonly asked interview questions","Tackle common data structures used in web development","Practice dozens of different challenges","Use Javascript to solve challenging algorithms"],"requirements":["Basic understanding of Javascript"],"description":"<p><strong>Data Structures? </strong>They're here.  <strong>Algorithms?  </strong>Covered.  <strong>Lots of questions with well-explained solutions?  </strong>Yep!</p>\n\n<p>If you're nervous about your first coding interview, or anxious about applying to your next job, this is the course for you.  I got tired of interviewers asking tricky questions that can only be answered if you've seen the problem before, so I made this course!  This video course will teach you the most common interview questions that you'll see in a coding interview, giving you the tools you need to ace your next whiteboard interview.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Coding interviews are notoriously intimidating, but there is <strong>one method to become a better interviewer</strong> - and that is practice!  Practicing dozens of interview questions is what makes the difference between <strong>a job offer for a $120k USD</strong> and another rejection email.  This course is going to not only give you dozens of questions to practice on, but it will also make sure you <strong>understand the tricks</strong> behind solving each question, so you’ll be able to perform in a real interview.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I have spent many hours combing through interview questions asked at <strong>Google</strong>, <strong>Facebook</strong>, and <strong>Amazon</strong> to make sure you know how to answer questions asked by the most well-paying companies out there.  No stone is left unturned, as we discuss everything from the simplest questions all the way to the most complex algorithm questions.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>In this course, you'll get:</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li><strong></strong>Clear, well-diagramed explanations for every single problem to make sure you <strong>understand </strong>the solution</li><li>An overview of the <strong>most important data structures</strong> to know about.  These are presented for people <em>without </em>a CS degree.</li><li>A <strong>huge collection</strong> of common algorithm questions, including everything from 'reversing a string' to 'determine the width of a BST'</li><li>Sensible strategies for tackling <strong>systems design problems</strong></li><li>Insider tips on answering what interviewers area really looking for</li><li><strong>Constant support</strong> on the Udemy Q&amp;A forums from me!</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>My goal in this course is to help you defeat those interviewers who ask nasty algorithm questions.  Sign up today, and be the cutting edge engineer who will be prepared to get a high paying job</p>","suitableLearners":["Anyone preparing for an interview that will involve coding challenges"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-04-01T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-04-04T00:00:00.000Z"},"promotions":{"discountPrice":389980,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["622c1fa5a2de424e23bbe971","6255171e87671dccf53fbc3c"],"topics":[],"reviews":[],"meta":{"ratingCount":12173,"studentCount":47824,"avgRatingScore":4.692492,"contentVideoLength":106749},"basicInfo":{"udemyCourseId":1470810,"slug":"the-modern-javascript-bootcamp","title":"The Modern JavaScript Bootcamp","subtitle":"Learn JavaScript by building real-world apps. Includes 3 real-world projects, 80 programming challenges, and ES6/ES7!","image":"https://img-b.udemycdn.com/course/240x135/1470810_a8b0.jpg","price":1949670,"lan":"en","level":"all","currency":"vnd","isFree":false},"details":{"objectives":["Learn JavaScript by building three real-world web applications","Gain a deep understanding of how JavaScript works behind the scenes","Explore the latest cutting-edge features from ES6 and ES7","Test your skills and gain confidence by completing over 80 coding challenges","Learn how to deploy your application to the web so you can share them with everyone","Learn how to use Promises and Async/Await with asynchronous JavaScript","Get more done by learning how to debug and fix your code when things go wrong","Get access to a free 80 page PDF guide with lecture notes, code samples, and documentation links"],"requirements":["No programming experience is required to take this course. I’ll walk you through the entire process from scratch!","All you need is a computer (Windows, macOS, or Linux) with an internet connection (Windows, macOS, or Linux)"],"description":"<p><strong>Have you tried to learn JavaScript before?</strong></p>\n\n<p>JavaScript is the most popular programming language out there, but that doesn’t mean it’s easy to learn. You end up wasting time on out-of-date courses and incomplete YouTube tutorials that talk about a JavaScript features without showing how to use them when building real-world applications.</p>\n\n\n\n<p>Sound familiar?</p>\n\n\n\n<p><strong>I built this course to teach you how to build and launch your own JavaScript web applications. </strong></p>\n\n\n\n<p>The Modern JavaScript Bootcamp starts from scratch and builds up your knowledge of the JavaScript language. Yes, you’ll learn all the features of the language, but you’ll also learn how to use those features together to create a complete application.</p>\n\n\n\n<p>This comprehensive course covers the modern ES6 and ES7 JavaScript features used in the real world. You’ll gain an understanding of the latest cutting-edge language features. </p>\n\n\n\n<p>Getting experience writing code on your own is a big part of learning JavaScript. <strong>That’s why I’ve included over 80 challenges designed to get you writing code, adding app features, and solving a wide range of problems.</strong> These challenges will give you the skills and confidence needed to create your own web application.</p>\n\n\n\n<p>There are no starter projects here. You’ll see what it takes to launch a JavaScript application, from the first line of code to the final deployed application.</p>\n\n\n\n<p><strong>Who’s this course for?</strong></p>\n\n\n\n<p><strong>1. People who are brand new to JavaScript. </strong>You want to dive into the world of programming and learn JavaScript. This might be your first programming course, or maybe you’ve worked with other languages before. Either way, you’re ready for this bootcamp.</p>\n\n\n\n<p><strong>2. People who currently use JavaScript but want a better sense of mastery over the language. </strong>You picked up little tricks and snippets of code because you needed to solve a problem. Now you’re ready to master JavaScript as well as explore the latest from ES6 and ES7.</p>\n\n\n\n<p><strong>You’ll learn JavaScript by doing, not watching.</strong></p>\n\n\n\n<p>This course is not about watching videos, it’s about writing code. From the start, you’ll be building out each project from scratch as well as completing over 80 challenges designed to test and reinforce what you’ve learned.</p>\n\n\n\n<p>During the class, you’ll build three JavaScript applications:</p>\n\n\n\n<p>1. The first app, a note-taking app, is our starter application. You’ll learn the fundamentals of JavaScript and see exactly what it takes to build a program that allows users to add, edit, delete, and save their notes.</p>\n\n\n\n<p>2. The second app, a to-do application, you’ll be building on your own. This will test your skills and ensure that you have the real-world experience and problem-solving skills that are essential for writing JavaScript code.</p>\n\n\n\n<p>3. The last app, a hangman word game, is used to explore the world of asynchronous JavaScript. You’ll learn how to set up applications that rely on data from third-party services that can offer up dynamic, real-time information such as the user’s current location.</p>\n\n\n\n<p><strong>Stay current in an ever changing world.</strong></p>\n\n\n\n<p>The world of JavaScript is always changing, and that’s why I work to keep this course as up-to-date as possible. You can join knowing you’ll be learning the fundamentals of the language as well as the new language features that keep coming out.</p>\n\n\n\n<p>This course uses the latest language features from ES6 and ES7.</p>\n\n\n\n<p><strong>Everything you need comes in one easy-to-use package.</strong></p>\n\n\n\n<p>There’s no need to worry if you’re learning the right skills to land that JavaScript job or launch that JavaScript app. I’ve mapped out everything you need to know in an interactive, easy-to-follow package designed to get you up and running in a couple of weeks.</p>\n\n\n\n<p>By the end, you’ll be able to build and launch your own applications.</p>\n\n\n\n<p><strong>There’s no better time to learn JavaScript.</strong></p>\n\n\n\n<p>You’ve made a smart choice, because JavaScript is the most popular programming language out there. This is no exaggeration. This popularity and growth means more jobs and opportunities than ever before.</p>\n\n\n\n<p>JavaScript powers the web. That means every company out there uses JavaScript, and the demand for JavaScript developers is only increasing. Companies from Google and Apple to Udemy itself all use JavaScript extensively. </p>\n\n\n\n<p>JavaScript doesn’t stop with the web. It has quickly become a universal programming language capable of anything. JavaScript can be used to create desktop apps, server-side applications, native iOS/Android applications, and so much more. This course is your ticket into that ecosystem. </p>\n\n\n\n<p><strong>Get access to fast support if you get stuck.</strong></p>\n\n\n\n<p>There’s nothing worse than getting stuck ten hours into a course and not getting the help you need to continue. Getting stuck is part of the learning process. That’s why I’m here to answer every single question that comes my way.</p>\n\n\n\n<p>I’ll work with you to get you unstuck and back on track. It’s one of the reasons students love taking my courses. Don’t take my word for it. Check out the student reviews below.</p>\n\n\n\n<p><em>“This is the absolute best course I've taken on Udemy. Andrew is amazing at explaining things concisely, and the flow of the course is perfect. He doesn't skip over anything and he doesn't over-explain anything. On top of all that, he responds to questions so quickly that you won't be stuck at any point.\"</em> - Tanya Gamarian</p>\n\n\n\n<p><em>\"The lessons are of high quality and even more important, he actually takes time to answer your questions!\"</em> - Thomas Vercamer</p>\n\n\n\n<p>I guarantee that this is the most up-to-date and engaging JavaScript course available, and it comes with a Udemy 30-day money-back guarantee.</p>\n\n\n\n<p>I can’t wait to see you on the inside!</p>\n\n\n\n<p>- Andrew</p>","suitableLearners":["Learning JavaScript for the first time? Already using JavaScript and want to master the language? This course is for you!","This course if for anyone who wants to use JavaScript to launch an application, switch careers, or freelance as a JavaScript developer."],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2020-11-29T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2020-12-02T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}},{"status":"active","categories":["622c1fa5a2de424e23bbe971","6255171e87671dccf53fbc3c"],"topics":[],"reviews":[],"meta":{"ratingCount":11595,"studentCount":48517,"avgRatingScore":4.6553106,"contentVideoLength":22453},"basicInfo":{"udemyCourseId":861624,"slug":"es6-javascript-the-complete-developers-guide","title":"ES6 Javascript: The Complete Developer's Guide","subtitle":"ES6 Javascript Development from scratch.  Get practice with live examples and learn exactly where to apply ES6 features.","image":"https://img-b.udemycdn.com/course/240x135/861624_864d_2.jpg","price":1834970,"lan":"en","level":"intermediate","currency":"vnd","isFree":false},"details":{"objectives":["Learn how to apply each feature of ES6 in practical situations","Understand the major features of ES6","Have total mastery of generators","Know the difference between ES6 and ES2015","Teach other developers about destructuring","Never need to write a for loop again!"],"requirements":["Basic knowledge of Javascript is required (Arrays, Functions, Object)"],"description":"<p>This is the tutorial you've been looking for to master ES6 Javascript.</p>\n\n<p><strong class=\"redactor-inline-converted\">Generators? </strong>We got it. <strong class=\"redactor-inline-converted\">Arrow Functions</strong><strong class=\"redactor-inline-converted\">?</strong> Of course. <strong class=\"redactor-inline-converted\">Rest/Spread Operator?</strong> Included! <strong>And every other new piece of syntax!</strong>\n</p>\n\n<p>Mastering ES6 syntax can get you a position in web development or help you build that personal project you've been dreaming of. It's a skill that will put you more in demand in the modern web development industry, especially with the release of modern web frameworks like React and Angular 2.</p>\n\n<p>This course will get you up and running quickly, and teach you the core knowledge you need to deeply understand and build applications using each new piece of Javascript syntax introduced with ES6.</p>\n\n<p>We'll start by mastering the fundamentals of iteration over Arrays using helpers like 'forEach', 'map', and 'reduce'.  After an introduction to Array helpers, we'll dive right in to advanced ES6, covering topics like enhanced object literals, default function arguments, and classes.  Every topic includes multiple live code exercises to ensure you understand each new concept.</p>\n\n<p>If you are new to Javascript or ES6, or if you've been working to learn it but sometimes feel like you still don't quite 'get it', this is the Javascript course for you! To learn ES6 you have to understand it and comprehend exactly <strong>why</strong> each piece of syntax was added to the language</p>\n\n<ul><li>Learn the purpose of Babel and why ES6 was created</li><li>Master the process of refactoring your current ES5 code into super-charged ES6</li><li>Grasp the difference between the 'rest' and 'spread' operators</li><li>Develop complex applications that scale in complexity by mastering advanced ES6 design patterns</li><li>Dive deeper into iteration using generators.  No fancy terms required!</li></ul>\n\n<p>I've built the course that I would have wanted to take when I was learning ES6. A course that explains the concepts and how they're implemented in the best order for you to learn and deeply understand them.</p>","suitableLearners":["Take this course if you're wondering when to use generators","Enroll now if you want to learn exactly why 'const' and 'let' were added to ES6","Sign up now if you want to write better-looking code"],"sections":[]},"messages":{"welcome":"","congratulations":""},"history":{"createdAt":"2022-04-01T00:00:00.000Z","createdBy":"622c1f382e96f2828a7dae2d","publishedAt":"2022-04-04T00:00:00.000Z"},"promotions":{"discountPrice":275280,"startAt":"2022-01-31T17:00:00.000Z","endAt":"2023-01-31T17:00:00.000Z","enabled":true}}]